Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-4/creating-benchtop-test-program-labview.po
Languages: es_mx

source: Creating your Benchtop Test Program (LabVIEW)
es_mx: Creación del programa de pruebas para la mesa de trabajo (LabVIEW)

source: This document covers how to create, build and load an FRC\ |reg| LabVIEW program onto a roboRIO. Before beginning, make sure that you have installed LabVIEW for FRC and the FRC Driver Station and that you have configured and imaged your roboRIO as described previously.
es_mx: Este documento muestra el cómo crear, construir y cargar un programa FRC LabVIEW a una roboRIO. Antes de empezar, asegúrese de tener instalado LabVIEW para FRC y el FRC Driver Station, que se haya configurado y construido la imagen a tu roboRIO como fue descrito anteriormente.

source: Creating a Project
es_mx: Creación de un proyecto

source: Launch LabVIEW and click the FRC roboRIO Robot Project link in the Projects window to display the Create New FRC Robot Project dialog box.
es_mx: Ejecute LabVIEW y haga clic en el link del Proyecto de Robot de la roboRIO en la ventana Proyectos para mostrar el cuadro de diálogo Create New FRC Robot Project.

source: Configuring Project
es_mx: Configuración del proyecto

source: Fill in the Create New FRC Project Dialog:
es_mx: Rellene el cuadro de diálogo Create New FRC Project Dialog:

source: Pick a name for your project
es_mx: Escoge un nombre para tu proyecto

source: Select a folder to place the project in.
es_mx: Selecciona una carpeta para colocar el proyecto

source: Enter your team number
es_mx: Ingresa el numero del equipo

source: Select a project type. If unsure, select Arcade Drive - roboRIO.
es_mx: Selección del tipo de proyecto. Si se encuentra inseguro, seleccione la unidad de Arcade - roboRIO

source: Click Finish
es_mx: Haga click en terminar

source: Running the Program
es_mx: Ejecución del programa

source: In the Project Explorer window, double-click the Robot Main.vi item to open the Robot Main VI.
es_mx: En la ventana del Explorador del Proyecto, haga doble clic en Robot Main.vi para abrir el Robot Main VI.

source: Click the Run button (White Arrow on the top ribbon) of the Robot Main VI to deploy the VI to the roboRIO. LabVIEW deploys the VI, all items required by the VI, and the target settings to memory on the roboRIO. If prompted to save any VIs, click Save on all prompts.
es_mx: Haga clic en el botón Run (Flecha blanca en la cinta superior) del Robot Main VI para desplegar el VI a la roboRIO. LabVIEW desplega el VI, todos los elementos requeridos por el VI, y los ajustes del objetivo a la memoria en el roboRIO. Si se le pide que guarde cualquier VI, haga clic en Guardar en todas las indicaciones.

source: Click the Abort button of the Robot Main VI. Notice that the VI stops. When you deploy a program with the Run button, the program runs on the roboRIO, but you can manipulate the front panel objects of the program from the host computer.
es_mx: Presione el boton Abort del Robot Main VI. Observe que el VI se detiene. Cuando despliega un programa con el botón Ejecutar, el programa se ejecuta en el roboRIO, pero puede manipular los objetos del panel frontal del programa desde el ordenador central.

source: A program deployed in this manner will not remain on the roboRIO after a power cycle. To deploy a program to run every time the roboRIO starts follow the next step, Deploying the program.
es_mx: Un programa iniciado de esa manera no se mantendrá en la roboRIO después de un reinicio. Para iniciar un programa que corra cada vez que la roboRIO se inicie seguir el siguiente paso, Desplegando el programa

source: Deploying the program
es_mx: Iniciando el programa

source: To run in the competition, you will need to deploy a program to your roboRIO. This allows the program to survive across reboots of the controller, but doesn't allow the same debugging features (front panel, probes, highlight execution) as running from the front panel. To deploy your program:
es_mx: Para ejecutarlo durante la competencia, necesitará desplegar un programa a la roboRIO. Esto permite que el programa sobreviva a través de los reinicios del controlador, pero no permite las mismas características de depuración (panel frontal, sondas, ejecución de resaltado) que si se ejecutara desde el panel frontal. Para desplegar su programa:

source: In the Project Explorer, click the + next to Build Specifications to expand it.
es_mx: En el Explorador de Proyectos, haga clic en el + junto a Especificaciones de Construcción para expandirlo.

source: Right-click on FRC Robot Boot-up Deployment and select Build. Wait for the build to complete.
es_mx: Haga clic con el botón derecho del ratón en Despliegue de Robots FRC y seleccione Construir. Espera a que la construcción se complete.

source: Right-click again on FRC Robot Boot-Up Deployment and select Run as Startup. If you receive a conflict dialog, click OK. This dialog simply indicates that there is currently a program on the roboRIO which will be terminated/replaced.
es_mx: Haga clic de nuevo con el botón derecho en Despliegue de arranque del robot FRC y seleccione Ejecutar como inicio. Si recibes un diálogo de conflicto, haz clic en OK. Este diálogo simplemente indica que hay actualmente un programa en el roboRIO que será terminado/reemplazado

source: Either check the box to close the deployment window on successful completion or click the close button when the deployment completes.
es_mx: Marque la casilla para cerrar la ventana de despliegue al finalizar con éxito o haga clic en el botón de cierre cuando el despliegue se complete.

source: The roboRIO will automatically start running the deployed code within a few seconds of the dialog closing.
es_mx: El roboRIO comenzará a ejecutar automáticamente el código desplegado a los pocos segundos de cerrar el diálogo.
