Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/labview/resources/labview-resources.po
Languages: tr_tr

source: LabVIEW Resources
tr_tr: LabVIEW Kaynakları

source: To learn more about programming in LabVIEW and specifically programming FRC\ |reg| robots in LabVIEW, check out the following resources.
tr_tr: LabVIEW'de programlama ve özellikle FRC \ |reg| programlama hakkında daha fazla bilgi edinmek için LabVIEW'deki robotlar için aşağıdaki kaynaklara göz atın.

source: LabVIEW Basics
tr_tr: LabVIEW Temelleri

source: Todo
tr_tr: Yapmak

source: Add academic videos when link fixed www.ni.com/academic/students/learn-labview/
tr_tr: Bağlantı onarıldığında akademik videolar eklenecek www.ni.com/academic/students/learn-labview/

source: NI FRC Tutorials
tr_tr: NI FRC Eğitimleri

source: NI also hosts many `FRC specific tutorials and presentations ranging from basic to advanced <https://forums.ni.com/t5/FIRST-Robotics-Competition/Archived-2015-FRC-LabVIEW-Additional-Resources/ta-p/3528790?profile.language=en>`_. For an in-depth single resource check out the FRC Basic and Advanced Training Classes linked near the bottom of the page.
tr_tr: NI ayrıca, `temelden gelişmişe kadar değişen birçok FRC'ye özel eğitim ve sunuma<https://forums.ni.com/t5/FIRST-Robotics-Competition/Archived-2015-FRC-LabVIEW-Additional-Resources/ta-p/3528790?profile.language=en>`_ ev sahipliği yapıyor. Derinlemesine tek bir kaynak için, sayfanın altına yakın bir yerde bulunan FRC Basic and Advanced Training Classes'a bakın.

source: Installed Tutorials and Examples
tr_tr: Yüklü Eğitimler ve Örnekler

source: There are also tutorials and examples for all sorts of tasks and components provided as part of your LabVIEW installation. To access the tutorials, from the LabVIEW Splash screen (the screen that appears when the program is first launched) click on the ``Tutorials`` tab on the left side. Note that the tutorials are all in one document, so once it is open you are free to browse to other tutorials without returning to the splash screen.
tr_tr: Ayrıca, LabVIEW kurulumunuzun bir parçası olarak sağlanan her türlü görev ve bileşen için eğitimler ve örnekler de vardır. Öğreticilere erişmek için, LabVIEW Açılış ekranından (program ilk başlatıldığında görünen ekran) sol taraftaki ``Tutorials`` sekmesine tıklayın. Öğreticilerin hepsinin tek bir belgede olduğunu unutmayın, bu nedenle açıldıktan sonra açılış ekranına geri dönmeden diğer eğitimlere göz atmakta özgürsünüz.

source: To access the examples either click the ``Support`` tab, then ``Find FRC Examples`` or anytime you're working on a program open the ``Help`` menu, select ``Find Examples`` and open the ``FRC Robotics`` folder.
tr_tr: Örneklere erişmek için ya ``Support`` sekmesine, ardından ``Find FRC Examples`` a tıklayın veya bir program üzerinde çalışırken ``Help`` menüsünü açın, ``Find Examples`` u seçin ve ``FRC Robotics`` klasörünü açın .
