Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/command-groups.po
Languages: es_mx, zh_cn

source: For this reason, command instances that have been added to a command group cannot be independently scheduled or added to a second command group. Attempting to do so will throw an exception and crash the user program.
es_mx: Por esta razón, las instancias de comando que se han agregado a un grupo de comando no se pueden programar ni agregar de forma independiente a un segundo grupo de comando. Si lo intenta, se producirá una excepción y se bloqueará el programa de usuario.
zh_cn: 出于这个原因，已经添加到指令组的指令实例无法独立调度或添加到第二个指令组。尝试这样做将引发异常并使用户程序崩溃。

source: Advanced users who wish to re-use a command instance and are *certain* that it is safe to do so may bypass this restriction with the ``clearGroupedCommand()`` `method <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#clearGroupedCommand(edu.wpi.first.wpilibj2.command.Command)>`__ in the ``CommandGroupBase`` class.
es_mx: Los usuarios avanzados que deseen reutilizar una instancia de comando y estén *seguros* de que es seguro hacerlo pueden saltarse esta restricción con el ``borrarComandoAgrupado()`` método <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#clearGroupedCommand(edu.wpi.first.wpilibj2.command.Command)>`__ en la clase ``BasedelGrupodeMando``.
zh_cn: 希望重用命令实例并“确定”可以安全使用的高级用户可以使用CommandGroupBase类中的clearGroupedCommand（）方法<https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#clearGroupedCommand(edu.wpi.first.wpilibj2.command.Command)>`__来绕过此限制。

source: ParallelRaceGroup
zh_cn: 平行属组

source: ParallelDeadlineGroup
zh_cn: 平行结束指令组
