Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/command-groups.po
Languages: es_mx, zh_cn

source: Command Groups
es_mx: Grupos de comandos
zh_cn: 指令组

source: Individual commands are capable of accomplishing a large variety of robot tasks, but the simple three-state format can quickly become cumbersome when more advanced functionality requiring extended sequences of robot tasks or coordination of multiple robot subsystems is required. In order to accomplish this, users are encouraged to use the powerful command group functionality included in the command-based library.
es_mx: Los comandos individuales son capaces de realizar una gran variedad de tareas de robot, pero el formato simple de tres estados puede volverse engorroso rápidamente cuando se requiere una funcionalidad más avanzada que requiere secuencias extendidas de tareas de robot o la coordinación de múltiples subsistemas de robot. Para lograr esto, se anima a los usuarios a utilizar la poderosa funcionalidad del grupo de comandos incluida en la biblioteca basada en comandos.
zh_cn: 单个指令能够完成各种各样的机器人任务，但是当需要更高级的功能例如需要扩展机器人任务序列或协调多个机器人子系统时，简单的三态格式可能会变得很麻烦。为了做到这一点，鼓励用户使用基于命令的库中包含的强大指令组功能。

source: As the name suggests, command groups are combinations of multiple commands. The act of combining multiple objects (such as commands) into a bigger object is known as `composition <https://en.wikipedia.org/wiki/Object_composition>`__. Command groups *compose* multiple commands into a *composite* command. This allows code to be kept much cleaner and simpler, as the individual *component* commands may be written independently of the code that combines them, greatly reducing the amount of complexity at any given step of the process.
es_mx: Como sugiere su nombre, los grupos de comandos son combinaciones de múltiples comandos. El acto de combinar varios objetos (como comandos) en un objeto más grande se conoce como `composición <https://en.wikipedia.org/wiki/Object_composition>` __. Los grupos de comandos *componen* múltiples comandos en un comando *compuesto*. Esto permite que el código se mantenga mucho más limpio y simple, ya que los comandos *componentes* individuales pueden escribirse independientemente del código que los combina, reduciendo en gran medida la cantidad de complejidad en cualquier paso del proceso.
zh_cn: 顾名思义，指令组是多个指令的组合。将多个对象（例如指令）组合成更大的对象的动作称为`composition <https://en.wikipedia.org/wiki/Object_composition>`__.命令组将多个指令组成*复合*指令。这可以使代码保持更加简洁明了，因为各个*component *指令可以独立于将它们组合在一起的代码编写，从而大大减少了过程中任何给定步骤的复杂性。

source: Most importantly, however, command groups *are themselves commands* - they implement the ``Command`` interface. This allows command groups to be `recursively composed <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__ - that is, a command group may contain *other command groups* as components.
es_mx: Sin embargo, lo más importante es que los grupos de comandos *son en sí mismos comandos*- implementan la interfaz de ``Comando``. Esto permite que los grupos de comandos se `compongan de forma recursiva <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>` __ - es decir, un grupo de comandos puede contener *otros grupos de comandos* como componentes.
zh_cn: 但是，最重要的是，指令组*本身就是指令*——它们实现了“Command”接口。这允许指令组`recursively composed <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__——也就是说，一个指令组可以包含*其他指令组*作为组件。

source: Types of Command Groups
es_mx: Tipos de grupos de comandos
zh_cn: 指令组的类型

source: In the C++ command-based library, command groups *own* their component commands. This means that commands passed to command groups will be either moved or copied depending on whether they are rvalues or lvalues (`rvalue/lvalue explanation <http://thbecker.net/articles/rvalue_references/section_01.html>`__). Due to certain technical concerns, command groups themselves are not copyable, and so recursive composition *must* use move semantics.
es_mx: En la biblioteca basada en comandos de C ++, los grupos de comandos *poseen* sus comandos de componentes. Esto significa que los comandos pasados a los grupos de comandos se moverán o copiarán dependiendo de si son rvalues o lvalues (`explicación rvalue/lvalue <http://thbecker.net/articles/rvalue_references/section_01.html>`__). Debido a ciertas preocupaciones técnicas, los grupos de comando en sí no se pueden copiar, por lo que la composición recursiva *debe* usar semántica de movimiento.
zh_cn: 在基于C ++命令的库中，指令组“拥有”它们的组件指令。这意味着传递给指令组的指令将根据是右值还是左值（`rvalue/lvalue explanation <http://thbecker.net/articles/rvalue_references/section_01.html>`__）而移动或复制。由于某些技术问题，指令组本身是不可复制的，因此递归组合必须使用移动语义。

source: The command-based library supports four basic types of command groups: ``SequentialCommandGroup``, ``ParallelCommandGroup``, ``ParallelRaceGroup``, and ``ParallelDeadlineGroup``. Each of these command groups combines multiple commands into a composite command - however, they do so in different ways:
es_mx: La biblioteca basada en comandos admite cuatro tipos básicos de grupos de comandos: ``SequentialCommandGroup``, ``ParallelCommandGroup``, ``ParallelRaceGroup``, y ``ParallelDeadlineGroup``. Cada uno de estos grupos de comandos combina varios comandos en un comando compuesto; sin embargo, lo hacen de diferentes maneras:
zh_cn: 基于命令的库支持四种基本类型的指令组：“SequentialCommandGroup”，“ParallelCommandGroup”，“ParallelRaceGroup”和“ParallelDeadlineGroup”。这些指令组中的每一个将多个指令组合为一个复合指令——但是，它们以不同的方式进行操作：

source: SequentialCommandGroup
es_mx: Grupo de comandos secuencial
zh_cn: 顺序指令组

source: A ``SequentialCommandGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SequentialCommandGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SequentialCommandGroup.html>`__) runs a list of commands in sequence - the first command will be executed, then the second, then the third, and so on until the list finishes. The sequential group finishes after the last command in the sequence finishes. It is therefore usually important to ensure that each command in the sequence does actually finish (if a given command does not finish, the next command will never start!).
es_mx: Un ``SequentialCommandGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SequentialCommandGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SequentialCommandGroup.html>`__) ejecuta una lista de comandos en secuencia - el primer comando será ejecutado, luego el segundo, luego el tercero, y así sucesivamente hasta que la lista termine. El grupo secuencial termina después de que el último comando de la secuencia termine. Por lo tanto, suele ser importante asegurarse de que cada comando de la secuencia termine realmente (si un comando determinado no termina, el siguiente nunca comenzará).
zh_cn: ``SequentialCommandGroup``（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SequentialCommandGroup.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SequentialCommandGroup.html>`__）按顺序运行命令列表-将先执行第一个命令，然后执行第二个命令，然后执行第三个命令，依此类推直到列表完成。顺序组中的最后一个命令完成后，顺序组完成。因此，通常重要的是确保序列中的每个命令确实完成（如果给定命令未完成，则下一个命令将永远不会启动！）。

source: ParallelCommandGroup
es_mx: Grupo de comandos pararlelo
zh_cn: 并行指令组

source: A ``ParallelCommandGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelCommandGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ParallelCommandGroup.html>`__) runs a set of commands concurrently - all commands will execute at the same time. The parallel group will end when all commands have finished.
es_mx: Un ``ParallelCommandGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelCommandGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ParallelCommandGroup.html>`__) ejecuta un conjunto de comandos de forma concurrente - todos los comandos se ejecutarán al mismo tiempo. El grupo paralelo finalizará cuando todos los comandos hayan terminado.
zh_cn: ``ParallelCommandGroup''（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelCommandGroup.html>` __，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ParallelCommandGroup.html>`__）同时运行一组命令-所有命令将同时执行。当所有命令完成时，并行组将结束。

source: A ``ParallelRaceGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelRaceGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ParallelRaceGroup.html>`__) is much like a ``ParallelCommandgroup``, in that it runs a set of commands concurrently. However, the race group ends as soon as any command in the group ends - all other commands are interrupted at that point.
es_mx: Un ``ParallelRaceGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelRaceGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ParallelRaceGroup.html>`__) es muy parecido a un ``ParallelCommandgroup``, en el sentido de que ejecuta un conjunto de comandos de forma concurrente. Sin embargo, el grupo de carrera termina tan pronto como cualquier comando en el grupo termina - todos los otros comandos se interrumpen en ese punto.
zh_cn: ``ParallelRaceGroup''（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelRaceGroup.html>` __，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ParallelRaceGroup.html>`__）与``ParallelCommandgroup''非常相似，因为它同时运行一组命令。但是，种族组一旦该组中的任何命令结束就结束-那时所有其他命令都被中断。

source: A ``ParallelDeadlineGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelDeadlineGroup.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ParallelDeadlineGroup.html>`__) also runs a set of commands concurrently. However, the deadline group ends when a *specific* command (the "deadline") ends, interrupting all other commands in the group that are still running at that point.
es_mx: Un ``ParallelDeadlineGroup`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelDeadlineGroup.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ParallelDeadlineGroup.html>` __) también ejecuta un conjunto de comandos al mismo tiempo. Sin embargo, el grupo de fecha límite termina cuando un comando *específico* (la "fecha límite") finaliza, interrumpiendo todos los demás comandos en el grupo que todavía se están ejecutando en ese punto.
zh_cn: ``ParallelDeadlineGroup``（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ParallelDeadlineGroup.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ParallelDeadlineGroup.html>`__）也同时运行一组命令。但是，截止期限组在* specific *命令（“截止期限”）结束时结束，从而中断了该组中当时仍在运行的所有其他命令。

source: Creating Command Groups
es_mx: Crear grupos de comandos
zh_cn: 创建指令组

source: Users have several options for creating command groups. One way - similar to the previous implementation of the command-based library - is to subclass one of the command group classes. Consider the following from the Hatch Bot example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):
es_mx: Los usuarios tienen varias opciones para crear grupos de comandos. Una forma - similar a la implementación anterior de la biblioteca basada en comandos - es subclasificar una de las clases de grupos de comandos. Considere lo siguiente del proyecto de ejemplo de Hatch Bot (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__):
zh_cn: 用户可以使用多个选项来创建命令组。一种方法（类似于以前基于命令的库的实现）是将命令组类之一子类化。考虑一下Hatch Bot示例项目中的以下内容（`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbottraditional>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotTraditional>`__）：

source: C++ (Header)
es_mx: C++ (Encabezado)

source: C++ (Source)
es_mx: C++ (Fuente)

source: The ``addCommands()`` method adds commands to the group, and is present in all four types of command group.
es_mx: El método ``addCommands()`` agrega comandos al grupo y está presente en los cuatro tipos de grupos de comandos.
zh_cn: “addCommands()”方法将指令添加到该组，并且在所有四种类型的指令组中都存在。

source: Inline Command Groups
es_mx: Grupos de comandos en línea
zh_cn: 内联指令组

source: Due to the verbosity of Java's ``new`` syntax, the Java ``CommandGroupBase`` object offers a factory method for each of the four command-group types: `sequence <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#sequence(edu.wpi.first.wpilibj2.command.Command...)>`__, `parallel <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#parallel(edu.wpi.first.wpilibj2.command.Command...)>`__, `race <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#race(edu.wpi.first.wpilibj2.command.Command...)>`__, and `deadline <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#deadline(edu.wpi.first.wpilibj2.command.Command,edu.wpi.first.wpilibj2.command.Command...)>`__.
es_mx: Debido a la verbosidad de la ``nueva`` sintaxis de Java, el objeto Java ``CommandGroupBase`` ofrece un método de fábrica para cada uno de los cuatro tipos de grupos de comandos: `sequence <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#sequence(edu.wpi.first.wpilibj2.command.Command...)>`__, `parallel <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#parallel(edu.wpi.first.wpilibj2.command.Command...)>`__, `race <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#race(edu.wpi.first.wpilibj2.command.Command...)>`__, and `deadline <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#deadline(edu.wpi.first.wpilibj2.command.Command,edu.wpi.first.wpilibj2.command.Command...)>`__.
zh_cn: 由于Java的new语法过于冗长，因此Java的CommandGroupBase对象为四种命令组类型中的每一个提供了一种工厂方法：`sequence <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#sequence(edu.wpi.first.wpilibj2.command.Command...)>`__，`parallel <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#parallel(edu.wpi.first.wpilibj2.command.Command...)>`__，`race <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#race(edu.wpi.first.wpilibj2.command.Command...)> __和截止期限<https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html#deadline(edu.wpi.first.wpilibj2.command.Command,edu.wpi.first.wpilibj2.command.Command...)> __。

source: Command groups can be used without subclassing at all: one can simply pass in the desired commands through the constructor:
es_mx: Los grupos de comandos se pueden usar sin subclasificar en absoluto: uno puede simplemente pasar los comandos deseados a través del constructor:
zh_cn: 指令组可以完全不用子类使用：一个人可以简单地通过构造函数传递所需的指令：

source: This is called an :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>` command definition, and is very handy for circumstances where command groups are not likely to be reused, and writing an entire class for them would be wasteful.
es_mx: Esto se denomina una definición de comando: ref: `inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`, y es muy útil para circunstancias en las que no es probable que los grupos de comandos se reutilicen, y escribir una clase completa para ellos sería un desperdicio.
zh_cn: 这称为:ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`指令定义，在不太可能重用指令组的情况下非常方便，并且为它们编写整个类将很浪费。

source: Recursive Composition of Command Groups
es_mx: Composición recursiva de grupos de comandos
zh_cn: 指令组的递归组合

source: As mentioned earlier, command groups are `recursively composable <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__ - since command groups are themselves commands, they may be included as components of other command groups. This is an extremely powerful feature of command groups, and allows users to build very complex robot actions from simple pieces. For example, consider the following code:
es_mx: Como se mencionó anteriormente, los grupos de comandos son `componibles recursivamente <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>` __ - dado que los grupos de comandos son comandos en sí mismos, pueden incluirse como componentes de otros grupos de comandos. Esta es una característica extremadamente poderosa de los grupos de comandos y permite a los usuarios construir acciones de robot muy complejas a partir de piezas simples. Por ejemplo, considere el siguiente código:
zh_cn: 如前所述，指令组是`recursively composable <https://en.wikipedia.org/wiki/Object_composition#Recursive_composition>`__ ——由指令组本身就是命令，因此它们可以作为其他指令组的组成部分包含在内。这是指令组的一项极其强大的功能，它允许用户从简单的片段构建非常复杂的机器人动作。例如，参考以下代码：

source: This creates a sequential command group that *contains* a parallel command group. The resulting control flow looks something like this:
es_mx: Esto crea un grupo de comando secuencial que *contiene* un grupo de comando paralelo. El flujo de control resultante se parece a esto:
zh_cn: 这将创建一个顺序指令组，该指令组“包含”一个并行指令组。产生的控制流如下所示：

source: Notice how the recursive composition allows the embedding of a parallel control structure within a sequential one. Notice also that this entire, more-complex structure, could be again embedded in another structure. Composition is an extremely powerful tool, and one that users should be sure to use extensively.
es_mx: Observe cómo la composición recursiva permite la incrustación de una estructura de control paralela dentro de una secuencial. Observe también que toda esta estructura, más compleja, podría estar nuevamente incrustada en otra estructura. La composición es una herramienta extremadamente poderosa, y los usuarios deben asegurarse de usar ampliamente.
zh_cn: 注意递归组合如何允许将并行控制结构嵌入顺序结构中。还请注意，可以将整个，更复杂的结构再次嵌入另一个结构中。合成是一种非常强大的工具，用户应确保广泛使用该工具。

source: Command Groups and Requirements
es_mx: Grupos de comandos y requisitos
zh_cn: 指令组和要求

source: As command groups are commands, they also must declare their requirements. However, users are not required to specify requirements manually for command groups - requirements are automatically inferred from the commands included. As a rule, *command groups include the union of all of the subsystems required by their component commands.* Thus, the ``ComplexAuto`` shown previously will require both the drive subsystem and the hatch subsystem of the robot.
es_mx: Como los grupos de comandos son comandos, también deben declarar sus requisitos. Sin embargo, los usuarios no están obligados a especificar los requisitos manualmente para los grupos de comandos; los requisitos se infieren automáticamente de los comandos incluidos. Como regla, *los grupos de comandos incluyen la unión de todos los subsistemas requeridos por los comandos de sus componentes.* Por lo tanto, el ``ComplexAuto`` mostrado anteriormente requerirá tanto el subsistema de drive como el subsistema hatch del robot.
zh_cn: 由于指令组是指令，因此它们还必须声明其要求。但是，不需要用户手动为指令组指定需求——需求是从包含的指令中自动推断出来的。通常，*命令组包括其组件命令所需的所有子系统的并集。*因此，前面显示的“ComplexAuto”将需要机器人的驱动子系统和舱口盖子系统。

source: Additionally, requirements are enforced within all three types of parallel groups - a parallel group may *not* contain multiple commands that require the same subsystem.
es_mx: Además, los requisitos se aplican dentro de los tres tipos de grupos paralelos: un grupo paralelo puede *no* contener varios comandos que requieren el mismo subsistema.
zh_cn: 此外，在所有三种类型的并行组中强制执行要求——并行组可能*不*包含需要同一子系统的多个指令。

source: Some advanced users may find this overly-restrictive - for said users, the library offers a ``ScheduleCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ScheduleCommand.html>`__) that can be used to independently "branch off" from command groups to provide finer granularity in requirement management.
es_mx: Algunos usuarios avanzados pueden encontrar esto demasiado restrictivo; para dichos usuarios, la biblioteca ofrece la clase ``ScheduleCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ScheduleCommand.html>` __) que se puede utilizar para "ramificarse" independientemente de los grupos de comandos para proporcionar una granularidad más fina en la gestión de requisitos.
zh_cn: 一些高级用户可能会发现此限制过于严格-对于上述用户，该库提供了“ ScheduleCommand”类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ScheduleCommand.html>`__），可用于独立地从命令组“分支”在需求管理中提供更好的粒度。

source: Restrictions on Command Group Components
es_mx: Restricciones en componentes del grupo de comandos
zh_cn: 对指令组组件的限制

source: The following is only relevant for the Java command-based library; the C++ library's ownership model naturally prevents users from making this category of mistake.
es_mx: Lo siguiente solo es relevante para la biblioteca basada en comandos de Java; El modelo de propiedad de la biblioteca C ++ naturalmente evita que los usuarios cometan esta categoría de error.
zh_cn: 以下仅与基于Java命令的库有关； C ++库的所有权模型自然可以防止用户犯此类错误。

source: Since command group components are run through their encapsulating command groups, errors could occur if those same command instances were independently scheduled at the same time as the group - the command would be being run from multiple places at once, and thus could end up with inconsistent internal state, causing unexpected and hard-to-diagnose behavior.
es_mx: Dado que los componentes del grupo de comando se ejecutan a través de sus grupos de comando encapsulados, podrían producirse errores si esas mismas instancias de comando se programaran de forma independiente al mismo tiempo que el grupo; el comando se ejecutaría desde varios lugares a la vez y, por lo tanto, podría terminar siendo inconsistente estado interno, lo que provoca un comportamiento inesperado y difícil de diagnosticar.
zh_cn: 由于指令组组件是通过其封装的指令组运行的，因此，如果与这些指令组同时调度相同的指令实例，则可能会发生错误——该指令将同时从多个位置运行，因此可能导致不一致内部状态，从而导致意外和难以诊断的行为。
