Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/command-scheduler.po
Languages: tr_tr

source: The Command Scheduler
tr_tr: Komut Zamanlayıcı - Command Scheduler

source: The ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html>`__) is the class responsible for actually running commands. Each iteration (ordinarily once per 20ms), the scheduler polls all registered buttons, schedules commands for execution accordingly, runs the command bodies of all scheduled commands, and ends those commands that have finished or are interrupted.
tr_tr: ``CommandScheduler`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html>`__, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html>` __), komutları gerçekten çalıştırmaktan sorumlu sınıftır. Her yineleme (normalde 20 ms'de bir kez), programlayıcı tüm kayıtlı düğmeleri yoklar, buna göre yürütme için komutları planlar, programlanan tüm komutların komut gövdelerini çalıştırır ve biten veya kesilen komutları sonlandırır.

source: The ``CommandScheduler`` also runs the ``periodic()`` method of each registered ``Subsystem``.
tr_tr: ``CommandScheduler`` ayrıca kayıtlı her bir ``Alt Sistemin`` ``periodic()`` yöntemini çalıştırır.

source: Using the Command Scheduler
tr_tr: Komut Zamanlayıcıyı Kullanma

source: The ``CommandScheduler`` is a *singleton*, meaning that it is a globally-accessible class with only one instance. Accordingly, in order to access the scheduler, users must call the ``CommandScheduler.getInstance()`` command.
tr_tr: ``CommandScheduler`` bir *singleton* 'dur, yani yalnızca bir örneğe sahip global olarak erişilebilir bir sınıftır. Buna göre, zamanlayıcıya erişmek için kullanıcıların ``CommandScheduler.getInstance()`` komutunu çağırması gerekir.

source: For the most part, users do not have to call scheduler methods directly - almost all important scheduler methods have convenience wrappers elsewhere (e.g. in the ``Command`` and ``Subsystem`` interfaces).
tr_tr: Çoğunlukla, kullanıcıların zamanlayıcı yöntemlerini doğrudan çağırması gerekmez - neredeyse tüm önemli zamanlayıcı yöntemlerinin başka yerlerde kolaylık sarmalayıcıları vardır (örneğin, ``Komut`` ve ``Alt Sistem`` arayüzlerinde).

source: However, there is one exception: users *must* call ``CommandScheduler.getInstance().run()`` from the ``robotPeriodic()`` method of their ``Robot`` class. If this is not done, the scheduler will never run, and the command framework will not work. The provided command-based project template has this call already included.
tr_tr: Bununla birlikte, bir istisna vardır: kullanıcılar, ``Robot`` sınıfının ``robotPeriodic()`` yönteminden ``CommandScheduler.getInstance().run()`` çağrısı *yapmalıdır*. Bu yapılmazsa, zamanlayıcı asla çalışmaz ve komut çerçevesi çalışmaz. Sağlanan komut tabanlı proje şablonunda bu çağrı zaten dahil edilmiştir.

source: The ``schedule()`` Method
tr_tr: ``schedule()`` Methodu

source: To schedule a command, users call the ``schedule()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#schedule(boolean,edu.wpi.first.wpilibj2.command.Command...)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#a26c120054ec626806d740f2c42d9dc4f>`__. This method takes a command (and, optionally, a specification as to whether that command is interruptible), and attempts to add it to list of currently-running commands, pending whether it is already running or whether its requirements are available. If it is added, its ``initialize()`` method is called.
tr_tr: Bir komutu planlamak için kullanıcılar ``program ()`` yöntemini çağırır (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#schedule(boolean,edu.wpi.first.wpilibj2.command.Command...)>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#a26c120054ec626806d740f2c42d9dc4f>` __. Bu yöntem bir komut alır (ve isteğe bağlı olarak, bu komutun kesilebilir olup olmadığına dair bir belirtim), ve halihazırda çalışıp çalışmadığını ya da gereksinimlerinin mevcut olup olmadığını bekleyerek onu şu anda çalışan komutlar listesine eklemeye çalışır.Eklenirse, ``initialize()`` yöntemi çağrılır.

source: The Scheduler Run Sequence
tr_tr: Schedukler-Zamanlayıcı Çalıştırma Sırası

source: The ``initialize()`` method of each ``Command`` is called when the command is scheduled, which is not necessarily when the scheduler runs (unless that command is bound to a button).
tr_tr: Her bir ``Command`` ``initialize()`` yöntemi, komut zamanlandığında çağrılır, bu, zamanlayıcı çalıştığında zorunlu değildir (bu komut bir düğmeye bağlı değilse).

source: What does a single iteration of the scheduler's ``run()`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#run()>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#aa5000fa52e320da7ba72c196f34aa0f5>`__) actually do? The following section walks through the logic of a scheduler iteration.
tr_tr: Zamanlayıcının ``run()`` yönteminin (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#run()>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#aa5000fa52e320da7ba72c196f34aa0f5>` __) tek bir yinelemesi aslında ne yapar? Aşağıdaki bölüm, bir zamanlayıcı yinelemesinin mantığını açıklamaktadır.

source: Step 1: Run Subsystem Periodic Methods
tr_tr: Adım 1: Alt Sistem Periyodik Yöntemlerini Çalıştırın

source: First, the scheduler runs the ``periodic()`` method of each registered ``Subsystem``.
tr_tr: İlk olarak, programlayıcı her kayıtlı ``Alt Sistemin-Subsystem`` ``periodic()`` yöntemini çalıştırır.

source: Step 2: Poll Command Scheduling Triggers
tr_tr: Adım 2: Poll Command Scheduling Tetikleyicileri

source: For more information on how trigger bindings work, see :doc:`binding-commands-to-triggers`
tr_tr: Tetikleyici bağlamalarının nasıl çalıştığı hakkında daha fazla bilgi için bkz. :doc:`binding-commands-to-triggers`

source: Secondly, the scheduler polls the state of all registered triggers to see if any new commands that have been bound to those triggers should be scheduled. If the conditions for scheduling a bound command are met, the command is scheduled and its ``Initialize()`` method is run.
tr_tr: İkinci olarak, programlayıcı, bu tetikleyicilere bağlanan yeni komutların programlanıp programlanmayacağını görmek için tüm kayıtlı tetikleyicilerin durumunu sorgular. Bağlı bir komutu zamanlama koşulları karşılanırsa, komut zamanlanır ve ``Initialize()`` yöntemi çalıştırılır.

source: Step 3: Run/Finish Scheduled Commands
tr_tr: 3. Adım: Zamanlanmış-Scheduled Komutları Run/Finish

source: Thirdly, the scheduler calls the ``execute()`` method of each currently-scheduled command, and then checks whether the command has finished by calling the ``isFinished()`` method. If the command has finished, the ``end()`` method is also called, and the command is de-scheduled and its required subsystems are freed.
tr_tr: Üçüncüsü, zamanlayıcı, şu anda zamanlanmış olan her komutun ``execute()`` yöntemini çağırır ve ardından ``isFinished()`` yöntemini çağırarak komutun bitip bitmediğini kontrol eder. Komut bittiyse, ``end()`` yöntemi de çağrılır ve komutun programı kaldırılır ve gerekli alt sistemleri serbest bırakılır.

source: Note that this sequence of calls is done in order for each command - thus, one command may have its ``end()`` method called before another has its ``execute()`` method called. Commands are handled in the order they were scheduled.
tr_tr: Bu çağrı dizisinin her komut için yapıldığına dikkat edin - bu nedenle, bir komutun ``end()`` yöntemi, diğerinin ``execute()`` yöntemi çağrılmadan önce çağrılmasına sahip olabilir. Komutlar planlandıkları sırayla işlenir.

source: Step 4: Schedule Default Commands
tr_tr: 4. Adım: Varsayılan Komutları Programlayın - Schedule

source: Finally, any registered ``Subsystem`` has its default command scheduled (if it has one). Note that the ``initialize()`` method of the default command will be called at this time.
tr_tr: Son olarak, kayıtlı herhangi bir ``Alt Sistemin-Subsystem`` varsayılan komutu planlanmıştır (eğer varsa). Varsayılan komutun ``initialize()`` yönteminin şu anda çağrılacağını unutmayın.

source: Disabling the Scheduler
tr_tr: Scheduler - Devre Dışı Bırakma

source: The scheduler can be disabled by calling ``CommandScheduler.getInstance().disable()``. When disabled, the scheduler's ``schedule()`` and ``run()`` commands will not do anything.
tr_tr: Programlayıcı, ``CommandScheduler.getInstance().Disable()`` çağrısı yapılarak devre dışı bırakılabilir. Devre dışı bırakıldığında, planlayıcının ``schedule()`` ve ``run()`` komutları hiçbir şey yapmaz.

source: The scheduler may be re-enabled by calling ``CommandScheduler.getInstance().enable()``.
tr_tr: Programlayıcı, ``CommandScheduler.getInstance().enable()`` çağrılarak yeniden etkinleştirilebilir.

source: Command Event Methods
tr_tr: Komut Olay Yöntemleri

source: Occasionally, it is desirable to have the scheduler execute a custom action whenever a certain command event (initialization, execution, or ending) occurs. This can be done with the following three methods:
tr_tr: Bazen, belirli bir komut olayı (başlatma, yürütme veya sonlandırma) meydana geldiğinde scheduler-programlayıcının özel bir eylemi yürütmesi arzu edilir. Bu, aşağıdaki üç yöntemle yapılabilir:

source: The ``onCommandInitialize`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandInitialize(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#a5f983f0e45b0500c96eebe52780324d4>`__) runs a specified action whenever a command is initialized.
tr_tr: ``onCommandInitialize`` yöntemi (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandInitialize(java.util.function.Consumer)>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#a5f983f0e45b0500c96eebe52780324d4>` __), bir komut her başlatıldığında belirli bir eylemi çalıştırır.

source: The ``onCommandExecute`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandExecute(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#a58c538f4b8dd95e266e4a99167aa7f99>`__) runs a specified action whenever a command is executed.
tr_tr: ``onCommandExecute`` yöntemi (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandExecute(java.util.function.Consumer)>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#a58c538f4b8dd95e266e4a99167aa7f99>` __), bir komut çalıştırıldığında belirli bir eylemi çalıştırır.

source: The ``onCommandFinish`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandFinish(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#a068e61446afe2341cc0651f0dfd2a55f>`__) runs a specified action whenever a command finishes normally (i.e. the ``isFinished()`` method returned true).
tr_tr: ``onCommandFinish`` yöntemi (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandFinish(java.util.function.Consumer)>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#a068e61446afe2341cc0651f0dfd2a55f>` __), bir komut normal olarak bittiğinde belirli bir eylemi çalıştırır (yani, ``isFinished()`` yöntemi true döndürülür).

source: The ``onCommandInterrupt`` method (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandInterrupt(java.util.function.Consumer)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#ab5ba99a542aa778a76726d7c68461bf0>`__) runs a specified action whenever a command is interrupted (i.e. by being explicitly canceled or by another command that shares one of its requirements).
tr_tr: ``onCommandInterrupt`` yöntemi (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandScheduler.html#onCommandInterrupt(java.util.function.Consumer)>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1CommandScheduler.html#ab5ba99a542aa778a76726d7c68461bf0>` __), bir komut her kesintiye uğradığında (yani açıkça iptal edilerek veya gereksinimlerinden birini paylaşan başka bir komut tarafından) belirtilen bir eylemi çalıştırır.

source: A typical use-case for these methods is adding markers in an event log whenever a command scheduling event takes place, as demonstrated in the SchedulerEventLogging example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/schedulereventlogging>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SchedulerEventLogging>`__):
tr_tr: Bu metotlar için tipik bir kullanım durumu, SchedulerEventLogging örnek projesinde (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/schedulereventlogging>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SchedulerEventLogging>` __) gösterildiği gibi, bir komut zamanlama olayı gerçekleştiğinde olay günlüğüne işaretler eklemektir:
