Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/convenience-features.po
Languages: es_mx, zh_cn

source: Convenience Features
es_mx: Funciones de conveniencia
zh_cn: 便捷功能

source: While the previously-described methodologies will work fine for writing command-based robot code, the command-based libraries contain several convenience features for more-advanced users that can greatly reduce the verbosity/complexity of command-based code. It is highly recommended that users familiarize themselves with these features to maximize the value they get out of the command-based libraries.
es_mx: Si bien las metodologías descritas anteriormente funcionarán bien para escribir código de robot basado en comandos, las bibliotecas basadas en comandos contienen varias características de conveniencia para usuarios más avanzados que pueden reducir en gran medida la verbosidad / complejidad del código basado en comandos. Se recomienda encarecidamente que los usuarios se familiaricen con estas funciones para maximizar el valor que obtienen de las bibliotecas basadas en comandos.
zh_cn: 虽然先前描述的方法对于编写基于命令的机器人代码将很好地工作，但是基于命令的库包含一些高级功能，可帮助高级用户大大减少基于命令的代码的冗长/复杂性。强烈建议用户熟悉这些功能，以最大化从基于命令的库中获得的价值。

source: Inline Command Definitions
es_mx: Definiciones de comandos en línea
zh_cn: 内联命令定义

source: While users are able to create commands by explicitly writing command classes (either by subclassing ``CommandBase`` or implementing ``Command``), for many commands (such as those that simply call a single subsystem method) this involves a lot of wasteful boilerplate code. To help alleviate this, many of the prewritten commands included in the command-based library may be *inlined* - that is, the command body can be defined in a single line of code at command construction.
es_mx: Si bien los usuarios pueden crear comandos escribiendo explícitamente clases de comandos (ya sea subclasificando ``CommandBase`` o implementando``Command``), para muchos comandos (como aquellos que simplemente llaman a un método de subsistema único) esto implica una gran cantidad de código repetitivo derrochador. Para ayudar a aliviar esto, muchos de los comandos preescritos incluidos en la biblioteca basada en comandos pueden estar *alineados*, es decir, el cuerpo del comando se puede definir en una sola línea de código en la construcción del comando.
zh_cn: 尽管用户可以通过显式编写命令类（通过子类化“CommandBase”或实现“Command”）来创建命令，但是对于许多命令（例如那些仅调用单个子系统方法的命令）而言，这涉及很多浪费的样板代码。为了缓解这种情况，可以*内嵌*基于命令的库中包含的许多预写命令-即，可以在命令构造时以单行代码定义命令主体。

source: Passing Subroutines As Parameters
es_mx: Pasar subrutinas como parámetros
zh_cn: 将子例程作为参数传递

source: In order to inline a command definition, users require some way to specify what code the commands will run as constructor parameters. Fortunately, both Java and C++ offer users the ability to pass subroutines as parameters.
es_mx: Para insertar una definición de comando, los usuarios necesitan alguna forma de especificar qué código ejecutarán los comandos como parámetros del constructor. Afortunadamente, tanto Java como C++ ofrecen a los usuarios la posibilidad de pasar subrutinas como parámetros.
zh_cn: 为了内联命令定义，用户需要某种方式来指定命令将作为构造函数参数运行的代码。幸运的是，Java和C ++都为用户提供了将子例程作为参数传递的功能。

source: Method References (Java)
es_mx: Referencias de métodos (Java)
zh_cn: 方法参考（Java）

source: In Java, a reference to a subroutine that can be passed as a parameter is called a method reference. The general syntax for a method reference is ``object::method``. Note that no method parameters are included, since the method *itself* is the parameter. The method is not being called - it is being passed to another piece of code (in this case, a command) so that *that* code can call it when needed. For further information on method references, see `the official Oracle documentation <https://docs.oracle.com/javase/tutorial/java/javaOO/methodreferences.html>`__.
es_mx: En Java, una referencia a una subrutina que se puede pasar como parámetro se denomina referencia de método. La sintaxis general para una referencia a un método es ``object::method``. Tenga en cuenta que no se incluyen parámetros de método, ya que el método *en sí* es el parámetro. No se está llamando al método, se está pasando a otro fragmento de código (en este caso, un comando) para que *ese* código pueda llamarlo cuando sea necesario. Para obtener más información sobre referencias de métodos, consulte `la documentación oficial de Oracle <https://docs.oracle.com/javase/tutorial/java/javaOO/methodreferences.html>`__.
zh_cn: 在Java中，对可以作为参数传递的子例程的引用称为方法引用。方法参考的一般语法是“object::method”。请注意，由于方法*itself*是参数，因此不包括方法参数。该方法没有被调用-它被传递给另一段代码（在本例中为命令），以便*那个*代码可以在需要时调用它。有关方法引用的更多信息，请参见`the official Oracle documentation <https://docs.oracle.com/javase/tutorial/java/javaOO/methodreferences.html>`__。

source: Lambda Expressions (Java)
es_mx: Expresiones Lambda (Java)
zh_cn: Lambda表达式（Java）

source: While method references work well for passing a subroutine that has already been written, often it is inconvenient/wasteful to write a subroutine solely for the purpose of sending as a method reference, if that subroutine will never be used elsewhere. To avoid this, Java also supports a feature called "lambda expressions." A lambda expression is an inline method definition - it allows a subroutine to be defined *inside of a parameter list*. For specifics on how to write Java lambda expressions, see `this tutorial <https://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html#syntax>`__.
es_mx: Si bien las referencias a métodos funcionan bien para pasar una subrutina que ya se ha escrito, a menudo es inconveniente / inútil escribir una subrutina únicamente con el propósito de enviarla como referencia de método, si esa subrutina nunca se usará en otro lugar. Para evitar esto, Java también admite una función llamada "expresiones lambda". Una expresión lambda es una definición de método en línea: permite definir una subrutina *dentro de una lista de parámetros*. Para obtener detalles sobre cómo escribir expresiones lambda de Java, consulte `este tutorial <https://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html#syntax>`__.
zh_cn: 尽管方法引用可以很好地传递已编写的子例程，但是如果子例程永远不会在其他地方使用，则仅出于发送方法引用的目的而编写子例程通常是不便/浪费的。为避免这种情况，Java还支持称为“ lambda表达式”的功能。 Lambda表达式是一个内联方法定义-它允许在*参数列表*内定义子例程。有关如何编写Java lambda表达式的详细信息，请参见本教程<https://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html#syntax>`__.。

source: Lambda Expressions (C++)
es_mx: Expresiones Lambda (C++)
zh_cn: Lambda表达式（C ++）

source: Due to complications in C++ semantics, capturing ``this`` in a C++ lambda can cause a null pointer exception if done from a component command of a command group. Whenever possible, C++ users should capture relevant command members explicitly and by value. For more details, see `here <https://github.com/wpilibsuite/allwpilib/issues/3109>`__.
zh_cn: 由于C ++语义的复杂性，如果从命令组的组件命令执行此操作，则在C ++ lambda中捕获``this''会导致空指针异常。 C ++用户应尽可能明确并按值捕获相关的命令成员。有关更多详细信息，请参见`here <https://github.com/wpilibsuite/allwpilib/issues/3109>`__。

source: C++ lacks a close equivalent to Java method references - pointers to member functions are generally not directly useable as parameters due to the presence of the implicit ``this`` parameter. However, C++ does offer lambda expressions - in addition, the lambda expressions offered by C++ are in many ways more powerful than those in Java. For specifics on how to write C++ lambda expressions, see `cppreference <https://en.cppreference.com/w/cpp/language/lambda>`__.
es_mx: C++ carece de un equivalente cercano a las referencias a métodos de Java: los punteros a funciones miembro generalmente no se pueden usar directamente como parámetros debido a la presencia del parámetro implícito``this``. Sin embargo, C++ ofrece expresiones lambda; además, las expresiones lambda que ofrece C++ son, en muchos sentidos, más poderosas que las de Java. Para obtener detalles sobre cómo escribir expresiones lambda de C++, consulte `cppreference <https://en.cppreference.com/w/cpp/language/lambda>`__.
zh_cn: C ++缺少与Java方法引用几乎相同的功能-成员函数的指针由于存在隐式的“this”参数而通常不能直接用作参数。但是，C ++确实提供了lambda表达式——此外，C ++提供的lambda表达式在许多方面都比Java语言更强大。有关如何编写C ++ lambda表达式的详细信息，请参见`cppreference <https://en.cppreference.com/w/cpp/language/lambda>`__。

source: Inlined Command Example
es_mx: Ejemplo de comando en línea
zh_cn: 内联命令示例

source: So, what does an inlined command definition look like in practice?
es_mx: Entonces, ¿cómo se ve una definición de comando en línea en la práctica?
zh_cn: 那么，内联命令定义实际上是什么样的？

source: The ``InstantCommand`` class provides an example of a type of command that benefits greatly from inlining. Consider the following from the HatchBotInlined example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotInlined>`__):
es_mx: La clase ``InstantCommand`` proporciona un ejemplo de un tipo de comando que se beneficia enormemente de la inserción. Considere lo siguiente del proyecto de ejemplo HatchBotInlined (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotInlined>`__):
zh_cn: InstantCommand类提供了一个受益于内联的命令类型的示例。考虑一下HatchBotInlined示例项目中的以下内容（Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined> __，C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/HatchbotInlined> __）：

source: Instead of wastefully writing separate ``GrabHatch`` and ``ReleaseHatch`` commands which call only one method before ending, both can be accomplished with a simple inline definition by passing appropriate subsystem method.
es_mx: En lugar de escribir inútilmente comandos separados ``GrabHatch`` y ``ReleaseHatch`` que llaman solo a un método antes de finalizar, ambos pueden lograrse con una definición en línea simple pasando el método de subsistema apropiado.
zh_cn: 不必浪费时间编写单独的“GrabHatch”和“ReleaseHatch”命令，这些命令在结束前仅调用一个方法，而可以通过传递适当的子系统方法，通过简单的内联定义来完成这两个命令。

source: Included Command Types
es_mx: Tipos de comandos incluidos
zh_cn: 包含的命令类型

source: The command-based library includes a variety of pre-written commands for commonly-encountered use cases. Many of these commands are intended to be used "out-of-the-box" via `inlining <#inline-command-definitions>`_, however they may be subclassed, as well. A list of the included pre-made commands can be found below, along with brief examples of each - for more rigorous documentation, see the API docs (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/package-summary.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>`__).
es_mx: La biblioteca basada en comandos incluye una variedad de comandos preescritos para casos de uso comunes. Muchos de estos comandos están pensados para ser usados "fuera de la caja" a través de `inlining <#inline-command-definitions>` _, sin embargo, también pueden ser subclasificados. A continuación se puede encontrar una lista de los comandos prefabricados incluidos, junto con breves ejemplos de cada uno; para obtener una documentación más rigurosa, consulte los documentos de la API (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/package-summary.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>` __).
zh_cn: 基于命令的库包含各种针对常见用例的预先编写的命令。这些命令中的许多命令都旨在通过内联<#inline-command-definitions> _来“开箱即用”使用，但是它们也可以被子类化。您可以在下面找到包含的预制命令列表，以及每个命令的简短示例-有关更严格的文档，请参阅API文档（Java api <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/package-summary.html> __，C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html> __）。

source: ConditionalCommand
zh_cn: 条件命令

source: The ``ConditionalCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ConditionalCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ConditionalCommand.html>`__) runs one of two commands when executed, depending on a user-specified true-or-false condition:
es_mx: La clase ``ConditionalCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ConditionalCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ConditionalCommand.html>`__) corre uno de los dos comandos cuando se ejecuta, dependiendo de una condición verdadera o falsa especificada por el usuario:
zh_cn: ConditionalCommand类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ConditionalCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ConditionalCommand.html>`__）在执行时会运行两个命令之一，具体取决于用户指定的是非条件：

source: While the Java version of SelectCommand simply uses an ``Object`` as a key, the C++ version is templated on the key type.
es_mx: Mientras que la versión Java de SelectCommand simplemente usa un ``Object`` como clave, la versión C++ se basa en el tipo de clave.
zh_cn: Java版本的SelectCommand仅使用“Object”作为键，而C ++版本则以键类型为模板。

source: An alternate version of SelectCommand simply takes a method that supplies the command to be run - this can be very succinct, but makes inferring the command's requirements impossible, and so leaves the user responsible for manually adding the requirements to the SelectCommand.
es_mx: Una versión alternativa de SelectCommand simplemente toma un método que proporciona el comando que se ejecutará; esto puede ser muy conciso, pero hace imposible inferir los requisitos del comando y, por lo tanto, deja al usuario responsable de agregar manualmente los requisitos al SelectCommand.
zh_cn: SelectCommand的替代版本仅采用一种提供要运行的命令的方法——这可能非常简洁，但是使推断命令的需求成为不可能，因此，用户需要手动将需求添加到SelectCommand。

source: The ``SelectCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SelectCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SelectCommand.html>`__) is a generalization of the ``ConditionalCommand`` class that runs one of a selection of commands based on the value of a user-specified selector. The following example code is taken from the SelectCommand example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SelectCommand>`__):
es_mx: La clase ``SelectCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SelectCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SelectCommand.html>` __) es una generalización de la clase ``ConditionalCommand `` que ejecuta uno de una selección de comandos basados en el valor de un selector especificado por el usuario. El siguiente código de ejemplo se toma del proyecto de ejemplo SelectCommand (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SelectCommand>` __):
zh_cn: SelectCommand类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SelectCommand.html>`__，C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SelectCommand.html>`__）是ConditionalCommand类的概括，它根据用户指定的选择器的值运行选择的命令之一。以下示例代码摘自SelectCommand示例项目（`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>`__，`C ++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/SelectCommand>`__）：

source: The ``InstantCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/InstantCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1InstantCommand.html>`__) executes a single action on initialization, and then ends immediately:
es_mx: La clase ``InstantCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/InstantCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1InstantCommand.html>`__) ejecuta una sola acción en la inicialización, y luego termina inmediatamente:
zh_cn: InstantCommand类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/InstantCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1InstantCommand.html>`__）在初始化时执行一个动作，然后立即结束：

source: The ``RunCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RunCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1RunCommand.html>`__) runs a specified method repeatedly in its ``execute()`` block. It does not have end conditions by default; users can either subclass it, or `decorate <#command-decorator-methods>`_ it to add them.
es_mx: La clase ``RunCommand `` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RunCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1RunCommand.html>` __) ejecuta un método especificado repetidamente en su bloque ``execute()``. No tiene condiciones finales por defecto; los usuarios pueden subclasificarlo o `decorarlo <#command-decorator-methods> para agregarlo.
zh_cn: RunCommand类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RunCommand.html>`__，C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1RunCommand.html>`__）在其execute（）块中重复运行指定的方法。默认情况下，它没有结束条件。用户可以将其子类化，也可以`装饰<#command-decorator-methods>`_以添加它们。

source: The ``StartEndCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/StartEndCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1StartEndCommand.html>`__) executes an action when starting, and a second one when ending. It does not have end conditions by default; users can either subclass it, or `decorate <#command-decorator-methods>`_ an inlined command to add them.
es_mx: La clase ``StartEndCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/StartEndCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1StartEndCommand.html>`__) ejecuta una acción al iniciar y una segunda al finalizar. No tiene condiciones finales por defecto; los usuarios pueden subclasificarlo o `decorate <#command-decorator-methods>`_ un comando en línea para agregarlos.
zh_cn: StartEndCommand类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/StartEndCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1StartEndCommand.html>`__）在开始时执行一个动作，在结束时执行第二个动作。默认情况下，它没有结束条件。用户可以将其子类化，也可以`装饰<#command-decorator-methods>`_内联命令来添加它们。

source: The ``FunctionalCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/FunctionalCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1FunctionalCommand.html>`__) allows all four ``Command`` methods to be passed in as method references or lambdas:
es_mx: La clase ``FunctionalCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/FunctionalCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1FunctionalCommand.html>`__) permite que los cuatro métodos de ``Command`` se pasen como referencias de método o lambdas:
zh_cn: FunctionCommand类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/FunctionalCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1FunctionalCommand.html>`__）允许将所有四个Command方法作为方法引用或lambda传入：

source: The ``PrintCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PrintCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PrintCommand.html>`__) prints a given string.
es_mx: La clase ``PrintCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PrintCommand.html>`__, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PrintCommand.html>` __) imprime un string determinado.
zh_cn: PrintCommand类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PrintCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PrintCommand.html>`__）打印给定的字符串。

source: The ``ScheduleCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ScheduleCommand.html>`__) schedules a specified command, and ends instantly:
es_mx: La clase ``ScheduleCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ScheduleCommand.html>`__) programa un comando en específico, que termina instantáneamente.
zh_cn: ScheduleCommand类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ScheduleCommand.html>`__）调度指定的命令并立即结束：

source: This is often useful for "forking off" from command groups: by default, commands in command groups are run *through* the command group, and are never themselves seen by the scheduler. Accordingly, their requirements are added to the group's requirements. While this is usually fine, sometimes it is undesirable for the entire command group to gain the requirements of a single command - a good solution is to "fork off" from the command group and schedule that command separately.
es_mx: Esto suele ser útil para "forking off" de los grupos de comandos: de forma predeterminada, los comandos de los grupos de comandos se ejecutan * a través * del grupo de comandos y el planificador nunca los ve. En consecuencia, sus requisitos se suman a los del grupo. Si bien esto suele estar bien, a veces no es deseable que todo el grupo de comandos obtenga los requisitos de un solo comando; una buena solución es "fork off" del grupo de comandos y programar ese comando por separado.
zh_cn: 这通常对于从命令组“forking off”很有用：默认情况下，命令组中的命令是*通过*命令组运行的，而调度程序永远不会看到它们。因此，他们的要求被添加到组的要求中。尽管这通常很好，但有时整个命令组都不希望获得单个命令的要求——一个好的解决方案是从命令组“fork off”并单独计划该命令。
