Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/convenience-features.po
Languages: es_mx, zh_cn

source: The ``ProxyScheduleCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ProxyScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ProxyScheduleCommand.html>`__) schedules a specified command, and does not end until that command ends:
es_mx: La clase ``ProxyScheduleCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ProxyScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ProxyScheduleCommand.html>`__) programa un comando en especifico, y no termina hasta que ese comando acabe.
zh_cn: ProxyScheduleCommand类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ProxyScheduleCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ProxyScheduleCommand.html>`__）计划指定的命令，并且直到该命令结束才结束：

source: This is often useful for "forking off" from command groups: by default, commands in command groups are run *through* the command group, and are never themselves seen by the scheduler. Accordingly, their requirements are added to the group's requirements. While this is usually fine, sometimes it is undesirable for the entire command group to gain the requirements of a single command - a good solution is to "fork off" from the command group and schedule the command separately.
es_mx: Esto suele ser útil para "forking off" de los grupos de comandos: de forma predeterminada, los comandos de los grupos de comandos se ejecutan *mediante* del grupo de comandos y el planificador nunca los ve. En consecuencia, sus requisitos se suman a los del grupo. Si bien esto suele estar bien, a veces no es deseable que todo el grupo de comandos obtenga los requisitos de un solo comando; una buena solución es "fork off" del grupo de comandos y programar el comando por separado.
zh_cn: 这通常对于从命令组“forking off”很有用：默认情况下，命令组中的命令是通过命令组运行的，而调度程序永远不会看到它们。因此，他们的要求被添加到组的要求中。虽然这通常很好，但是有时整个命令组都不希望获得单个命令的要求——一个好的解决方案是从命令组“fork iff”并单独计划命令。

source: The ``WaitCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1WaitCommand.html>`__) does nothing, and ends after a specified period of time elapses after its initial scheduling:
es_mx: La clase ``WaitCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1WaitCommand.html>` __) no hace nada y finaliza después de un período de tiempo especificado después de su programación inicial:
zh_cn: ``WaitCommand``类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1WaitCommand.html>`__）不执行任何操作，并在其初始调度后经过指定的时间段后结束：

source: This is often useful as a component of a command group.
es_mx: Suele resultar útil como componente de un grupo de mando.
zh_cn: 这通常作为命令组的组成部分很有用。

source: ``WaitCommand`` can also be subclassed to create a more complicated command that runs for a period of time. If ``WaitCommand`` is used in this method, the user must ensure that the ``WaitCommand``'s ``Initialize``, ``End``, and ``IsFinished`` methods are still called in order for the WaitCommand's timer to work.
es_mx: ``WaitCommand`` puede ser también se puede subclasificar para crear un comando más complicado que se ejecute por un periodo de tiempo. Si ``WaitCommand`` es usado en este método, el usuario debe asegurarse que el `WaitCommand``'s ``Initialize``, ``End`` y ``IsFinished`` siguen siendo llamados para que el temporizador del WaitCommand funcione.
zh_cn: 也可以将``WaitCommand``子类化以创建运行一段时间的更复杂的命令。如果在此方法中使用了“ WaitCommand”，则用户必须确保仍然调用“ WaitCommand”的“ Initialize”，“ End”和“ IsFinished”方法，以便WaitCommand的计时器起作用。

source: WaitUntilCommand
zh_cn: WaitUnitilCommand

source: The match timer used by WaitUntilCommand does *not* provide an official match time! While it is fairly accurate, use of this timer can *not* guarantee the legality of your robot's actions.
es_mx: ¡El temporizador de partido utilizado por WaitUntilCommand *no* proporciona una hora oficial de partido! Si bien es bastante preciso, el uso de este temporizador *no* puede garantizar la legalidad de las acciones de su robot.
zh_cn: WaitUntilCommand使用的比赛计时器*不*提供官方比赛时间！虽然非常准确，但是使用此计时器*不能*保证机器人动作的合法性。

source: The ``WaitUntilCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitUntilCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1WaitUntilCommand.html>`__) does nothing, and ends once a specified condition becomes true, or until a specified match time passes.
es_mx: La clase WaitUntilCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitUntilCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1WaitUntilCommand.html>` __) no hace nada y finaliza una vez que una condición especificada se convierte en verdadera, o hasta que pasa un tiempo de coincidencia especificado.
zh_cn: ``WaitUntilCommand``类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitUntilCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1WaitUntilCommand.html>`__）不执行任何操作，并在指定条件为真或经过指定的匹配时间后结束。

source: The ``PerpetualCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PerpetualCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PerpetualCommand.html>`__) runs a given command with its end condition removed, so that it runs forever (unless externally interrupted):
es_mx: La clase ``PerpetualCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PerpetualCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PerpetualCommand.html>`__) ejecuta un comando dado con su condición final eliminada, de modo que se ejecuta para siempre (a menos que sea interrumpido externamente):
zh_cn: PerpetualCommand类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PerpetualCommand.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PerpetualCommand.html>`__）运行给定命令并删除其终止条件，以便其永久运行（除非外部中断）：

source: Command Decorator Methods
es_mx: Métodos del decorador de comandos
zh_cn: 命令装饰器的方法

source: The ``Command`` interface contains a number of defaulted "decorator" methods which can be used to add additional functionality to existing commands. A "decorator" method is a method that takes an object (in this case, a command) and returns an object of the same type (i.e. a command) with some additional functionality added to it. A list of the included decorator methods with brief examples is included below - for rigorous documentation, see the API docs (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>`__).
es_mx: La interfaz de ``Command`` contiene una serie de métodos de "decorador" predeterminados que se pueden usar para agregar funcionalidad adicional a los comandos existentes. Un método "decorador" es un método que toma un objeto (en este caso, un comando) y devuelve un objeto del mismo tipo (es decir, un comando) con alguna funcionalidad adicional agregada. A continuación se incluye una lista de los métodos decoradores incluidos con breves ejemplos; para obtener una documentación rigurosa, consulte los documentos de la API (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>`__).
zh_cn: “ Command”界面包含许多默认的“ decorator”方法，可用于向现有命令添加其他功能。 “装饰器”方法是一种方法，该方法接受一个对象（在这种情况下为命令）并返回相同类型的对象（即命令），并添加了一些其他功能。下面包括了包含的装饰器方法的列表以及简短的示例-有关严格的文档，请参见API文档（Java Java 0533721bad8e2z0 __，C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html> __）。

source: The ``withTimeout()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withTimeout(double)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a3a10e79038afc9bc7c98461b7dbb895b>`__) adds a timeout to a command. The decorated command will be interrupted if the timeout expires:
es_mx: El decorador ``withTimeout()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withTimeout(double)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a3a10e79038afc9bc7c98461b7dbb895b>`__) añade un tiempo de espera a un comando. El comando decorado se interrumpirá si el tiempo de espera expira:
zh_cn: withTimeout（）装饰器（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withTimeout(double)>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a3a10e79038afc9bc7c98461b7dbb895b>`__）将超时添加到命令中。如果超时到期，修饰的命令将被中断：

source: The ``withInterrupt()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withInterrupt(java.util.function.BooleanSupplier)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a4a6078c253a1578b3310833dcdfc01f0>`__) decorator adds a condition on which the command will be interrupted:
es_mx: El decorador ``withInterrupt () `` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withInterrupt(java.util.function.BooleanSupplier)>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a4a6078c253a1578b3310833dcdfc01f0>` __) agrega una condición en la que el comando será interrumpido:
zh_cn: withInterrupt（）``（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withInterrupt(java.util.function.BooleanSupplier)>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a4a6078c253a1578b3310833dcdfc01f0>`__）装饰器添加了一个条件，命令将被中断：

source: The ``andThen()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#andThen(java.lang.Runnable)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ade79bfb9d4ad670cdcb35369c0081b37>`__) adds a method to be executed after the command ends:
es_mx: El decorador ``andThen()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#andThen(java.lang.Runnable)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ade79bfb9d4ad670cdcb35369c0081b37>`__) añade un método para ser ejecutado después de que el comando termine:
zh_cn: andThen（）装饰器（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#andThen(java.lang.Runnable)>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ade79bfb9d4ad670cdcb35369c0081b37>`__）添加了一个在命令结束后要执行的方法：

source: The ``beforeStarting()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#beforeStarting(java.lang.Runnable)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a65155a6d7062deed375da196d2ba4c89>`__) adds a method to be executed before the command starts:
es_mx: El decorador ``beforeStarting()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#beforeStarting(java.lang.Runnable)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a65155a6d7062deed375da196d2ba4c89>`__) agrega un método para ser ejecutado antes que el comando inicie.
zh_cn: ``beforeStarting（）``装饰器（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#beforeStarting(java.lang.Runnable)>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a65155a6d7062deed375da196d2ba4c89>`__）添加了要在命令启动之前执行的方法：

source: alongWith (Java only)
es_mx: alongWith (solo Java)
zh_cn: alongWith（仅Java）

source: This decorator is not supported in C++ due to technical constraints - users should simply construct a parallel command group the ordinary way instead.
es_mx: Este decorador no es compatible con C++ debido a limitaciones técnicas; los usuarios simplemente deberían construir un grupo de comandos paralelo de la forma habitual.
zh_cn: 由于技术限制，C ++不支持此装饰器——用户应简单地以常规方式构造并行命令组。

source: The ``alongWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#alongWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a :ref:`parallel command group <docs/software/commandbased/command-groups:ParallelCommandGroup>`. All commands will execute at the same time and each will end independently of each other:
zh_cn: The ``alongWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#alongWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a :ref:`parallel command group <docs/software/commandbased/command-groups:ParallelCommandGroup>`. 所有指令会在同时执行，并各自独立结束:

source: raceWith (Java only)
es_mx: raceWith (solo Java)
zh_cn: raceWith（仅Java）

source: This decorator is not supported in C++ due to technical constraints - users should simply construct a parallel race group the ordinary way instead.
es_mx: Este decorador no es compatible con C++ debido a limitaciones técnicas; los usuarios simplemente deberían construir un grupo de carreras paralelas de la forma habitual.
zh_cn: 由于技术限制，C ++不支持该装饰器——用户应该简单地以常规方式构造一个并行竞争组。

source: The ``raceWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#raceWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a :ref:`parallel race group <docs/software/commandbased/command-groups:ParallelRaceGroup>` that ends as soon as the first command ends. At this point all others are interrupted. It doesn't matter which command is the calling command:
zh_cn: The ``raceWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#raceWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a :ref:`parallel race group <docs/software/commandbased/command-groups:ParallelRaceGroup>` 此时，所有其他的都被中断。哪个命令是调用命令并不重要:

source: deadlineWith (Java only)
es_mx: deadlineWith (solo Java)
zh_cn: deadlineWith（仅Java）

source: This decorator is not supported in C++ due to technical constraints - users should simply construct a parallel deadline group the ordinary way instead.
es_mx: Este decorador no es compatible con C++ debido a limitaciones técnicas; los usuarios simplemente deberían construir un grupo de fecha límite paralelo de la forma habitual.
zh_cn: 由于技术限制，C ++不支持此装饰器——用户应简单地以常规方式构造并行的截止时间组。

source: The ``deadlineWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#deadlineWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a :ref:`parallel deadline group <docs/software/commandbased/command-groups:ParallelDeadlineGroup>` with the calling command being the deadline. When this deadline command ends it will interrupt any others that are not finished:
zh_cn: The ``deadlineWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#deadlineWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a :ref:`parallel deadline group <docs/software/commandbased/command-groups:ParallelDeadlineGroup>` 调用命令为截止日期。当该截止日期命令结束时，它将中断所有其他未完成的命令:

source: withName (Java only)
es_mx: withName (solo Java)
zh_cn: withName（仅Java）

source: This decorator is not supported in C++ due to technical constraints - users should set the name of the command inside their command class instead.
es_mx: Este decorador no es compatible con C++ debido a limitaciones técnicas; los usuarios deben establecer el nombre del comando dentro de su clase de comando.
zh_cn: 由于技术限制，C ++不支持此装饰器——用户应在其命令类中设置命令名称。

source: The ``withName()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#withName(java.lang.String)>`__ adds a name to a command. This name will appear on a dashboard when the command is sent via the `sendable interface <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#initSendable(edu.wpi.first.wpilibj.smartdashboard.SendableBuilder)>`__.
es_mx: El decorador ``withName()`` <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#withName(java.lang.String)>`__ agrega un nombre a un comando. Este nombre aparecerá en la dashboard cuando el comando es enviado por medio de la `interfaz de envío <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#initSendable(edu.wpi.first.wpilibj.smartdashboard.SendableBuilder)>`__.
zh_cn: withName（）装饰器<https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#withName(java.lang.String)>`__为命令添加名称。通过可发送接口<https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#initSendable(edu.wpi.first.wpilibj.smartdashboard.SendableBuilder)>`__发送命令时，此名称将出现在仪表板上。

source: The ``perpetually()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#perpetually()>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ae1583c73c9b953d8ff730d4809926518>`__) removes the end condition of a command, so that it runs forever.
es_mx: El decorador ``perpetually()``(`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#perpetually()>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ae1583c73c9b953d8ff730d4809926518>` __) elimina la condición de fin de un comando, de modo que se ejecute para siempre.
zh_cn: ``perpetually（）''装饰器（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#perpetually()>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ae1583c73c9b953d8ff730d4809926518>`__）删除了命令的结束条件，因此它可以永远运行。

source: Composing Decorators
es_mx: Decoradores de composición
zh_cn: 组成装饰器

source: Remember that decorators, like all command groups, can be composed! This allows very powerful and concise inline expressions:
es_mx: Recuerde que los decoradores, como todos los grupos de mando, se pueden componer. Esto permite expresiones en línea muy poderosas y concisas:
zh_cn: 请记住，装饰器和所有命令组一样都可以组成！这允许非常强大而简洁的内联表达式：

source: Static Factory Methods for Command Groups (Java only)
es_mx: Métodos estáticos de fábrica para grupos de comandos (solo Java)
zh_cn: 命令组的静态工厂方法 (仅Java)

source: These factory methods are not included in the C++ command library, as the reduction in verbosity would be minimal - C++ commands should be stack-allocated, removing the need for the ``new`` keyword.
es_mx: Estos métodos de fábrica no están incluidos en la biblioteca de comandos de C++, ya que la reducción de la verbosidad sería mínima; los comandos de C++ deben asignarse en pila, eliminando la necesidad de la palabra clave ``new``.
zh_cn: 这些工厂方法未包含在C ++命令库中，因为冗长程度的降低极小——C ++命令应进行堆栈分配，而无需使用“new”关键字。

source: If users do not wish to use the ``andThen``, ``alongWith``, ``raceWith``, and ``deadlineWith`` decorators for declaring command groups, but still wish to reduce verbosity compared to calling the constructors, the ``CommandGroupBase`` `class <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html>`__ contains four static factory methods for declaring command groups: ``sequence()``, ``parallel()``, ``race()``, and ``deadline()``. When used from within a command group subclass or in combination with ``import static``, these become extremely concise and greatly aid in command composition:
es_mx: Si los usuarios no desean usar los decoradores ``andThen``, ``alongWith``, ``raceWith``, y ``deadlineWith`` para declarar grupos de comandos, pero aún desean reducir la verbosidad en comparación con llamar a los constructores, la clase ``CommandGroupBase`` <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html> `__ contiene cuatro métodos de fábrica estáticos para declarar grupos de comandos:``sequence()``, ``parallel()``, ``race()``, and ``deadline()``. Cuando se usa desde una subclase de grupo de comando o en combinación con ``import static``, estos se vuelven extremadamente concisos y ayudan mucho en la composición de comandos:
zh_cn: 如果用户不希望使用装饰器“ andThen”，“ alongWith”，“ raceWith”和“ deadlineWith”修饰符来声明命令组，但与调用构造函数相比，仍然希望减少冗长性， ``CommandGroupBase''类<https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html>`__包含四个用于声明命令组的静态工厂方法：``sequence（）``，``parallel（）``，``race（）``和``deadline（ ）。当从命令组子类中使用或与``import static''结合使用时，这些变得非常简洁，并极大地有助于命令的编写

source: perpetually
es_mx: perpetuamente
