Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/profile-subsystems-commands.po
Languages: es_mx

source: Motion Profiling through TrapezoidProfileSubsystems and TrapezoidProfileCommands
es_mx: Creación de perfiles de movimiento a través de los subsistemas TrapezoidProfile y los comandos TrapezoidProfile

source: For a description of the WPILib motion profiling features used by these command-based wrappers, see :ref:`docs/software/advanced-controls/controllers/trapezoidal-profiles:Trapezoidal Motion Profiles in WPILib`.
es_mx: Para obtener una descripción de las funciones de creación de perfiles de movimiento de WPILib utilizadas por estos contenedores basados en comandos, consulte :ref:`docs/software/advanced-controls/controllers/trapezoidal-profiles:Trapezoidal Motion Profiles in WPILib`.

source: The ``TrapezoidProfile`` command wrappers are generally intended for composition with custom or external controllers. For combining trapezoidal motion profiling with WPILib's ``PIDController``, see :doc:`profilepid-subsystems-commands`.
es_mx: Los contenedores de comando ``TrapezoidProfile`` generalmente están destinados a la composición con controladores personalizados o externos. Para combinar la creación de perfiles de movimiento trapezoidal con el ``PIDController`` de WPILib, consulte :doc:`profilepid-subsystems-commands`.

source: When controlling a mechanism, is often desirable to move it smoothly between two positions, rather than to abruptly change its setpoint. This is called "motion-profiling," and is supported in WPILib through the ``TrapezoidProfile`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/TrapezoidProfile.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TrapezoidProfile.html>`__).
es_mx: Cuando se controla un mecanismo, a menudo es deseable moverlo suavemente entre dos posiciones, en lugar de cambiar bruscamente su punto de ajuste. Esto se llama "perfil de movimiento", y es soportado en WPILib a través de la clase ``TrapezoidProfile`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/trajectory/TrapezoidProfile.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TrapezoidProfile.html>`__).

source: To further help teams integrate motion profiling into their command-based robot projects, WPILib includes two convenience wrappers for the ``TrapezoidProfile`` class: ``TrapezoidProfileSubsystem``, which automatically generates and executes motion profiles in its ``periodic()`` method, and the ``TrapezoidProfileCommand``, which executes a single user-provided ``TrapezoidProfile``.
es_mx: Para ayudar aún más a los equipos a integrar la creación de perfiles de movimiento en sus proyectos de robots basados en comandos, WPILib incluye dos envoltorios de conveniencia para la clase ``TrapezoidProfile``: ``TrapezoidProfileSubsystem``, que genera y ejecuta automáticamente perfiles de movimiento en su método ``periodic()`` , y el``TrapezoidProfileCommand``, que ejecuta un único ``TrapezoidProfile`` proporcionado por el usuario.

source: TrapezoidProfileSubsystem
es_mx: TrapezoideProfileSubsystem

source: In C++, the ``TrapezoidProfileSubsystem`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in values *must* have units consistent with the distance units, or a compile-time error will be thrown. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
es_mx: En C ++, la clase ``TrapezoidProfileSubsystem`` se basa en el tipo de unidad utilizada para las mediciones de distancia, que puede ser angular o lineal. Los valores pasados *deben* tener unidades consistentes con las unidades de distancia, o se lanzará un error en tiempo de compilación. Para obtener más información sobre las unidades C ++, consulte :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.

source: The ``TrapezoidProfileSubsystem`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileSubsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1TrapezoidProfileSubsystem.html>`__) will automatically create and execute trapezoidal motion profiles to reach the user-provided goal state. To use the ``TrapezoidProfileSubsystem`` class, users must create a subclass of it.
es_mx: La clase ``TrapezoidProfileSubsystem`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileSubsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1TrapezoidProfileSubsystem.html>`__) creará y ejecutará automáticamente perfiles de movimiento trapezoidales para alcanzar el estado que se quiera, proporcionado por el usuario. Para utilizar la clase ``TrapezoidProfileSubsystem``, los usuarios deben crear una subclase de la misma.

source: Creating a TrapezoidProfileSubsystem
es_mx: Creación de un subsistema de perfil trapezoidal

source: When subclassing ``TrapezoidProfileSubsystem``, users must override a single abstract method to provide functionality that the class will use in its ordinary operation:
es_mx: Al subclasificar ``TrapezoidProfileSubsystem``, los usuarios deben anular un único método abstracto para proporcionar la funcionalidad que la clase usará en su operación ordinaria:

source: The ``useState()`` method consumes the current state of the motion profile. The ``TrapezoidProfileSubsystem`` will automatically call this method from its ``periodic()`` block, and pass it the motion profile state corresponding to the subsystem's current progress through the motion profile.
es_mx: El método ``useState()`` consume el estado actual del perfil de movimiento. El ``TrapezoidProfileSubsystem`` llamará automáticamente a este método desde su bloque ``periodic()`` y le pasará el estado del perfil de movimiento correspondiente al progreso actual del subsistema a través del perfil de movimiento.

source: Users may do whatever they want with this state; a typical use case (as shown in the `Full TrapezoidProfileSubsystem Example`_) is to use the state to obtain a setpoint and a feedforward for an external "smart" motor controller.
es_mx: Los usuarios pueden hacer lo que quieran con este estado; un caso de uso típico (como se muestra en el `Full TrapezoidProfileSubsystem Example`_) es usar el estado para obtener un punto de ajuste y un avance para un controlador de motor "inteligente" externo.

source: Constructor Parameters
es_mx: Parámetros de constructor

source: Users must pass in a set of ``TrapezoidProfile.Constraints`` to the ``TrapezoidProfileSubsystem`` base class through the superclass constructor call of their subclass. This serves to constrain the automatically-generated profiles to a given maximum velocity and acceleration.
es_mx: Los usuarios deben pasar un conjunto de ``TrapezoidProfile.Constraints`` a la clase base ``TrapezoidProfileSubsystem`` a través de la llamada al constructor de superclase de su subclase. Esto sirve para restringir los perfiles generados automáticamente a una velocidad y aceleración máximas determinadas.

source: Users must also pass in an initial position for the mechanism.
es_mx: Los usuarios también deben pasar en una posición inicial para el mecanismo.

source: Advanced users may pass in an alternate value for the loop period, if a non-standard main loop period is being used.
es_mx: Los usuarios avanzados pueden pasar un valor alternativo para el período de bucle, si se está utilizando un período de bucle principal no estándar.

source: Using a TrapezoidProfileSubsystem
es_mx: Uso de un TrapezoidProfileSubsystem

source: Once an instance of a ``TrapezoidProfileSubsystem`` subclass has been created, it can be used by commands through the following methods:
es_mx: Una vez que se ha creado una instancia de una subclase ``TrapezoidProfileSubsystem``, los comandos pueden usarla a través de los siguientes métodos:

source: If you wish to set the goal to a simple distance with an implicit target velocity of zero, an overload of ``setGoal()`` exists that takes a single distance value, rather than a full motion profile state.
es_mx: Si desea establecer el objetivo en una distancia simple con una velocidad objetivo implícita de cero, existe una sobrecarga de ``setGoal()`` que toma un valor de distancia único, en lugar de un estado de perfil de movimiento completo.

source: The ``setGoal()`` method can be used to set the goal state of the ``TrapezoidProfileSubsystem``. The subsystem will automatically execute a profile to the goal, passing the current state at each iteration to the provided `useState()`_ method.
es_mx: El método ``setGoal()`` se puede utilizar para establecer el estado objetivo del ``TrapezoidProfileSubsystem``. El subsistema ejecutará automáticamente un perfil para el objetivo, pasando el estado actual en cada iteración al método `useState()`_ proporcionado.

source: Todo
es_mx: Qué hacer

source: add section on enable/disable once these are added to profilesubsystem classes.
es_mx: agregue una sección sobre habilitar/deshabilitar una vez que se agreguen a las clases de subsistema de perfiles.

source: Full TrapezoidProfileSubsystem Example
es_mx: Ejemplo completo de TrapezoidProfileSubsystem

source: What does a ``TrapezoidProfileSubsystem`` look like when used in practice? The following examples are taking from the ArmbotOffobard example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>`__):
es_mx: ¿Qué aspecto tiene un ``TrapezoidProfileSubsystem`` cuando se utiliza en la práctica? Los siguientes ejemplos están tomados del proyecto de ejemplo ArmbotOffobard (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/armbotoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/ArmBotOffboard>`__):

source: Using a ``TrapezoidProfileSubsystem`` with commands can be quite simple:
es_mx: Usar un ``TrapezoidProfileSubsystem`` con comandos puede ser bastante simple:

source: TrapezoidProfileCommand
es_mx: Comando TrapezoideProfile

source: In C++, the ``TrapezoidProfileCommand`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in values *must* have units consistent with the distance units, or a compile-time error will be thrown. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
es_mx: En C++, la clase ``TrapezoidProfileCommand`` se basa en el tipo de unidad utilizada para las mediciones de distancia, que puede ser angular o lineal. Los valores pasados *deben* tener unidades consistentes con las unidades de distancia, o se lanzará un error en tiempo de compilación. Para obtener más información sobre las unidades C++, consulte :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.

source: The ``TrapezoidProfileCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1TrapezoidProfileCommand.html>`__) allows users to create a command that will execute a single ``TrapezoidProfile``, passing its current state at each iteration to a user-defined function.
es_mx: La clase ``TrapezoidProfileCommand`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/TrapezoidProfileCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1TrapezoidProfileCommand.html>`__) permite a los usuarios crear un comando que ejecutará un único ``TrapezoidProfile``, pasando su estado actual en cada iteración a una función definida por el usuario.

source: As with ``TrapezoidProfileSubsystem``, users can create a ``TrapezoidProfileCommand`` by subclassing the ``TrapezoidProfileCommand`` class. However, as with many of the other command classes in the command-based library, users may want to save code by defining a ``TrapezoidProfileCommand`` :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`.
es_mx: Al igual que con ``TrapezoidProfileSubsystem``, los usuarios pueden crear un ``TrapezoidProfileCommand`` subclasificando la clase ``TrapezoidProfileCommand``. Sin embargo, como ocurre con muchas de las otras clases de comandos de la biblioteca basada en comandos, los usuarios pueden querer guardar el código definiendo un ``TrapezoidProfileCommand`` :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`.

source: Creating a TrapezoidProfileCommand
es_mx: Creando un TrapezoidProfileCommand

source: A ``TrapezoidProfileCommand`` can be created two ways - by subclassing the ``TrapezoidProfileCommand`` class, or by defining the command :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. Both methods ultimately extremely similar, and ultimately the choice of which to use comes down to where the user desires that the relevant code be located.
es_mx: Se puede crear un ``TrapezoidProfileCommand`` de dos maneras: subclasificando la clase ``TrapezoidProfileCommand`` o definiendo el comando :ref:`inline <docs/software/commandbased/convenience-features:Inline Command Definitions>`. En ambos métodos son extremadamente similares y por último la elección de cuál usar se reduce al lugar donde el usuario desea que se ubique el código relevante.

source: In either case, a ``TrapezoidProfileCommand`` is created by passing the necessary parameters to its constructor (if defining a subclass, this can be done with a `super()` call):
es_mx: En cualquier caso, se crea un ``TrapezoidProfileCommand`` pasando los parámetros necesarios a su constructor (si se define una subclase, esto se puede hacer con una llamada `super ()`):

source: The ``profile`` parameter is the ``TrapezoidProfile`` object that will be executed by the command. By passing this in, users specify the start state, end state, and motion constraints of the profile that the command will use.
es_mx: El parámetro ``profile`` es el objeto ``TrapezoidProfile`` que será ejecutado por el comando. Al pasar esto, los usuarios especifican el estado inicial, el estado final y las restricciones de movimiento del perfil que usará el comando.

source: The ``output`` parameter is a function (usually passed as a :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) that consumes the output and setpoint of the control loop. Passing in the ``useOutput`` function in ``PIDCommand`` is functionally analogous to overriding the `useState()`_ function in ``PIDSubsystem``.
es_mx: El parámetro ``output`` es una función (normalmente pasada como :ref:`lambda <docs/software/commandbased/convenience-features:Lambda Expressions (Java)>`) que consume la salida y el punto de ajuste del lazo de control. Pasar la función ``useOutput`` en ``PIDCommand`` es funcionalmente análogo a anular la función `useState()`_ en ``PIDSubsystem``.

source: requirements
es_mx: requisitos

source: Like all inlineable commands, ``TrapezoidProfileCommand`` allows the user to specify its subsystem requirements as a constructor parameter.
es_mx: Como todos los comandos en línea, ``TrapezoidProfileCommand`` permite al usuario especificar los requisitos de su subsistema como un parámetro de constructor.

source: Full TrapezoidProfileCommand Example
es_mx: Ejemplo completo de TrapezoidProfileCommand

source: What does a ``TrapezoidProfileSubsystem`` look like when used in practice? The following examples are taking from the DriveDistanceOffboard example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>`__):
es_mx: ¿Qué aspecto tiene un ``TrapezoidProfileSubsystem`` cuando se utiliza en la práctica? Los siguientes ejemplos están tomados del proyecto de ejemplo DriveDistanceOffboard (`Java <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/drivedistanceoffboard>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/main/wpilibcExamples/src/main/cpp/examples/DriveDistanceOffboard>`__):

source: And, for an :ref:`inlined <docs/software/commandbased/convenience-features:Inline Command Definitions>` example:
es_mx: Y, para un ejemplo :ref:`inlined <docs/software/commandbased/convenience-features:Inline Command Definitions>`
