Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/build-instructions.po
Languages: fr_ca

source: Build Instructions
fr_ca: Instructions de compilaton

source: This document contains information on how to build the HTML, PDF, and EPUB versions of the frc-docs site. frc-docs uses Sphinx as the documentation generator. This document also assumes you have basic knowledge of `Git <https://git-scm.com/>`__ and console commands.
fr_ca: Ce document présente l'information nécessaire pour compiler les versions HTML, PDF, et EPUB du site frc-docs. Le projet frc-docs utilise Sphinx comme générateur de documentation. Ce document suppose également que vous avez une connaissance de base de `Git <https://git-scm.com/>`__ et des commandes de la console.

source: Prerequisites
fr_ca: Prérequis

source: Ensure that `Git <https://git-scm.com/>`__ is installed and that the frc-docs repository is cloned by using ``git clone https://github.com/wpilibsuite/frc-docs.git``.
fr_ca: Assurez-vous que `Git <https://git-scm.com/>`__ est installé et que la bibliothèque frc-docs est dupliquée en utilisant ``git clone https://github.com/wpilibsuite/frc-docs.git``.

source: The majority of MikTeX packages are not required for building HTML, additional packages may be required for building PDF and EPUB.
fr_ca: La plupart des modules MikTeX ne sont pas requis pour compiler du HTML, par contre des modules supplémentaires peuvent être nécessaires pour compiler en PDF ou EPUB.

source: `Python 3.6 or greater <https://www.python.org/downloads/>`__
fr_ca: `Python 3.6 ou ultérieure <https://www.python.org/downloads/>`__

source: Ensure that Python is in your Path by selecting the **Add Python to PATH** toggle when installing Python.
fr_ca: Assurez-vous que Python fait partie de votre chaîne Path en sélectionnant l'option **Add Python to PATH** lors de l'installation de Python.

source: Once Python is installed, open up Powershell. Then navigate to the frc-docs directory. Run the following command: ``pip install -r source/requirements.txt``
fr_ca: Une fois Python installée, ouvrez Powershell, puis localisez le répertoire frc-docs. Exécutez la commande suivante: ``pip install -r source/requirements.txt``

source: Install the missing MikTex packages by navigating to the frc-docs directory, then running the following command from Powershell: ``mpm --verbose --require=@miktex-packages.txt``
fr_ca: Installez les modules MikTex manquants en localisant le répertoire frc-docs, puis en exécutant la commande suivante dans Powershell: ``mpm --verbose --require=@miktex-packages.txt``

source: Lastly, you need to install ``rsvg-convert`` by running the ``scripts/install-rsvg-convert.ps1`` script in powershell. This requires administrator access.
fr_ca: Finalement, vous devez installer ``rsvg-convert`` en exécutant le script ``scripts/install-rsvg-convert.ps1`` dans powershell. Cette opération nécessite un accès en tant qu'administrateur.

source: Building
fr_ca: Compilation

source: Open up a Powershell Window or terminal and navigate to the frc-docs directory that was cloned.
fr_ca: Ouvrez une console ou une fenêtre Powershell Window et localisez le répertoire frc-docs qui a été dupliqué.

source: Lint Check
fr_ca: Vérificateur syntaxique

source: Lint Check will not check line endings on Windows due to a bug with line endings. See `this issue <https://bugs.launchpad.net/doc8/+bug/1756704>`__ for more information.
fr_ca: Le vérificateur syntaxique ne vérifiera pas les fins de phrases sur Windows à cause d'un bug lié aux fins de phrases. Consultez `ce problème <https://bugs.launchpad.net/doc8/+bug/1756704>`__ pour plus d'information.

source: It's encouraged to check any changes you make with the linter. This **will** fail the buildbot if it does not pass. To check, run ``.\make lint``
fr_ca: Il est suggéré de vérifier les changements apportés avec le vérificateur syntaxique. Sinon, la compilation automatique **échouera**. Pour vérifier, exécutez ``.\make lint``

source: Link Check
fr_ca: Vérificateur de lien

source: The link checker makes sure that all links in the documentation resolve. This **will** fail the buildbot if it does not pass. To check, run ``.\make linkcheck``
fr_ca: Le vérificateur de lien s'assure que tous les liens dans la documentation sont correctement définis. Sinon, la compilation automatique **échouera**. Pour vérifier, exécutez ``.\make linkcheck``

source: Image Size Check
fr_ca: Vérificateur de taille des images

source: Please run ``.\make sizecheck`` to verify that all images are below 500KB. This check *will* fail CI if it fails. Exclusions are allowed on a case by case basis and are added to the ``IMAGE_SIZE_EXCLUSIONS`` list in the configuration file.
fr_ca: Exécutez ``.\make sizecheck`` pour vérifier que toutes les images font moins de 500ko. Les excès feront *échouer* l'intégration continue. Des exceptions seront permises au cas par cas et elles seront ajoutées à la liste ``IMAGE_SIZE_EXCLUSIONS`` du fichier de configuration.

source: Redirect Check
fr_ca: Rediriger la vérification

source: Files that have been moved or renamed must have their new location (or replaced with 404) in the ``redirects.txt`` file in ``source``.
fr_ca: Les fichiers qui ont été déplacés ou renommés doivent avoir leur nouvel emplacement (ou remplacé par 404) dans le fichier ``redirects.txt`` dans la ``source``.

source: The redirect writer will automatically add renamed/moved files to the redirects file. Run ``.\make rediraffewritediff``.
fr_ca: Le rédacteur de redirection ajoutera automatiquement les fichiers renommés ou déplacés au fichier de redirection. Run ``.\make rediraffewritediff``.

source: if a file is both moved and substantially changed, the redirect writer will not add it to the ``redirects.txt`` file, and the ``redirects.txt`` file will need to be manually updated.
fr_ca: si un fichier est à la fois déplacé et substantiellement modifié, le rédacteur de la redirection ne l'ajoutera pas au fichier ``redirects.txt``, et ``redirects.txt`` aura besoin d'être mis à jour manuellement.

source: The redirect checker makes sure that there are valid redirects for all files. This **will** fail the buildbot if it does not pass. To check, run ``.\make rediraffecheckdiff`` to verify all files are redirected. Additionally, an HTML build may need to be ran to ensure that all files redirect properly.
fr_ca: Le vérificateur de redirection s'assure qu'il existe des redirections valides pour tous les fichiers. Cela ** fera ** échouer le buildbot s'il ne réussit pas. Pour vérifier, exécutez ``.\make rediraffecheckdiff`` pour vérifier que tous les fichiers sont redirigés. De plus, une version HTML peut devoir être exécutée pour garantir que tous les fichiers sont correctement redirigés.

source: Building HTML
fr_ca: Compilation en HTML

source: Type the command ``.\make html`` to generate HTML content. The content is located in the ``build/html`` directory at the root of the repository.
fr_ca: Exécutez ``.\make html`` pour générer le contenu en HTML. Le contenu HTML est situé dans le répertoire ``build/html`` à la racine de la bibliothèque.

source: Building PDF
fr_ca: Compilation en PDF

source: Please note that PDF build on Windows may result in distorted images for SVG content. This is due to a lack of librsvg2-bin support on Windows.
fr_ca: Notez que la compilation PDF sous Windows peut causer la distorsion d'image au format SVG. Ceci est dû au manque de ressources librsvg2-bin sur Windows.

source: Type the command ``.\make latexpdf`` to generate PDF content. The PDF is located in the ``build/latex`` directory at the root of the repository.
fr_ca: Exécutez ``.\make latexpdf`` pour générer le contenu en PDF. Le contenu PDF est situé dans le répertoire ``build/latex`` à la racine de la bibliothèque.

source: Building EPUB
fr_ca: Compilation en EPUB

source: Type the command ``.\make epub`` to generate EPUB content. The EPUB is located in the ``build/epub`` directory at the root of the repository.
fr_ca: Exécutez ``.\make epub`` pour générer le contenu en EPUB. Le contenu EPUB est situé dans le répertoire ``build/epub`` à la racine de la bibliothèque.

source: Adding Python Third-Party libraries
fr_ca: Ajout de librairies tierces Python

source: After modifying frc-docs dependencies in any way, ``requirements.txt`` must be regenerated by running ``poetry export -f requirements.txt --output source/requirements.txt --without-hashes`` from the root of the repo.
fr_ca: Après avoir modifié les dépendances frc-docs de quelque manière que ce soit, ``requirements.txt`` doit être régénéré en exécutant ``poetry export -f requirements.txt --output source/requirements.txt --without-hashes`` à partir de la racine du repo.

source: frc-docs uses `Poetry <https://python-poetry.org/>`__ to manage its dependencies to make sure builds are reproducible.
fr_ca: frc-docs utilise `Poetry <https://python-poetry.org/>`__ pour gérer ses dépendances afin de s'assurer que les versions sont reproductibles.

source: Poetry is **not** required to build and contribute to frc-docs content. It is *only* used for dependency management.
fr_ca: Poetry n'est ** pas ** nécessaire pour créer et contribuer au contenu frc-docs. Il est * uniquement * utilisé pour la gestion des dépendances.

source: Installing Poetry
fr_ca: Installation de Poetry

source: Ensure that Poetry is installed. Run the following command: ``pip install poetry``
fr_ca: Assurez-vous que Poetry est installé. Exécutez la commande suivante: `` pip install poetry ''

source: Adding a Dependency
fr_ca: Ajouter une dépendance

source: Add the dependency to the ``[tool.poetry.dependencies]`` section of ``pyproject.toml``. Make sure to specify an exact version. Then, run the following command: ``poetry lock --no-update``
fr_ca: Ajoutez la dépendance à la section ``[tool.poetry.dependencies]`` de ``pyproject.toml``. Assurez-vous de spécifier une version exacte. Ensuite, exécutez la commande suivante: ``poetry lock --no-update``

source: Updating a Top-Level Dependency
fr_ca: Mise à jour d'une dépendance de niveau supérieur

source: Update the dependency's version in the ``[tool.poetry.dependencies]`` section of ``pyproject.toml``. Then, run the following command: ``poetry lock --no-update``
fr_ca: Mettez à jour la version de la dépendance dans la section ``[tool.poetry.dependencies]`` de ``pyproject.toml``. Ensuite, exécutez la commande suivante: ``poetry lock --no-update``

source: Updating Hidden Dependencies
fr_ca: Mise à jour des dépendances masquées

source: Run the following command: ``poetry lock``
fr_ca: Exécutez la commande suivante: ``poetry lock``
