Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/drawio-saving-instructions.po
Languages: pt

source: Draw.io Saving Instructions
pt: Instruções para Salvar no Draw.io

source: Make sure you don't modify any file that is in a ``diagrams`` folder, or ends in ``.drawio.svg`` in any program other than draw.io, otherwise you might risk breaking the metadata of the file, making it uneditable.
pt: Certifique-se de não modificar nenhum arquivo que está em uma pasta ``diagrams`` ou termina em ``.drawio.svg`` em qualquer programa diferente do draw.io. Caso contrário, você pode correr o risco de corromper os metadados do arquivo, tornando-os não editáveis.

source: Draw.io (also known as `diagrams.net <https://app.diagrams.net/>`__) are supported when saved as ``svg`` files, with embedded XML metadata for the draw.io source file (normally stored as ``.drawio``). This allows these images to both act as source files for the diagrams that can be edited in the future, and be rendered as normal ``svg`` files.
pt: Draw.io (também conhecido como `diagrams.net <https://app.diagrams.net/>`__) são suportados quando salvos como arquivos ``svg``, com metadados XML embutidos para o arquivo fonte draw.io (normalmente armazenado como ``.drawio``). Isso permite que essas imagens atuem como arquivos de origem para os diagramas que podem ser editados no futuro e que sejam renderizadas como arquivos ``svg`` normais.

source: There are a few methods to save a diagram with the embedded metadata, but using the export menu is preferred because it allows us to embed any images in the diagram, otherwise they might not render properly on the docs.
pt: Existem alguns métodos para salvar um diagrama com os metadados embutidos, mas usar o menu de exportação é preferível, já que nos permite incorporar qualquer imagem no diagrama. Caso contrário, elas podem não ser renderizadas corretamente nos documentos.

source: This method is applicable to both draw.io desktop and the web version at `diagrams.net <https://app.diagrams.net/>`__.
pt: Esse método é aplicável tanto ao desktop draw.io quanto à versão web em `diagrams.net <https://app.diagrams.net/>`__.

source: To export go to ``File - Export as - SVG...``. Make sure ``Include a copy of my diagram`` is enabled to embed the diagram metadata, and that ``Embed Images`` is enabled so image files in the diagram are embedded so they render in the docs. Additionally, mark the ``Transparent Background`` option to make sure the background is displayed correctly.
pt: Para exportar, vá para ``Arquivo - Exportar como - SVG ...``. Certifique-se de que ``Incluir uma cópia do meu diagrama`` esteja habilitado para incorporar os metadados do diagrama e que ``Incorporar Imagens`` esteja habilitado para que os arquivos de imagem no diagrama sejam incorporados para serem renderizados nos documentos. Além disso, marque a opção ``Fundo Transparente`` para garantir que o fundo seja exibido corretamente.

source: The export menu should look something like this:
pt: O menu de exportação deve ser parecido com isto:

source: Image depicting the export menu
pt: Imagem que descreve o menu de exportação

source: Then just click ``Export`` then select where you would like to save the file and save it.
pt: Em seguida, basta clicar em ``Exportar`` e selecionar onde você deseja salvar o arquivo.

source: When saving, make sure you follow the style-guide at :ref:`docs/contributing/frc-docs/style-guide:Draw.io Files`
pt: Ao salvar, certifique-se de seguir o guia de estilo em :ref:`docs/contributing/frc-docs/style-guide:Draw.io Files`
