Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/style-guide.po
Languages: pt

source: Style Guide
pt: Guia de Estilo

source: This document contains the various RST/Sphinx specific guidelines for the frc-docs project. For guidelines related to the various WPILib code projects, see `the WPILib GitHub <https://github.com/wpilibsuite/styleguide>`__
pt: Este documento contém as várias diretrizes específicas do RST/Sphinx para o projeto frc-docs. Para orientações relacionadas aos vários projetos de código WPILib, consulte `o WPILib GitHub <https://github.com/wpilibsuite/styleguide>`__

source: Filenames
pt: Nomes dos Arquivos

source: Use only lowercase alphanumeric characters and ``-`` (minus) symbol.
pt: Use apenas caracteres alfanuméricos minúsculos e o símbolo ``-`` (menos).

source: For documents that will have an identical software/hardware name, append "Hardware" or "Software" to the end of the document name. IE, ``ultrasonics-hardware.rst``
pt: Para documentos que terão um nome de software/hardware idêntico, acrescente "Hardware" ou "Software" no final do nome do documento. Por exemplo, ``ultrasonics-hardware.rst``

source: Suffix filenames with the ``.rst`` extension.
pt: Sufixo dos nomes dos arquivos com a extensão ``.rst``.

source: If you are having issues editing files with the ``.rst`` extension, the recommended text editor is `Notepad++ <https://notepad-plus-plus.org/>`__. Please make sure that `tabs are replaced with spaces <https://stackoverflow.com/questions/455037/convert-tabs-to-spaces-in-notepad>`__, and the space indentation is set to ``3``.
pt: Se você está tendo problemas para editar arquivos com a extensão ``.rst``, o editor de texto recomendado é Notepad++ <https://notepad-plus-plus.org/>`__. Por favor, certifique-se de que as `tabulações sejam substituídas por espaços <https://stackoverflow.com/questions/455037/convert-tabs-to-spaces-in-notepad>`__ e que o recuo do espaço esteja definido como ``3``.

source: Page References
pt: Referências da Página

source: Pages references will be auto-generated based on the page filename and section title.
pt: As referências das páginas serão geradas automaticamente com base no nome do arquivo da página e no título da seção.

source: For example, given the following file ``contributing.rst`` and a section called ``Page References``, you would reference this by doing ``:ref:`contributing:Page References```
pt: Por exemplo, dado o seguinte arquivo ``contributing.rst`` e uma seção chamada ``Page References``, você faria referência a isso fazendo ``:ref:`contributing:Page References```

source: Please note that document structure is preserved in references, with the root being the location of the ``conf.py`` file. To access documents in sub-folders, simply prepend the folder path before the filename. IE, ``:ref:`docs/software/hardware-apis/sensors/ultrasonics-sensors:Ultrasonics - Sensors```
pt: Note que a estrutura do documento é preservada nas referências, com a raiz sendo a localização do arquivo ``conf.py``. Para acessar documentos em sub-pastas, apenas preceda o caminho da pasta antes do nome do arquivo. Por Exemplo: ``:ref:`docs/software/hardware-apis/sensors/ultrasonics-sensors:Ultrasonics - Sensors```

source: Text
pt: Texto

source: All text content should be on the same line, if you need readability, use the word-wrap function of your editor.
pt: Todo o conteúdo de texto deve estar na mesma linha, se você precisar de legibilidade, use a função de quebra de texto do seu editor.

source: Use the following case for these terms:
pt: Use os seguintes casos para estes termos:

source: roboRIO (not RoboRIO, roboRio, or RoboRio)
pt: roboRIO (não RoboRIO, roboRio ou RoboRio)

source: LabVIEW (not labview or LabView)
pt: LabVIEW (não labview ou LabView)

source: Visual Studio Code (VS Code) (not vscode, VScode, vs code, etc)
pt: Visual Studio Code (VS Code) (não vscode, VScode, vs code, etc)

source: macOS (not Mac OS, Mac OSX, Mac OS X, Mac, Mac OS, etc.)
pt: macOS (não Mac OS, Mac OSX, Mac OS X, Mac, Mac OS, etc.)

source: GitHub (not github, Github, etc)
pt: GitHub (não github, Github, etc)

source: PowerShell (not powershell, Powershell, etc)
pt: PowerShell (não powershell, Powershell, etc)

source: Linux (not linux)
pt: Linux (não linux)

source: Java (not java)
pt: Java (não java)

source: Use the ASCII character set for English text. For special characters (e.g. Greek symbols) use the `standard character entity sets <https://docutils.sourceforge.io/docs/ref/rst/definitions.html#character-entity-sets>`_.
pt: Use o conjunto de caracteres ASCII para textos em inglês. Para caracteres especiais (por exemplo, símbolos gregos), use os `conjuntos de entidades de caracteres padrão <https://docutils.sourceforge.io/docs/ref/rst/definitions.html#character-entity-sets>`_.

source: Use ``.. math::`` for standalone equations and ``:math:`` for inline equations. A useful LaTeX equation cheat sheet can be found `here <https://www.reed.edu/academic_support/pdfs/qskills/latexcheatsheet.pdf>`_.
pt: Use ``.. math::`` para equações independentes e ``:math:`` para equações inline. Uma folha de dicas de equação LaTeX útil pode ser encontrada `aqui <https://www.reed.edu/academic_support/pdfs/qskills/latexcheatsheet.pdf>`_.

source: Use literals for filenames, function, and variable names.
pt: Use literais para nomes de arquivos, funções e nomes de variáveis.

source: Use of the registered trademarks *FIRST*\ |reg| and FRC\ |reg| should follow the Policy from `this page <https://www.firstinspires.org/brand>`__. Specifically, where possible (i.e. not nested inside other markup or in a document title), the first use of the trademarks should have the |reg| symbol and all instances of *FIRST* should be italicized. The |reg| symbol can be added by using ``.. include:: <isonum.txt>`` at the top of the document and then using ``*FIRST*\ |reg|`` or ``FRC\ |reg|``.
pt: Uso das marcas registradas *FIRST*\ |reg| and FRC\ |reg| deve seguir a Política `desta página: <https://www.firstinspires.org/brand>`__. Especificamente, onde possível (ou seja, não aninhado dentro de outra marcação ou no título de um documento), o primeiro uso das marcas registradas deve ter o símbolo |reg| e todas as instâncias de *FIRST* devem estar em itálico. O símbolo |reg| pode ser adicionado usando ``.. include:: <isonum.txt>`` no topo do documento, e então usando ``*FIRST*\ |reg|`` ou ``FRC\ |reg|``.

source: Commonly used terms should be added to the :ref:`docs/software/frc-glossary:FRC Glossary`. You can reference items in the glossary by using ``:term:`deprecated```.
pt: Termos usados frequentemente devem ser adicionados ao :ref:`docs/software/frc-glossary:FRC Glossary`. Você pode referenciar itens no glossário usando ``:term:`deprecated```.

source: Whitespace
pt: Espaço em Branco

source: Indentation
pt: Recuo

source: Indentation should *always* match the previous level of indentation *unless* you are creating a new content block.
pt: O recuo deve *sempre* corresponder ao nível anterior de recuo, *a menos* que você esteja criando um novo bloco de conteúdo.

source: Indentation of content directives as new line ``.. toctree::`` should be `3` spaces.
pt: O recuo das diretivas de conteúdo como uma nova linha ``.. toctree::`` deve ser `3` espaços.

source: Blank Lines
pt: Linhas em Branco

source: There should be ``1`` blank lines separating basic text blocks and section titles. There *should* be ``1`` blank line separating text blocks *and* content directives.
pt: Deve haver ``1`` linha em branco separando blocos de texto básicos e títulos de seção. *Deve* haver ``1`` linha em branco separando blocos de texto *e* diretivas de conteúdo.

source: Interior Whitespace
pt: Espaço em Branco Interno

source: Use one space between sentences.
pt: Use um espaço entre as frases.

source: Headings
pt: Títulos

source: Headings should be in the following structure. Heading underlines should match the same number of characters as the heading itself.
pt: Títulos devem estar na seguinte estrutura. Os sublinhados do título devem corresponder ao mesmo número de caracteres que o próprio título.

source: ``=`` for document titles. *Do not* use this more than *once* per article.
pt: ``=`` para títulos de documentos. *Não use* isso mais de *uma vez* por artigo.

source: ``-`` for document sections
pt: ``-`` para seções de documento

source: ``^`` for document sub-sections
pt: ``^`` para subseções do documento

source: ``~`` for document sub-sub-sections
pt: ``~`` para sub-subseções do documento

source: If you need to use any lower levels of structure, you're doing things wrong.
pt: Se você precisar usar outros níveis inferiores de estrutura, você está fazendo coisas erradas.

source: Use title case for headings.
pt: Deixe a primeira letra de cada palavra maiúscula para títulos.

source: Lists
pt: Listas

source: Lists should have a new line in between each indent level. The highest indent should have ``0`` indentation, and subsequent sublists should have an indentation starting at the first character of the previous indentation.
pt: As listas devem ter uma nova linha entre cada nível de recuo. O recuo mais alto deve ter recuo ``0``, e as sublistas subsequentes devem ter um recuo começando no primeiro caractere do recuo anterior.

source: Code blocks
pt: Blocos de código

source: Follow the `WPILib style guide <https://github.com/wpilibsuite/styleguide/>`_ for C++ and Java example code. For example, use two spaces for indentation in C++ and Java.
pt: Siga o guia de estilo do `WPILib <https://github.com/wpilibsuite/styleguide/>`_ para C++ e Java. Por exemplo, use dois espaços para recuo em C++ e Java.

source: When possible, instead of using code blocks, an RLI should be used. This pulls code lines directly from GitHub, most commonly using the example programs. This automatically keeps the code up to date with any changes that are made. The format of an RLI is:
pt: Quando possível, em vez de usar blocos de código, um RLI deve ser usado. Isso extrai linhas de código diretamente do GitHub, mais comumente usando os programas de exemplo. Isso automaticamente mantém o código atualizado com quaisquer alterações feitas. O formato de um RLI é:

source: Admonitions
pt: Advertências

source: Use
pt: Uso

source: NOT
pt: NÃO

source: Image Files
pt: Arquivos de Imagem

source: Table of Contents (TOC)
pt: Índice
