Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/basic-programming/git-getting-started.po
Languages: es_mx, fr_ca, tr_tr

source: Run: ``git add FILENAME.txt`` where FILENAME.txt is the name and extension of the file to add to a commit. Run: ``git add .`` will add every untracked, unexcluded file when ran in the root of the repository.
es_mx: Corra: ``git add FILENAME.txt donde FILENAME.txt`` es el nombre y extensión del archivo a añadir a un commit. Corra: ``git add.`` añadirá todo archivo inexcluido e inlocalizable cuando corra en la raíz del repositorio.
fr_ca: Exécutez: ``git add FILENAME.txt`` où FILENAME.txt est le nom et l'extension du fichier à ajouter à un Commit. Exécuter: ``git add .`` Ceci ajoutera tous les fichiers non suivis et non exclus lorsque cette commande est exécutée à partir du répertoire "root", ou racine du référentiel de données.
tr_tr: Çalıştır: ``git add FILENAME.txt`` burada FILENAME.txt, bir kaydetmeye eklenecek dosyanın adı ve uzantısıdır. Çalıştır: `` git add.`` , Arşivin kök dizininde çalıştırıldığında izlenmemiş, dışlanmamış her dosyayı ekleyecektir.

source: Git Commit
fr_ca: La commande Git Commit
tr_tr: Git Kaydetme

source: This command creates the commit and stores it locally. This saves the state and adds it to the repositories history.
es_mx: Este comando crea los commit y los guarda localmente. Eso guarda el estado y lo añade al historial del repositorio.
fr_ca: Cette commande crée le Commit et le stocke localement. Cela enregistre l'état du projet et l'ajoute à l'historique des référentiels.
tr_tr: Bu komut commit'i oluşturur ve yerel olarak depolar. Bu, durumu kaydeder ve depo geçmişine ekler.

source: Run: ``git commit -m "type message here"``
es_mx: Corra: ``git commit -m "type message here"``
fr_ca: Exécuter: ``git commit -m "type message here"``
tr_tr: Çalıştır: ``git commit -m "mesajı buraya yazın"``

source: Git Push
fr_ca: La commande Git Push

source: Upload (Push) your local changes to the remote (Cloud)
es_mx: Suba (Push) sus cambios locales al repositorio remoto (Cloud)
fr_ca: Téléchargez (Push) vos modifications locales sur le "Cloud" (à distance)
tr_tr: Yerel değişikliklerinizi uzak bilgisayara (Bulut) yükleyin (itin)

source: Run: ``git push``
es_mx: Corra: ``git push``
fr_ca: Exécuter: ``git push``
tr_tr: Çalıştır: ``git push``

source: Branches
es_mx: Ramas
fr_ca: Les Branches
tr_tr: Şubeler

source: Branches are a similar to parallel worlds to Git. They start off the same, and then they can "branch" out into different varying paths. Consider the Git control flow to look similar to this.
es_mx: Las ramas son similares a mundos paralelos para Git. Comienzan igual, y después pueden ramificarse en diferentes caminos. Considere que el flujo de control de Git luce similar a este.
fr_ca: Les branches sont similaires au concept de "mondes parallèles", mais appliqué à Git. Ils démarrent de la même façon, et ensuite peuvent "diverger" ou se "ramifier" sur différents chemins. Considérez le flux de contrôle Git comme similaire a cet exemple.
tr_tr: Dallar, Git'e paralel dünyalara benzer. Aynı şekilde başlarlar ve sonra farklı farklı yollara “dallanabilirler”. Buna benzer görünmesi için Git kontrol akışını düşünün.

source: In the above example, main was branched (or duplicated) into the branch Feature 1 and someone checked out the branch, creating a local copy. Then, someone committed (or uploaded) their changes, merging them into the branch Feature 1. You are "merging" the changes from one branch into another.
es_mx: En el ejemplo anterior, main se ramificó (o duplicó) en la rama Característica 1 y alguien revisó la rama, creando una copia local. Luego, alguien confirmó (o subió) sus cambios, fusionándolos en la rama Característica 1. Está "fusionando" los cambios de una rama con otra.
fr_ca: Dans l’exemple ci-dessus, la branche principale a été fusionnée (ou dupliquée) avec la branche dévolue à la Fonctionnalité 1 et quelqu’un a dupliqué la branche pour en avoir une copie locale. Ensuite, une personne fait un commit (ou téléchargé) de ses modifications, les fusionnant avec la branche de Fonctionnalité 1 de la branche. Vous "fusionnez" les changements d’une branche à l’autre.
tr_tr: Yukarıdaki örnekte, FeatureB, FeatureA ile birleştirilmiştir. Bu, birleştirme denen şeydir. Değişiklikleri bir daldan diğerine “birleştiriyorsunuz”.

source: Creating a Branch
es_mx: Crear una rama
fr_ca: Création d'une branche
tr_tr: Şube Oluşturma

source: Run: ``git branch branch-name`` where branch-name is the name of the branch to create. The new branch history will be created from the current active branch.
es_mx: Corra: ``git branch branch-name`` donde branch-name es el nombre de la rama a crear. El nuevo historial de la rama se creará de la rama activa actual.
fr_ca: Exécutez: ``git branch branch-name`` où branch-name est le nom de la branche à créer. Le nouvel historique de branche sera créé à partir de la branche active actuelle.
tr_tr: Çalıştır: ``git şube şube adı`` burada şube adı, oluşturulacak dalın adıdır. Yeni şube geçmişi, mevcut aktif şubeden oluşturulacaktır.

source: Entering a Branch
es_mx: Acceder a una rama
fr_ca: Entrer dans une branche
tr_tr: Şube Girmek

source: Once a branch is created, you have to then enter the branch.
es_mx: Una vez que la rama está creada, tienes que entrar a la rama.
fr_ca: Une fois qu'une branche est créée, vous devez ensuite entrer dans la branche.
tr_tr: Bir şube oluşturulduktan sonra şubeye girmeniz gerekir.

source: Run: ``git checkout branch-name`` where branch-name is the branch that was previously created.
es_mx: Corra: ``git checkout branch-name`` donde branch-name es la rama que fue previamente creada.
fr_ca: Exécutez: ``git checkout branch-name`` où branch-name est la branche qui a été créée précédemment.
tr_tr: Çalıştır: ``git checkout şube adı`` burada şube adı, daha önce oluşturulan daldır.

source: Merging
es_mx: Fusionar
fr_ca: Le fusionnement (Merge)
tr_tr: Birleştirme

source: In scenarios where you want to copy one branches history into another, you can merge them. A merge is done by calling ``git merge branch-name`` with branch-name being the name of the branch to merge from. It is automatically merged in the current active branch.
es_mx: En situaciones cuando se quiere copiar uno de los historiales de ramas dentro de otro, estos pueden ser fusionados. Una fusión es realizada llamando ``git merge branch-name`` con branch-name siendo el nombre de la rama de la cual se fusionará. Se fusiona automáticamente en la rama activa actual.
fr_ca: Dans les scénarios où vous souhaitez copier l'historique d'une branche dans une autre, vous pouvez les fusionner. Une fusion est effectuée en appelant ``git merge branch-name`` avec branch-name étant le nom de la branche à partir de laquelle fusionner. Il est automatiquement fusionné dans la branche active actuelle.
tr_tr: Bir dal geçmişini diğerine kopyalamak istediğiniz senaryolarda, bunları birleştirebilirsiniz. Birleştirme işlemi, dalın adı birleştirilecek dalın adı olacak şekilde ``git merge branch-name`` çağırılarak yapılır. Mevcut aktif şubede otomatik olarak birleştirilir.

source: It's common for a remote repository to contain work (history) that you do not have. Whenever you run ``git pull``, it will attempt to automatically merge those commits. That merge may look like the below.
es_mx: Es común que un repositorio remoto que contenga trabajo (historial) que usted no tenga. Cada vez que ``git pull`` se ejecute, intentará automáticamente fusionar esos commits. Esa fusión se parecerá a la del ejemplo de abajo.
fr_ca: Il est courant qu'un référentiel distant contienne un travail (historique) que vous n'avez pas. Chaque fois que vous exécutez ``git pull``, il tentera de fusionner automatiquement ces Commits. Cette fusion peut ressembler à ce qui suit.
tr_tr: Uzak bir deponun sahip olmadığınız çalışmaları (geçmiş) içermesi yaygındır. ``Git pull`` komutunu her çalıştırdığınızda, bu taahhütleri otomatik olarak birleştirmeye çalışacaktır. Bu birleştirme aşağıdaki gibi görünebilir.

source: However, in the above example, what if File 1 was modified by both branch FeatureA and FeatureB? This is called a **merge conflict**. A merge conflict will can be resolved by editing the conflicting file. In the example, we would need to edit File 1 to keep the history or changes that we want. After that has been done. Simply re-add, re-commit, and then push your changes.
es_mx: Sin embargo, en el ejemplo anterior, ¿que pasaría si File 1 fuera modificado por las dos ramas FeatureA y FeatureB? Esto es llamado un **conflicto de fusión**. Un conflicto de fusión puede ser resuelto editando el archivo en conflicto. En el ejemplo, necesitaríamos editar File 1 para poder seguir el historial o los cambios que queramos. Después de que esto se ha realizado, simplemente agregue de nuevo, commit de nuevo y después publique sus cambios.
fr_ca: Cependant, dans l'exemple ci-dessus, que se passe-t-il si le fichier 1 a été modifié par les deux branches FeatureA et FeatureB? C'est ce qu'on appelle un **conflit de fusion**. Un conflit de fusion peut être résolu en modifiant le fichier en conflit. Dans l'exemple, nous devons modifier le fichier 1 pour conserver l'historique ou les modifications souhaitées. Après que ceci est accompli, il suffit de rajouter, de faire un Commit, et ensuite un "Push" afin de pousser vos modifications.
tr_tr: Ancak yukarıdaki örnekte, Dosya 1 hem FeatureA hem de FeatureB şubesi tarafından değiştirilmişse ne olur? Buna **birleştirme çakışması** denir. Çakışan dosya düzenlenerek bir birleştirme çakışması çözülebilir. Örnekte, istediğimiz geçmişi veya değişiklikleri saklamak için Dosya 1'i düzenlememiz gerekir. Bundan sonra yapıldı. Yalnızca yeniden ekleyin, yeniden uygulayın ve ardından değişikliklerinizi zorlayın.

source: Resets
fr_ca: Les réinitialisations (Resets)
tr_tr: Sıfırlama

source: Sometimes history needs to be reset, or a commit needs to be undone. This can be done multiple ways.
es_mx: Algunas veces, el historial necesita ser reiniciado, o un commit necesita ser deshecho. Esto puede ser realizado de diferentes maneras.
fr_ca: Parfois, l'historique doit être réinitialisé ou un Commit doit être annulé. Cela peut se faire de plusieurs manières.
tr_tr: Bazen geçmişin sıfırlanması veya bir işlemenin geri alınması gerekir. Bu, birden çok şekilde yapılabilir.

source: Reverting the Commit
es_mx: Convirtiendo el Commit
fr_ca: Revenir en arrière sur un Commit
tr_tr: Kaydetmeyi Geri Döndürme

source: You cannot revert a merge, as git does not know which branch or origin it should choose.
es_mx: No puede revertir una fusión, pues git no sabrá que rama u origen deberá escoger.
fr_ca: Vous ne pouvez pas annuler une fusion, car git ne sait pas quelle branche ou origine il doit choisir.
tr_tr: Git, hangi şubeyi veya menşei seçmesi gerektiğini bilmediği için bir birleştirmeyi geri alamazsınız.

source: To revert history leading up to a commit run ``git revert commit-id``. The commit IDs can be shown using the ``git log`` command.
es_mx: Para revertir el historial que lleva hacia la ejecución de un commit, corra ``git revert commit-id``. Los IDs de commits pueden ser mostrados usando el comando ``git log``.
fr_ca: Pour revenir en arrière sur l'historique menant à un Commit, exécutez ``git revert commit-id``. Les ID de validation peuvent être affichés à l'aide de la commande ``git log``.
tr_tr: Geçmişi geri döndürmek için bir commit çalıştırmasına yol açan ``git revert commit-id``. Commit ID'leri ``git log`` komutu kullanılarak gösterilebilir.

source: Resetting the Head
es_mx: Restaurar el Inicio
fr_ca: La commande de réinitialisation de la tête
tr_tr: Kafayı Sıfırlama

source: Forcibly resetting the head is a dangerous command. It permanently erases all history past the target. You have been warned!
es_mx: Restablecer el inicio a la fuerza, es un comando peligroso. Borra permanentemente todo el historial pasado el objetivo. ¡Ha sido advertido!
fr_ca: Réinitialiser la tête est une commande dangereuse. Elle efface définitivement toute le travail que vous avez accompli, et qui n'a pas été validé (Commit). Vous êtes prévenus!
tr_tr: Kafayı zorla sıfırlamak tehlikeli bir komuttur. Hedefin dışındaki tüm geçmişi kalıcı olarak siler. Uyarıldın!

source: Run: ``git reset --hard commit-id``.
es_mx: Corra: ``git reset --hard commit-id``.
fr_ca: Exécutez: ``git reset --hard commit-id``.
tr_tr: Çalıştır: ``git reset --hard commit-id``.

source: Forks
fr_ca: Fourches
tr_tr: Çatallar

source: Forks can be treated similarly to branches. You can merge the upstream (original repository) into the origin (forked repository).
es_mx: Los forks pueden ser utilizados de manera similar a las ramas. Puede fusionar el upstream (repositorio original) con el origen (forked repositoy).
fr_ca: Les fourches peuvent être traitées de la même manière que les branches. Vous pouvez fusionner le référentiel d'origine, (celui en amont, ou upstream) dans le référentiel fourché (celui d'origine).
tr_tr: Çatallar dallara benzer şekilde tedavi edilebilir. Yukarı akışı (orijinal depo) orijinle (çatallı depo) birleştirebilirsiniz.

source: Cloning an Existing Repo
es_mx: Clonación de un Repositorio Existente
fr_ca: Clonage d’un Dépôt existant
tr_tr: Bir Depoyu Klonlamak

source: In the situation that a repository is already created and stored on a remote, you can clone it using
es_mx: En el caso de que un repositorio ya esté creado y almacenado en un control remoto, puede clonarlo usando
fr_ca: Dans la situation où un dépôt a déjà été créé et stocké dans un serveur distant, vous pouvez le cloner à l’aide
tr_tr: Bir deponun zaten bir uzaktan kumandada yaratılmış ve depolanmış olması durumunda, onu kullanarak klonlayabilirsiniz.

source: where ``myrepo.git`` is replaced with your git repo. If you follow this, you can skip to :ref:commits <docs/software/basic-programming/git-getting-started:Commits>`.
es_mx: donde ``myrepo.git`` se reemplaza con su repositorio de git. Si sigue esto, puede saltar a :ref:commits <docs/software/basic-programming/git-getting-started:Commits>`.
fr_ca: où ``myrepo.git`` est remplacé par votre git repo. Si vous suivez cela, vous pouvez passer à :ref:commits <docs/software/basic-programming/git-getting-started:Commits>`.
tr_tr: ``myrepo.git``, git deponuzla değiştirilir. Bunu takip ederseniz, atlayabilirsiniz :ref:commits <docs/software/basic-programming/git-getting-started:Commits>`.

source: Updating a Fork
es_mx: Actualizar un Fork
fr_ca: Mettre à jour une fourche
tr_tr: Çatal Güncelleme

source: Add the upstream: ``git remote add upstream https://github.com/ORIGINAL_OWNER/ORIGINAL_REPOSITORY.git``
es_mx: Agrege el upstream: `git remote add upstream https://github.com/ORIGINAL_OWNER/ORIGINAL_REPOSITORY.git``
fr_ca: Ajoutez l'amont: ``git remote add upstream https://github.com/ORIGINAL_OWNER/ORIGINAL_REPOSITORY.git``
tr_tr: Yukarı akışı ekleyin: ``git remote add upstream https://github.com/ORIGINAL_OWNER/ORIGINAL_REPOSITORY.git``

source: Confirm it was added via: ``git remote -v``
es_mx: Confirme que se ha agregado a través de ``git remote -v``
fr_ca: Confirmez qu'il a été ajouté via: ``git remote -v``
tr_tr: Eklendiğini onaylayın: ``git remote -v``

source: Pull changes from upstream: ``git fetch upstream``
es_mx: Obtenga los cambios del upstream: ``git fetch upstream``
fr_ca: Faire un "Fetch" sur les changements en amont: ``git fetch upstream``
tr_tr: Yukarı akıştan değişiklikleri çekin: ``git yukarı akış getir``

source: Merge the changes into head: ``git merge upstream/upstream-branch-name``
es_mx: Fusione los cambios con el inicio: ``git merge upstream/upstream-branch-name``
fr_ca: Fusionnez les modifications dans la tête: ``git merge upstream/upstream-branch-name``
tr_tr: Değişiklikleri başlıkta birleştirin: ``git merge upstream / upstream-branch-name``

source: It is extremely important that teams **do not** modify the ``.gitignore`` file that is included with their robot project. This can lead to offline deployment not working.
es_mx: Es extremadamente importante que los equipos **no** modifiquen el archivo ``.gitignore`` que se incluye con su proyecto de robot. Esto puede provocar que la implementación sin conexión no funcione.
fr_ca: Il est extrêmement important que les équipes **ne modifient pas** le fichier ``.gitignore`` qui est intégré dans leur projet de robot. Cela peut conduire à un déploiement hors connexion qui ne fonctionne pas.
tr_tr: Ekiplerin, robot projelerinde bulunan ".gitignore '' dosyasını *değiştirmemeleri* son derece önemlidir. Bu, çevrimdışı dağıtımın çalışmamasına neden olabilir.

source: A ``.gitignore`` file is commonly used as a list of files to not automatically commit with ``git add``. Any files or directory listed in this file will **not** be committed. They will also not show up with `git status <https://git-scm.com/docs/git-status>`_.
es_mx: Un archivo ``.gitignore`` se usa comúnmente como una lista de archivos para no confirmar automáticamente con ``git add``. Cualquier archivo o directorio listado en este archivo **no** se confirmará. Tampoco aparecerán con `git status <https://git-scm.com/docs/git-status>`_.
fr_ca: Un fichier ``.gitignore`` est couramment utilisé comme liste de fichiers à ne pas valider automatiquement avec ``git add``. Tous les fichiers ou répertoires énumérés dans ce fichier ne seront pas validés. Ils ne s'afficheront pas non plus avec la commande `git status <https://git-scm.com/docs/git-status>`_.
tr_tr: Bir ``.gitignore`` dosyası, genellikle ``git add`` ile otomatik olarak işlenmeyecek dosyaların listesi olarak kullanılır. Bu dosyada listelenen herhangi bir dosya veya dizin *işlenmeyecektir*. Ayrıca `git status <https://git-scm.com/docs/git-status>` _ ile görünmeyecekler.

source: Additional Information can be found `here <https://www.atlassian.com/git/tutorials/saving-changes/gitignore>`__
es_mx: Información adicional puede ser encontrada `aquí <https://www.atlassian.com/git/tutorials/saving-changes/gitignore>`_
fr_ca: Des informations supplémentaires peuvent être trouvées `ici <https://www.atlassian.com/git/tutorials/saving-changes/gitignore>`__
tr_tr: Ek Bilgiler `burada <https://www.atlassian.com/git/tutorials/saving-changes/gitignore> `__ bulunabilir

source: Hiding a Folder
es_mx: Ocultar una Carpeta
fr_ca: Masquer un dossier
tr_tr: Bir Klasörü Gizleme

source: Simply add a new line containing the folder to hide, with a forward slash at the end
es_mx: Simplemente añada una nueva línea que contenga la carpeta a ocultar, con una diagonal al final
fr_ca: Ajoutez simplement une nouvelle ligne contenant le dossier à cacher, avec une barre oblique à la fin
tr_tr: Sonunda eğik çizgi ile gizlenecek klasörü içeren yeni bir satır eklemeniz yeterlidir

source: EX: ``directory-to-exclude/``
es_mx: EJ: ``directory-to-exclude/``
fr_ca: EX: ``répertoire à exclure/``
tr_tr: EX: `` dışlanacak dizin /``

source: Hiding a File
es_mx: Ocultar un Archivo
fr_ca: Masquer un fichier
tr_tr: Bir Dosyayı Gizlemek

source: Add a new line with the name of the file to hide, including any prepending directory relative to the root of the repository.
es_mx: Añada una nueva línea con el nombre del archivo a ocultar, incluyendo algún directorio pre-pendiente relativo a la raíz del repositorio.
fr_ca: Ajoutez une nouvelle ligne avec le nom du fichier à masquer, y compris tout répertoire précédant de la racine du référentiel.
tr_tr: Deponun köküne göre ön bekleyen dizinler de dahil olmak üzere, gizlenecek dosyanın adını içeren yeni bir satır ekleyin.

source: EX: ``directory/file-to-hide.txt``
es_mx: EJ: ``directory/file-to-hide.txt``
fr_ca: EX: ``répertoire/fichier-à-cacher.txt``
tr_tr: EX: ``dizin / dosyadan-gizlenecek.txt``

source: Additional Information
es_mx: Información adicional
fr_ca: Information additionnelle
tr_tr: ek bilgi

source: A much more in-depth tutorial can be found at the official `git <https://git-scm.com/docs/gittutorial>`__ website.
es_mx: Un tutorial mucho más a fondo puede ser encontrado en el sitio web official de `git <https://git-scm.com/docs/gittutorial>`__ website.
fr_ca: Un didacticiel beaucoup plus approfondi peut être trouvé sur le site officiel de `git <https://git-scm.com/docs/gittutorial>`__.
tr_tr: Resmi `git <https://git-scm.com/docs/gittutorial>` __ web sitesinde çok daha ayrıntılı bir eğitim bulunabilir.

source: A guide for correcting common mistakes can be found at the git `flight rules <https://github.com/k88hudson/git-flight-rules/blob/master/README.md>`_ repository.
es_mx: Una guía para corregir los errores comunes puede ser encontrada en el repositorio de `reglas de vuelo<https://github.com/k88hudson/git-flight-rules/blob/master/README.md>`_ repository.
fr_ca: Un guide pour corriger les erreurs courantes se trouve dans le dépôt git `flight rules <https://github.com/k88hudson/git-flight-rules/blob/master/README.md>`_
tr_tr: Yaygın hataları düzeltmek için bir kılavuz, git `uçuş kuralları <https://github.com/k88hudson/git-flight-rules/blob/master/README.md>`_ havuzunda bulunabilir.

source: Run: ``git pull``
es_mx: Corra: ``git pull``
tr_tr: Çalıştır: ``git pull``

source: EX: ``file-to-hide2.txt``
es_mx: EJ: ``file-to-hide2.txt``
tr_tr: EX: ``dosya-to-hide2.txt``
