Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/basic-programming/git-getting-started.po
Languages: es_mx, fr_ca, tr_tr

source: Git Version Control Introduction
es_mx: Introducción del Control de la Versión Git
fr_ca: Introduction au contrôle de version Git
tr_tr: Git Sürüm Kontrolüne Giriş

source: A more in-depth guide on Git is available on the `Git website <https://git-scm.com/book/en/v2>`__.
es_mx: Una guía a mayor profundidad se encuentra disponible en el `sitio Web Git <https://git-scm.com/book/en/v2>`__.
fr_ca: Un guide plus détaillé sur Git est disponible sur le site Web de `Git <https://git-scm.com/book/en/v2>`__.

source: `Git <https://git-scm.com/about>`_ is a Distributed Version Control System (VCS) created by Linus Torvalds, also known for creating and maintaining the Linux kernel. Version Control is a system for tracking changes of code for developers. The advantages of Git Version Control are:
es_mx: `Git <https://git-scm.com/about>`_ es un sistema de control de versiones distribuido (VCS) creado por Linus Torvalds, también conocido por crear y mantener el kernel de Linux. Version Control es un sistema de seguimiento de cambios de código para desarrolladores. Las ventajas de Git Version Control son:
fr_ca: `Git <https://git-scm.com/about>`_ est un système de gestion de versions distribuée (VCS) créé par Linus Torvalds, également connu pour la création et la maintenance du noyau Linux. Un système de gestion de versions est un système de suivi des modifications de code pour les développeurs. Les avantages du système de gestion de versions Git sont les suivants:
tr_tr: `Git <https://git-scm.com/about>`_, Linus Torvalds tarafından oluşturulan ve Linux çekirdeğini oluşturmak ve sürdürmekle de bilinen bir Dağıtılmış Sürüm Kontrol Sistemidir (VCS). Sürüm Kontrolü, geliştiriciler için kod değişikliklerini izlemek için bir sistemdir. Git Sürüm Kontrolünün avantajları şunlardır:

source: Separate testing environments into *branches*
es_mx: Separar los ambientes de pruebas en *ramas*
fr_ca: Il sépare les environnements de test en *branches*
tr_tr: Test ortamlarını *şubelere* ayırın

source: Ability to navigate to a particular *commit* without removing history
es_mx: Habilidad de navegar a un *commit* particular sin remover el historial
fr_ca: Il offre la possibilité de naviguer vers un *commit* particulier sans supprimer l'historique
tr_tr: Geçmişi silmeden belirli bir *işlemeye* gitme yeteneği

source: Ability to manage *commits* in various ways, including combining them
es_mx: Habilidad para administrar commits de distintas formas, incluso combinándolos
fr_ca: Il offre la capacité à gérer *les commits* de différentes manières, y compris en les combinant
tr_tr: *Taahhütleri* çeşitli şekillerde, bunları birleştirmek de dahil olmak üzere yönetme yeteneği

source: Various other features, see `here <https://git-scm.com/about>`__
es_mx: Para ver más características, da `click aquí <https://git-scm.com/about>`__
fr_ca: Et comporte diverses autres fonctionnalités, voir `ici <https://git-scm.com/about>`__
tr_tr: Çeşitli diğer özellikler, bkz. `here <https://git-scm.com/about>`__

source: Prerequisites
es_mx: Prerrequisitos
fr_ca: Conditions préalables
tr_tr: Önkoşullar

source: This tutorial uses the Windows operating system
es_mx: En el tutorial se utiliza el sistema operativo Windows.
fr_ca: Ce didacticiel utilise le système d'exploitation Windows
tr_tr: Bu eğitici Windows işletim sistemini kullanır

source: You have to download and install Git from the following links:
es_mx: Para descargar e instalar Git utilize los siguientes links:
fr_ca: Vous devez télécharger et installer Git à partir des liens suivants:
tr_tr: Git'i aşağıdaki bağlantılardan indirip kurmanız gerekir:

source: You may need to add Git to your `path <https://www.google.com/search?q=adding+git+to+path>`__
es_mx: Es probable que necesite añadir Git a su `ruta <https://www.google.com/search?q=adding+git+to+path>`__
fr_ca: Vous devrez peut-être ajouter Git à votre `chemin de répertoire <https://www.google.com/search?q=adding+git+to+path>`__
tr_tr: `<https://www.google.com/search?q=adding+git+to+path>`__ yolunuza Git eklemeniz gerekebilir

source: Git Vocabulary
es_mx: Vocabulario Git
fr_ca: Le vocabulaire Git
tr_tr: Git Kelime Bilgisi

source: Git revolves around several core commands:
es_mx: Git gira entorno a distintos comandos principales:
fr_ca: Git s'articule autour de plusieurs commandes principales: (N.D.T. La commande en anglais est suivie de sa traduction en français entre parenthèses)
tr_tr: Git birkaç temel komut etrafında dönüyor:

source: **Repository:** the data structure of your code, including a ``.git`` folder in the root directory
es_mx: **Repositorio:** la estructura de datos de su código, incluyendo la carpeta ``.git`` en el directorio principal
fr_ca: **Repository (Référentiel de données):** la structure des données de votre code, y compris un dossier ``.git`` dans le répertoire racine
tr_tr: **Repository:** Kök dizindeki ".git '' klasörü dahil kodunuzun veri yapısı

source: **Commit:** a particular saved state of the repository, this includes all files and additions
es_mx: **Commit:** un estado guardado en particular de su repositorio, esto incluye todos los archivos y los añadidos
fr_ca: **Commit (Validé):** un état enregistré particulier du référentiel, cela inclut tous les fichiers et ajouts
tr_tr: **Commit:** havuzun belirli bir kaydedilmiş durumu, bu tüm dosyaları ve eklemeleri içerir

source: **Branch:** a means of separating various commits, having a unique history. This is primarily used for separating development and stable branches.
es_mx: **Branch:** medios de separación de varios commits, teniendo un historial único. Esto es utilizado principalmente para separar ramas en desarrollo y las ramas estables.
fr_ca: **Branch (Branche):** un moyen de séparer les différents Commits, ayant une histoire unique. Ceci est principalement utilisé pour séparer le développement et les branches stables.
tr_tr: **Branch:** benzersiz bir geçmişe sahip çeşitli taahhütleri ayırmanın bir yolu. Bu, öncelikle geliştirme ve kararlı dalları ayırmak için kullanılır.

source: **Push:** update the remote repository with your local changes
es_mx: **Push:** actualiza el repositorio remoto con sus cambios locales
fr_ca: **Push (Pousser):** mettez à jour le référentiel distant avec vos modifications locales
tr_tr: **Push:** uzak depoyu yerel değişikliklerinizle güncelleyin

source: **Pull:** update your local repository with the remote changes
es_mx: **Pull:** actualiza el repositorio local con los cambios remotos
fr_ca: **Pull (Tirer):** mettez à jour votre référentiel local avec les modifications à distance
tr_tr: **Pull:** Yerel deponuzu uzaktan değişikliklerle güncelleyin

source: **Clone:** retrieving a local copy of a repository to modify
es_mx: **Clone:** recupera una copia local de un repositorio a modificar
fr_ca: **Clone (Cloner):** récupération d'une copie locale d'un référentiel pour fins de le modifier
tr_tr: **Clone:** değiştirmek için bir deponun yerel bir kopyasını alma

source: **Fork:** duplicating a pre-existing repository to modify, and to compare against the original
es_mx: **Fork:** duplica un repositorio pre-existente a modificar, y lo compara con el original
fr_ca: **Fork (Fourche):** duplication d'un référentiel préexistant à modifier et à comparer avec l'original
tr_tr: **Fork:** önceden var olan bir depoyu değiştirmek ve orijinaliyle karşılaştırmak için çoğaltmak.

source: **Merge:** combining various changes from different branches/commits/forks into a single history
es_mx: Merge: combina varios cambios de diferentes ramas/commits/forks en un solo historial
fr_ca: **Fusion:** combinant divers changements de différentes branches / validations / fourchettes en un seul historique
tr_tr: **Merge:** farklı dallardan / taahhütlerden / çatallardan çeşitli değişiklikleri tek bir geçmişte birleştirir

source: Repository
es_mx: Repositorio
fr_ca: Le Référentiel de données
tr_tr: Depo

source: A Git repository is a data structure containing the structure, history, and files of a project.
es_mx: Un repositorio de Git es una estructura de datos que contiene la estructura, historial, y archivos de un proyecto.
fr_ca: Un référentiel Git est une structure de données contenant la structure, l'historique et les fichiers d'un projet.
tr_tr: Git deposu, bir projenin yapısını, geçmişini ve dosyalarını içeren bir veri yapısıdır.

source: Git repositories usually consist of:
es_mx: Los repositorios de Git usualmente están conformados por:
fr_ca: Les référentiels Git comprennent généralement:
tr_tr: Git depoları genellikle şunlardan oluşur:

source: A ``.git`` folder. This folder contains the various information about the repository.
es_mx: Una carpeta ``.git``. Esta carpeta contiene diversa información sobre el repositorio.
fr_ca: Un dossier ``.git``. Ce dossier contient les différentes informations sur le référentiel.
tr_tr: Bir ``.git`` klasörü. Bu klasör arşivle ilgili çeşitli bilgileri içerir.

source: A ``.gitignore`` file. This file contains the files or directories that you do *not* want included when you commit.
es_mx: Un archivo ``.gitignore``. Este archivo contiene los archivos o directorios que *no* quiera incluir cuando actualice el repositorio (commit).
fr_ca: Un fichier ``.gitignore``. Ce fichier contient les fichiers ou répertoires que vous ne voulez *pas* inclure lors de la validation.
tr_tr: Bir ``.gitignore`` dosyası. Bu dosya, kaydettiğinizde dahil edilmesini *istemediğiniz* dosyaları veya dizinleri içerir.

source: Files and folders. This is the main content of the repository.
es_mx: Archivos y carpetas. Este es el contenido principal del repositorio.
fr_ca: Fichiers et dossiers. Il s'agit du contenu principal du référentiel.
tr_tr: Dosyalar ve Klasörler. Bu, deponun ana içeriğidir.

source: Creating the repository
es_mx: Crear un repositorio
fr_ca: Création du Référentiel de données
tr_tr: Depoyu oluşturma

source: You can store the repository locally, or through a remote. A remote being the cloud, or possibly another storage medium that hosts your repository. `GitHub <https://github.com/>`_ is a popular free hosting service. Numerous developers use it, and that's what this tutorial will use.
es_mx: Puede almacenar el repositorio localmente o de forma remota. Un control remoto es la nube, o posiblemente otro medio de almacenamiento que aloja su repositorio. `GitHub <https://github.com/>`_ es un popular servicio de alojamiento gratuito. Numerosos desarrolladores lo usan, y eso es lo que usará este tutorial.
fr_ca: Vous pouvez stocker le repertoire localement ou dans un serveur distant. Ce serveur distant étant le cloud, ou peut-être un autre support de stockage qui héberge votre repertoire. `GitHub <https://github.com/>`_ est un service d’hébergement gratuit populaire. De nombreux développeurs l’utilisent, et c’est ce que ce tutoriel va utiliser.
tr_tr: Depoyu yerel olarak veya bir uzaktan kumanda aracılığıyla depolayabilirsiniz. Uzak, bulut veya muhtemelen deponuzu barındıran başka bir depolama ortamıdır. `GitHub <https://github.com/>` _ popüler bir ücretsiz barındırma hizmetidir. Çok sayıda geliştirici kullanıyor ve bu eğitimin kullanacağı şey bu.

source: There are various providers that can host repositories. `Gitlab <https://about.gitlab.com>`_ and `Bitbucket <https://bitbucket.org/>`_ are a few alternatives to Github.
es_mx: Hay varios proveedores que pueden ofrecer repositorios. `Gitlab <https://about.gitlab.com>`_ y `Bitbucket <https://bitbucket.org/>`_ son algunas alternativas a Github.
fr_ca: Il existe différents fournisseurs qui peuvent héberger des dépôts. `Gitlab <https://about.gitlab.com>`_ et `Bitbucket <https://bitbucket.org/>`_ sont quelques alternatives à Github.

source: Creating a GitHub Account
es_mx: Crear una cuenta de GitHub
fr_ca: Création d’un compte GitHub
tr_tr: GitHub Hesabı Oluşturma

source: Go ahead and create a GitHub account by visiting the `website <https://github.com>`_ and following the own screen prompts.
es_mx: Continúe y cree una cuenta de GitHub visitando el `sitio web <https://github.com>`_ y siguiendo las instrucciones de la pantalla.
fr_ca: Allez-y et créez un compte GitHub en visitant le `site Web <https://github.com>`_ et en suivant les propres invites d’écran.
tr_tr: Devam edin ve `<https://github.com>` _ web sitesini ziyaret ederek ve kendi ekran komutlarını izleyerek bir GitHub hesabı oluşturun.

source: Local Creation
es_mx: Creación Local
fr_ca: Création locale
tr_tr: Yerel Yaratılış

source: After creating and verifying your account, you'll want to visit the homepage. It'll look similar to the shown image.
es_mx: Después de crear y verificar su cuenta, querrá visitar la página de inicio. Se verá similar a lo que muestra la imagen.
fr_ca: Après avoir créé et vérifié votre compte, vous irez ensuite visiter la page d'accueil. Cela ressemblera à l'image montrée ci-dessous.
tr_tr: Hesabınızı oluşturup doğruladıktan sonra ana sayfayı ziyaret etmek isteyeceksiniz. Gösterilen resme benzer görünecek.

source: Click the plus icon in the top right.
es_mx: De clic en el ícono de ``más`` (+) de la esquina superior derecha.
fr_ca: Cliquez sur l'icône "plus", ou + en haut à droite.
tr_tr: Sağ üstteki artı simgesini tıklayın.

source: Then click *"New Repository"*
es_mx: Después de click en *“New Repository”*
fr_ca: Cliquez ensuite sur *"New Repository"*
tr_tr: Sonra *"Yeni Depo"* tıklayın

source: Fill out the appropriate information, and then click *"Create repository"*
es_mx: Llene con la información correspondiente, y después de clic en *“Create repository”*
fr_ca: Remplissez les informations appropriées, puis cliquez sur *"Create repository"*
tr_tr: Uygun bilgileri doldurun ve ardından *"Depo oluştur"* u tıklayın

source: You should see a screen similar to this
es_mx: Debe ver una pantalla similar a esta
fr_ca: Vous devriez voir un écran similaire à celui-ci
tr_tr: Buna benzer bir ekran görmelisiniz

source: The keyboard shortcut :kbd:`Ctrl+~` can be used to open a terminal in Visual Studio Code.
es_mx: El atajo de teclado :kbd:`Ctrl+~` puede usarse para abrir una terminal en Visual Studio Code.
fr_ca: Le raccourci clavier :kbd:`Ctrl+~` peut être utilisé pour ouvrir un terminal sous Visual Studio Code.
tr_tr: Klavye kısayolu :kbd:`Ctrl+~` , Visual Studio Code'da bir terminal açmak için kullanılabilir.

source: Now you'll want to open a PowerShell window and navigate to your project directory. An excellent tutorial on PowerShell can be found `here <https://programminghistorian.org/en/lessons/intro-to-powershell>`__. Please consult your search engine on how to open a terminal on alternative operating systems.
es_mx: Ahora querrá abrir una ventana de PowerShell y navegar al directorio de su proyecto. Se puede encontrar un excelente tutorial sobre PowerShell `aquí <https://programminghistorian.org/en/lessons/intro-to-powershell>`__.. Consulte su motor de búsqueda sobre cómo abrir un terminal en sistemas operativos alternativos.
fr_ca: Vous aimerez à ce point-ci ouvrir une fenêtre PowerShell et accéder à votre répertoire de projets. Un excellent tutoriel sur PowerShell peut être trouvé `ici <https://programminghistorian.org/en/lessons/intro-to-powershell>`__. Veuillez utiliser votre moteur de recherche afin de trouver la façon d’ouvrir un terminal sur les systèmes d’exploitation alternatifs.
tr_tr: Şimdi bir PowerShell penceresi açıp proje dizininize gitmek isteyeceksiniz. PowerShell ile ilgili mükemmel bir öğretici `burada <https://programminghistorian.org/en/lessons/intro-to-powershell>` __ bulunabilir. Lütfen alternatif işletim sistemlerinde bir terminalin nasıl açılacağını öğrenmek için arama motorunuza danışın.

source: If a directory is empty, a file needs to be created in order for git to have something to track. In the below Empty Directory example, we created a file called ``README.md`` with the contents of ``# Example Repo``. For FRC\ |reg| Robot projects, the below Existing Project commands should be run in the root of a project :ref:`created by the VS Code WPILib Project Creator <docs/zero-to-robot/step-4/creating-benchtop-test-program-cpp-java:Creating a New WPILib Project>`. More details on the various commands can be found in the subsequent sections.
es_mx: Si un directorio está vacío, hay que crear un archivo para que git tenga algo que rastrear. En el siguiente ejemplo de directorio vacío, creamos un archivo llamado ``README.md`` con el contenido de ``# Example Repo``. Para los proyectos de robots FRC\ |reg|, los siguientes comandos de Proyectos Existentes deben ser ejecutados en la raíz de un proyecto :ref:`creado por el VS Code WPILib Project Creator <docs/zero-to-robot/paso-4/creación-benchtop-test-programa-cpp-java:Creación de nuevos proyectos WPILib>`. Más detalles sobre los distintos comandos se pueden encontrar en las secciones siguientes.
fr_ca: Si un répertoire est vide, un fichier doit être créé afin de permettre à git d’avoir quelque chose à suivre. Dans l’exemple du repertoire vide ci-dessous, nous avons créé un fichier appelé ``README.md`` avec le contenu de ``# Example Repo``. Pour les projets de robots FRC\ |reg|, les commandes de projet existantes ci-dessous devraient être exécutées à la racine d’un projet :ref:`created by the VS Code WPILib Project Creator <docs/zero-to-robot/step-4/creating-benchtop-test-program-cpp-java:Creating a New WPILib Project>`. D'autres détails sur les différentes commandes peuvent être trouvés dans les sections suivantes.
tr_tr: Bir dizin boşsa, git'in izleyeceği bir şeye sahip olması için bir dosyanın oluşturulması gerekir. Aşağıdaki Boş Dizin örneğinde, ``# Örnek Repo`` içeriği ile ``README.md`` adlı bir dosya oluşturduk. FRC için \ |reg| Robot projeleri, aşağıdaki Mevcut Proje komutları bir projenin kök dizininde çalıştırılmalıdır: ref: `VS Code WPILib Project Creator <docs/zero-to-robot/step-4/creating-benchtop-test-program-cpp-java:Creating a New WPILib Project> tarafından oluşturulmuştu`. Çeşitli komutlarla ilgili daha fazla ayrıntı sonraki bölümlerde bulunabilir.

source: Replace the filepath ``"C:\Users\ExampleUser9007\Documents\Example Folder"`` with the one you want to create the repo in, and replace the remote URL ``https://github.com/ExampleUser9007/ExampleRepo.git`` with the URL for the repo you created in the previous steps.
es_mx: Reemplace la ruta de archivo ``"C:\Users\ExampleUser9007\Documents\Example Folder"`` con la que desea crear el repositorio y reemplace la URL remota ``https://github.com/ExampleUser9007/ExampleRepo.git`` con la URL del repositorio que creó en los pasos anteriores.
fr_ca: Remplacez le chemin d'accès ``"C:\Users\ExampleUser9007\Documents\Example Folder"`` par celui dans lequel vous souhaitez créer le repo, et remplacez l’URL distante ``https://github.com/ExampleUser9007/ExampleRepo.git`` par l’URL du repo que vous avez créé dans les étapes précédentes.
tr_tr: Dosya yolunu değiştirin Replace the filepath ``"C:\Users\ExampleUser9007\Documents\Example Folder"`` repo'yu oluşturmak istediğiniz klasörle ve uzak URL'yi değiştirin. Önceki adımlarda oluşturduğunuz deponun URL'si ile``https://github.com/ExampleUser9007/ExampleRepo.git``.

source: Commits
fr_ca: Les Commits, ou Validés
tr_tr: Kaydetme

source: Repositories are primarily composed of commits. Commits are saved states or *versions* of code.
es_mx: Los repositorios están conformados principalmente por commits. Los commits son estados guardados o versiones de código.
fr_ca: Les référentiels sont principalement composés de Commits. Ceux-ci sont des états enregistrés ou des *versions* de code.
tr_tr: Depolar, öncelikle kayıtlardan oluşur. İşlemler, kaydedilmiş durumlar veya kodun *sürümleridir*.

source: In the previous example, we created a file called README.md. Open that file in your favorite text editor and edit a few lines. After tinkering with the file for a bit, simply save and close. Navigate to PowerShell and type the following commands.
es_mx: En el ejemplo anterior, creamos un archivo llamado README.md. Abra ese archivo en su editor de texto favorito y edite algunas líneas. Después de jugar un poco con el archivo, simplemente guárdelo y ciérrelo. Navegue hasta PowerShell y escriba los siguientes comandos.
fr_ca: Dans l’exemple précédent, nous avons créé un fichier appelé README.md. Ouvrez ce fichier dans votre éditeur de texte préféré et modifiez-en quelques lignes. Après avoir joué avec le fichier pendant un moment, il suffit d’enregistrer et de fermer. Accédez à PowerShell et tapez les commandes suivantes.
tr_tr: Önceki örnekte, README.md adlı bir dosya oluşturduk. Bu dosyayı favori metin düzenleyicinizde açın ve birkaç satırı düzenleyin. Dosyayı biraz düzelttikten sonra kaydedip kapatın. PowerShell'e gidin ve aşağıdaki komutları yazın.

source: Writing good commit messages is a key part of a maintainable project. A guide on writing commit messages can be found `here <https://chris.beams.io/posts/git-commit/>`_.
es_mx: Escribir buenos mensajes de commit es una pieza clave para un proyecto mantenible. Para una guía de cómo escribir mensajes de commit dar click `aquí <https://chris.beams.io/posts/git-commit/>`_.
fr_ca: La rédaction de bons messages explicatifs lors d'un Commit est un élément clé de la maintenance d'un projet qui est écrit par une équipe de programmeurs. Un guide sur l'écriture des messages de Commit peut être trouvé `ici <https://chris.beams.io/posts/git-commit/>`_.
tr_tr: İyi taahhüt mesajları yazmak, sürdürülebilir bir projenin önemli bir parçasıdır. Kaydetme mesajlarının yazılmasına ilişkin bir kılavuz `burada <https://chris.beams.io/posts/git-commit/>` _ bulunabilir.

source: Git Pull
fr_ca: La commande Git Pull
tr_tr: Git Çekme

source: ``git fetch`` can be used when the user does not wish to automatically merge into the current working branch
es_mx: ``git fetch`` puede ser utilizado cuando el usuario no desea que automáticamente se fusione con la rama en la que se está trabajando
fr_ca: ``git fetch`` peut être utilisé lorsque l'utilisateur ne souhaite pas fusionner automatiquement dans la branche de travail actuelle
tr_tr: Kullanıcı otomatik olarak mevcut çalışma dalıyla birleşmek istemediğinde ``git fetch`` kullanılabilir

source: This command retrieves the history or commits from the remote repository. When the remote contains work you do not have, it will attempt to automatically merge. See :ref:`docs/software/basic-programming/git-getting-started:Merging`.
es_mx: Este commando recupera el historial o los commits del repositorio remoto. Cuando el remoto contiene el trabajo que usted no tiene, éste intentará fusionarlo automáticamente. Vea :ref:`docs/software/basic-programming/git-getting-started:Merging`.
fr_ca: Cette commande récupère l'historique ou valide à partir du référentiel distant. Lorsque la télécommande contient du travail que vous n'avez pas, elle tentera de fusionner automatiquement. Voir :ref:`docs/software/basic-programming/git-getting-started:Merging`.
tr_tr: Bu komut, uzak depodan geçmişi veya taahhütleri alır. Uzaktan kumanda, sahip olmadığınız işleri içerdiğinde, otomatik olarak birleştirmeye çalışacaktır. Bakınız: ref:`docs / yazılım / temel-programlama / git-başlarken: Birleştirme`.

source: Git Add
fr_ca: La commande Git Add
tr_tr: Git Ekle

source: This command adds a selected file(s) to a commit. To commit every file/folder that isn't excluded via *gitignore*.
es_mx: Este comando añade el/los archivo(s) seleccionado(s) a un commit. Para hacer commit cada archivo/carpeta que no esté excluido via *gitignore*.
fr_ca: Cette commande ajoute un ou plusieurs fichiers sélectionnés à un Commit. Ceci va valider chaque fichier/dossier , sauf ceux qui sont exclus via *gitignore*.
tr_tr: Bu komut, *gitignore* ile hariç tutulmayan her dosya / klasörü işlemek için, seçilen dosya(ları) bir işleme ekler.
