Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/roborio-network-troubleshooting.po
Languages: fr_ca

source: roboRIO Network Troubleshooting
fr_ca: Dépannage des problèmes réseaux du roboRIO

source: The roboRIO and FRC\ |reg| tools use dynamic IP addresses (DHCP) for network connectivity. This article describes steps for troubleshooting networking connectivity between your PC and your roboRIO
fr_ca: Le roboRIO et le FRC \ | reg | Les outils utilisent des adresses IP dynamiques (DHCP) pour la connectivité réseau. Cet article décrit les étapes de dépannage de la connectivité réseau entre votre PC et votre roboRIO

source: Ping the roboRIO using mDNS
fr_ca: Ping le roboRIO à l'aide de mDNS

source: The first step to identifying roboRIO networking issues is to isolate if it is an application issue or a general network issue. To do this, click **Start -> type cmd -> press Enter** to open the command prompt. Type ``ping roboRIO-####-FRC.local`` where #### is your team number (with no leading zeroes) and press enter. If the ping succeeds, the issue is likely with the specific application, verify your team number configuration in the application, and check your firewall configuration.
fr_ca: La première étape pour identifier les problèmes de réseau du roboRIO est de distinguer s’il s’agit d’un problème d’application ou d’un problème de réseau général. Pour ce faire, cliquez sur **Démarrer -> taper cmd -> appuyez sur Entrée** pour ouvrir l’invite de commandes. Tapez ``ping roboRIO-####-FRC.local`` où #### est votre numéro d’équipe (sans zéros en position de tête) et appuyez sur Entrer. Si l'interrogation ping réussit, le problème est probablement avec l’application spécifique, vérifiez la configuration de votre numéro d’équipe dans l’application et vérifiez votre configuration de pare-feu.

source: Ping the roboRIO IP Address
fr_ca: Envoyez un ping à l'adresse IP du roboRIO

source: If there is no response, try pinging ``10.TE.AM.2`` (:ref:`TE.AM IP Notation <docs/networking/networking-introduction/ip-configurations:TE.AM IP Notation>`) using the command prompt as described above. If this works, you have an issue resolving the mDNS address on your PC. The two most common causes are not having an mDNS resolver installed on the system and a DNS server on the network that is trying to resolve the .local address using regular DNS.
fr_ca: S'il n'y a pas de réponse, essayez d'envoyer une requête ping à `` 10.TE.AM.2 '' (: ref: `TE.AM IP Notation <docs / networking / networking-introduction / ip-configurations: TE.AM IP Notation>`) en utilisant l'invite de commande comme décrit ci-dessus. Si cela fonctionne, vous rencontrez un problème pour résoudre l'adresse mDNS sur votre PC. Les deux causes les plus courantes sont l'absence d'un résolveur mDNS installé sur le système et d'un serveur DNS sur le réseau qui tente de résoudre l'adresse .local à l'aide de DNS standard.

source: Verify that you have an mDNS resolver installed on your system. On Windows, this is typically fulfilled by the NI FRC Game Tools. For more information on mDNS resolvers, see the :ref:`roboRIO Networking article <docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard>`.
fr_ca: Vérifiez que vous disposez d'un résolveur mDNS installé sur votre système. Sous Windows, cela est généralement rempli par les outils de jeu NI FRC. Pour plus d'informations sur les résolveurs mDNS, voir l'article :ref:`roboRIO Networking article <docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard>`.

source: Disconnect your computer from any other networks and make sure you have the OM5P-AN configured as an access point, using the :ref:`FRC Radio Configuration Utility <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`. Removing any other routers from the system will help verify that there is not a DNS server causing the issue.
fr_ca: Déconnectez votre ordinateur de tout autre réseau et assurez-vous que l'OM5P-AN est configuré comme point d'accès, à l'aide de :ref: `FRC Radio Configuration Utility <docs / zero-to-robot / step-3 / radio-programmation: Programming votre radio> `. La suppression de tout autre routeur du système permettra de vérifier qu'aucun serveur DNS n'est à l'origine du problème.

source: Ping Fails
fr_ca: Si le Ping échoue

source: If pinging the IP address directly fails, you may have an issue with the network configuration of the PC. The PC should be configured to **Automatic**. To check this, click :guilabel:`Start` -> :guilabel:`Settings` -> :guilabel:`Network & Internet`. Depending on your network, select :guilabel:`Wifi` or :guilabel:`Ethernet`. Then click on your connected network. Scroll down to **IP settings** and click :guilabel:`Edit` and ensure the :guilabel:`Automatic (DHCP)` option is selected.
fr_ca: Si la commande ping de l'adresse IP échoue, vous pouvez avoir un problème avec la configuration réseau du PC. Le PC doit être configuré sur ** Automatique **. Pour vérifier cela, cliquez sur: :guilabel:`Start` -> :guilabel:`Settings` -> :guilabel:`Network & Internet`. En fonction de votre réseau, sélectionnez :guilabel:`Wifi` ou :guilabel:`Ethernet`. Cliquez ensuite sur votre réseau connecté. Faites défiler jusqu'à **IP settings** et cliquez sur :guilabel:`Edit` et assurez-vous que l'option :guilabel:`Automatic (DHCP)` est sélectionnée.

source: If pinging the IP address directly fails, you may have an issue with the network configuration of the PC. The PC should be configured to **Obtain an Address Automatically** (also known as DHCP). To check this, click :guilabel:`Start` -> :guilabel:`Control Panel` -> :guilabel:`Network Connections` -> :guilabel:`Change adapter settings`, then right click on the appropriate interface (usually Local Area Connection for Ethernet or Wireless Network Connection for wireless) and select :guilabel:`Properties`. Click :guilabel:`Internet Protocol Version 4`, then click :guilabel:`Properties`. Make sure both radio buttons are set to :guilabel:`Obtain automatically`.
fr_ca: Si la requête ping de l'adresse IP échoue, vous pouvez avoir un problème avec la configuration réseau du PC. Le PC doit être configuré pour **Obtain an Address Automatically** (également appelé DHCP). Pour vérifier cela, cliquez sur :guilabel:`Start` -> :guilabel:`Control Panel` -> :guilabel:`Network Connections` -> :guilabel:`Change adapter settings` Modifier les paramètres de l'adaptateur`, puis cliquez avec le bouton droit sur l'interface appropriée (généralement "Local Area Connection" pour Ethernet ou "Wireless Network Connection" pour sans fil) et sélectionnez :guilabel:`Properties`. Cliquez :guilabel:`Internet Protocol Version 4`, et ensuite :guilabel:`Properties`. Assurez-vous que les deux boutons radio sont réglés sur :guilabel:`Obtain automatically`.

source: USB Connection Troubleshooting
fr_ca: Dépannage de la connexion USB

source: If you are attempting to troubleshoot the USB connection, try pinging the roboRIO's IP address. As long as there is only one roboRIO connected to the PC, it should be configured as 172.22.11.2. If this ping fails, make sure you have the roboRIO connected and powered, and that you have installed the NI FRC Game Tools. The game tools installs the roboRIO drivers needed for the USB connection.
fr_ca: Si vous essayez de résoudre le problème de la connexion USB, essayez une interrogation ping de l’adresse IP du roboRIO. Tant qu’il n’y a qu’un seul roboRIO connecté au PC, il doit être configuré à 172.22.11.2. Si ce cette interrogation ping échoue, assurez-vous d’avoir le roboRIO connecté et alimenté, et que vous avez installé les outils NI FRC Game Tools. Les outils de jeu installent les pilotes roboRIO nécessaires à la connexion USB.

source: If this ping succeeds, but the .local ping fails, it is likely that either the roboRIO hostname is configured incorrectly, or you are connected to a DNS server which is attempting to resolve the .local address.
fr_ca: Si ce ping réussit, mais que le ping .local échoue, il est probable que le nom d’hôte roboRIO soit configuré incorrectement, soit que vous soyez connecté à un serveur DNS qui tente de résoudre l’adresse .local.

source: Verify that your roboRIO has been :ref:`imaged for your team number <docs/zero-to-robot/step-3/imaging-your-roborio:Imaging your roboRIO>`. This sets the hostname used by mDNS.
fr_ca: Vérifiez que votre roboRIO a été :ref: `imagé pour votre numéro d'équipe <docs / zero-to-robot / step-3 / imaging-your-roborio: Imaging your roboRIO>`. Ceci définit le nom d'hôte utilisé par mDNS.

source: Ethernet Connection
fr_ca: Connexion Ethernet

source: If you are troubleshooting an Ethernet connection, it may be helpful to first make sure that you can connect to the roboRIO using the USB connection. Using the USB connection, open the :ref:`roboRIO webdashboard <docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard>` and verify that the roboRIO has an IP address on the ethernet interface. If you are tethering to the roboRIO directly this should be a self-assigned ``169.*.*.*`` address, if you are connected to the OM5P-AN radio, it should be an address of the form ``10.TE.AM.XX`` where TEAM is your four digit FRC team number. If the only IP address here is the USB address, verify the physical roboRIO ethernet connection.
fr_ca: Si vous dépannez une connexion Ethernet, il peut être utile de s’assurer d’abord que vous pouvez vous connecter au roboRIO à l’aide de la connexion USB. À l’aide de la connexion USB, ouvrez le :ref:`roboRIO webdashboard <docs/software/roborio-info/roborio-web-dashboard:roboRIO Web Dashboard>` et vérifiez que le roboRIO a une adresse IP sur l’interface ethernet. Si vous directement connecté au roboRIO cette adresse doit être auto-assignée à ``169.*.*.*``, si vous êtes connecté à la radio OM5P-AN, il doit s’agir d’une adresse de la forme ``10.TE.AM.XX`` où TEAM est votre numéro d’équipe FRC à quatre chiffres. Si la seule adresse IP ici est l’adresse USB, vérifiez la connexion ethernet physique du roboRIO .

source: Disabling Network Adapters
fr_ca: Désactivation des adaptateurs réseau

source: This is not always the same as turning the adapters off with a physical button or putting the PC into airplane mode. The following steps provide more detail on how to disable adapters.
fr_ca: Ce n'est pas toujours la même chose que d'éteindre les adaptateurs avec un bouton physique ou de mettre le PC en mode avion. Les étapes suivantes fournissent plus de détails sur la désactivation des adaptateurs.

source: Open the Settings application by clicking on the settings icon.
fr_ca: Ouvrez l'application Paramètres en cliquant sur l'icône des paramètres.

source: Choose the :guilabel:`Network & Internet` category.
fr_ca: Choisissez la catégorie :guilabel: `Réseau et Internet`.

source: Click on :guilabel:`Change adapter options`.
fr_ca: Cliquez sur :guilabel: `Changer les options de l'adaptateur`.

source: Open the Control Panel by going to :guilabel:`Start` -> :guilabel:`Control Panel`
fr_ca: Ouvrez le Panneau de configuration en allant dans :guilabel: `Démarrer` -> :guilabel:` Panneau de configuration`

source: Choose the :guilabel:`Network and Internet` category.
fr_ca: Choisissez la catégorie :guilabel: `Réseau et Internet`.

source: Click :guilabel:`Network and Sharing Center`
fr_ca: Cliquez sur :guilabel: `Centre Réseau et partage`

source: On the left pane, click :guilabel:`Change Adapter Settings`.
fr_ca: Dans le volet gauche, cliquez sur :guilabel: `Modifier les paramètres de l'adaptateur`.

source: For each adapter other than the one connected to the radio, right click on the adapter and select :guilabel:`Disable` from the menu.
fr_ca: Pour chaque adaptateur autre que celui connecté à la radio, faites un clic droit sur l'adaptateur et sélectionnez :guilabel: `Désactiver` dans le menu.

source: Proxies. Having a proxy enabled may cause issues with the roboRIO networking.
fr_ca: Proxies. Le fait d’avoir un proxy activé peut causer des problèmes avec le réseau du roboRIO.
