Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-3/imaging-your-roborio.po
Languages: es_mx

source: Imaging your roboRIO
es_mx: Creando la imagen de su roboRIO

source: Before imaging your roboRIO, you must have completed installation of the :doc:`FRC Game Tools</docs/zero-to-robot/step-2/frc-game-tools>`. You also must have the roboRIO power properly wired to the Power Distribution Panel. Make sure the power wires to the roboRIO are secure and that the connector is secure firmly to the roboRIO (4 total screws to check).
es_mx: Antes de crear la imagen de su roboRIO, debe haber completado la instalación de :doc:`FRC Game Tools </docs/zero-to-robot/step-2/frc-game-tools>`. También debe tener la alimentación de energía de la roboRIO debidamente conectada al panel de distribución de energía o PDP. Asegúrese de que los cables de alimentación de la roboRIO estén seguros y de que el conector esté firmemente asegurado a la roboRIO (4 tornillos en total para verificar).

source: An issue was discovered with the roboRIO image version 2021_v3.1 included in the initial release of the 2021 NI Game Tools that prevents successful imaging of roboRIOs. Teams that downloaded the installer prior to the morning of January 11, 2021 should :doc:`re-download and re-install</docs/zero-to-robot/step-2/frc-game-tools>` the latest installer (no need to uninstall first). The new version is 2021 f1. Users with the correct version installed will not see 2021_v3.1 as an option in the roboRIO imaging tool.
es_mx: Se ha descubierto un problema con la versión 2021_v3.1 de la imagen de roboRIO incluida en la versión inicial de las Herramientas de Juego 2021 de NI que impide la creación de imágenes de roboRIO con éxito. Los equipos que descargaron el instalador antes de la mañana del 11 de enero de 2021 deben :doc:`volver a descargar y reinstalar</docs/zero-to-robot/step-2/frc-game-tools>` el último instalador (no es necesario desinstalar primero). La nueva versión es 2021 f1. Los usuarios con la versión correcta instalada no verán 2021_v3.1 como opción en la herramienta de creación de imágenes de roboRIO.

source: Configuring the roboRIO
es_mx: Configurar la roboRIO

source: The roboRIO Imaging Tool will be used to image your roboRIO with the latest software.
es_mx: La herramienta de imágenes roboRIO se utilizará para crear imágenes de su roboRIO con el software más reciente.

source: USB Connection
es_mx: Conexión USB

source: Connect a USB cable from the roboRIO USB Device port to the PC. This requires a USB Type A male (standard PC end) to Type B male cable (square with 2 cut corners), most commonly found as a printer USB cable.
es_mx: Conecte un cable USB desde el puerto del dispositivo USB roboRIO a la PC. Esto requiere un cable USB tipo A macho (extremo de PC estándar) a tipo B macho (cuadrado con 2 esquinas cortadas), que se encuentra más comúnmente como cable USB de impresora.

source: The roboRIO should only be imaged via the USB connection. It is not recommended to attempt imaging using the Ethernet connection.
es_mx: La imagen de la roboRIO solo debe realizarse a través de la conexión USB. No se recomienda intentar obtener imágenes utilizando la conexión Ethernet.

source: Driver Installation
es_mx: Instalación del controlador

source: The device driver should install automatically. If you see a "New Device" pop-up in the bottom right of the screen, wait for the driver install to complete before continuing.
es_mx: El controlador del dispositivo debería instalarse automáticamente. Si ve la ventana emergente "Nuevo dispositivo" en la parte inferior derecha de la pantalla, espere a que se complete la instalación del controlador antes de continuar.

source: Launching the Imaging Tool
es_mx: Iniciar la herramienta de imágenes

source: The roboRIO imaging tool and latest image are installed with the NI FRC\ |reg| Game Tools. Launch the imaging tool by double clicking on the shortcut on the Desktop. If you have difficulties imaging your roboRIO, you may need to try right-clicking on the icon and selecting Run as Administrator instead.
es_mx: La herramienta de generación de imágenes roboRIO y la última imagen se instalan con NI FRC\|reg| Game Tools. Inicie la herramienta de imágenes haciendo doble clic en el acceso directo del escritorio. Si tiene dificultades para crear imágenes de su roboRIO, es posible que deba intentar hacer clic con el botón derecho en el icono y seleccionar Ejecutar como administrador.

source: The roboRIO imaging tool is also located at ``C:\Program Files (x86)\National Instruments\LabVIEW YYYY\project\roboRIO Tool`` where YYYY is the current year - 1. If it's 2020, the directory would be ``LabVIEW 2019``.
es_mx: La herramienta de imagen roboRIO también se encuentra en ``C:\Program Files (x86)\National Instruments\LabVIEW YYYY\project\roboRIO Tool`` donde YYYY es el año actual - 1. Si es 2020, el directorio sería ``LabVIEW 2019``.

source: roboRIO Imaging Tool
es_mx: Herramienta de imágenes roboRIO

source: After launching, the roboRIO Imaging Tool will scan for available roboRIOs and indicate any found in the top left box. The bottom left box will show information and settings for the roboRIO currently selected. The right hand pane contains controls for modifying the roboRIO settings:
es_mx: Despúes de inciarla, la roboRIO Imaging Tool buscará roboRIOs e indicará los que se encuentran disponibles en el cuadro superior izquierdo. El cuadro inferior izquierdo mostrará información y configuraciones para el roboRIO actualmente seleccionado. El panel derecho contiene controles para modificar la configuración de roboRIO:

source: **Edit Startup Settings** - This option is used when you want to configure the startup settings of the roboRIO (the settings in the right pane), without imaging the roboRIO.
es_mx: **Edit Startup Settings** - Esta opción se usa cuando quiere ajustar las configuraciones iniciales del roboRIO (los ajustes en el panel derecho), sin configurar en sí el roboRIO.

source: **Format Target** - This option is used when you want to load a new image on the roboRIO (or reflash the existing image). This is the most common option.
es_mx: **Format Target** - Esta opción es usada cuando se quiere subir una imagen en la roboRIO (o volver a cargar una imagen existente). Esta es la opción más común.

source: **Update Firmware** - This option is used to update the roboRIO firmware. For this season, the imaging tool will require roboRIO firmware to be version 5.0 or greater.
es_mx: **Update Firmware** - Esta opción es usada para actualizar el firmware del roboRIO. Para esta temporada, la herramienta de imagen requerirá que el firmware del roboRIO sean versión 5.0 o superior.

source: Updating Firmware
es_mx: Actualizando el Firmware

source: roboRIO firmware must be at least v5.0 to work with the 2019 or later image. If your roboRIO is at least version 5.0 (as shown in the bottom left of the imaging tool) you do not need to update.
es_mx: El firmware de roboRIO debe ser al menos v5.0 para funcionar con la imagen de 2019 o posterior. Si su roboRIO es al menos la versión 5.0 (como se muestra en la parte inferior izquierda de la herramienta de imágenes), no necesita actualizar.

source: To update roboRIO firmware:
es_mx: Para actualizar el firmware de la roboRIO:

source: Make sure your roboRIO is selected in the top left pane.
es_mx: Asegúrese que su roboRIO esté seleccionada en el panel superior izquierdo.

source: Select Update Firmware in the top right pane
es_mx: Seleccione Update Firmware en el panel superior derecho

source: Enter a team number in the Team Number box
es_mx: Ingrese un número de equipo en el cuadro de Team Number

source: Select the latest firmware file in the bottom right
es_mx: Seleccione el archivo de firmware más reciente en la parte inferior derecha

source: Click the **Update** button
es_mx: Haga clic en el botón **Update**

source: Imaging the roboRIO
es_mx: Configurando la imagen de su roboRIO

source: Make sure the roboRIO is selected in the top left pane
es_mx: Asegúrese que la roboRIO está seleccionado en el panel superior izquierdo

source: Select Format Target in the right pane
es_mx: Seleccione Format Target en el panel derecho

source: Enter your team number in the box
es_mx: Ingrese el numero del equipo en el cuadro

source: Select the latest image version in the box.
es_mx: Seleccione la imagen con la versión más reciente en el cuadro.

source: Click Reformat to begin the imaging process.
es_mx: Haga clic en Reformat para iniciar el proceso de configuración.

source: Imaging Progress
es_mx: Proceso de Configuración

source: The imaging process will take approximately 3-10 minutes. A progress bar in the bottom left of the window will indicate progress.
es_mx: El proceso de configuración tomará aproximadamente 3-10 minutos. Una barra de progreso en la parte inferior izquierda de la ventana indicará el progreso.

source: Imaging Complete
es_mx: Configuración Completada

source: When the imaging completes you should see the dialog above. Click Ok, then click the Close button at the bottom right to close the imaging tool. Reboot the roboRIO using the Reset button to have the new team number take effect.
es_mx: Cuando la configuración se complete debería aparecer el mensaje anterior. Haga clic en OK, después haga clic en el botón Close en la parte inferior derecha para cerrar la imaging tool. Reinicie el roboRIO con el botón Reset para que el nuevo número de equipo surta efecto.

source: The default CAN webdash functionality has been removed from the image (CAN devices will still work from robot code). You will need to use the tools provided by individual vendors to service their CAN devices.
es_mx: La función por default de la CAN webdash ha sido removida de la imagen (los dispositivos CAN seguirán funcionando desde el código del robot). Deberá utilizar las herramientas proporcionadas por proveedores individuales para dar servicio a sus dispositivos CAN.

source: Troubleshooting
es_mx: Solución de problemas

source: If you are unable to image your roboRIO, troubleshooting steps include:
es_mx: Si no puede configurar su roboRIO, los pasos para solución de problemas incluyen:

source: Try running the roboRIO Imaging Tool as Administrator by right-clicking on the Desktop icon to launch it.
es_mx: Intente ejecutar la roboRIO Imaging Tool como Administrador haciendo clic derecho en el ícono del Escritorio para iniciarlo.

source: Try accessing the roboRIO webpage with a web-browser at ``http://172.22.11.2/`` and/or verify that the NI network adapter appears in your list of Network Adapters in the Control Panel. If not, try re-installing the NI FRC Game Tools or try a different PC.
es_mx: Intente accesando la página web del roboRIO con un navegador web en ``http://172.22.11.2/`` y/o verifique que el adaptador de red NI aparezca en su lista de Adaptadores de Red en el Panel de Control. Si no, intente reinstalar las NI FRC Game Tools o pruebe en una PC diferente.

source: :ref:`Disable all other network adapters <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`
es_mx: :ref:`Deshabilite todos los demás adaptadores de red <docs/networking/networking-introduction/roborio-network-troubleshooting:Disabling Network Adapters>`

source: Make sure your firewall is turned off.
es_mx: Asegúrese que su firewall esté apagado.

source: Some teams have experienced an issue where imaging fails if the device name of the computer you're using has a dash (``-``) in it. Try renaming the computer (or using a different PC).
es_mx: Algunos equipos han experimentado un problema donde la configuración falla si el nombre del dispositivo de la computadora tiene un guión (``-``) en él. Intente renombrando la computadora (o usando una PC diferente).

source: Try booting the roboRIO into Safe Mode by pressing and holding the reset button for at least 5 seconds.
es_mx: Intente arrancar la roboRIO en Modo Seguro manteniendo presionado el botón de reinicio durante al menos 5 segundos.

source: Try a different PC
es_mx: Intente con una computadora diferente
