Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/can-devices/third-party-devices.po
Languages: es_mx

source: Third-Party CAN Devices
es_mx: Dispositivos CAN de terceros

source: A number of FRC\ |reg| vendors offer their own CAN peripherals. As CAN devices offer expansive feature-sets, vendor CAN devices require similarly expansive code libraries to operate. As a result, these libraries are not maintained as an official part of WPILib, but are instead maintained by the vendors themselves. For a guide to installing third-party libraries, see :ref:`3rd Party Libraries <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>`
es_mx: Un buen número de proveedores FRC\ |reg| ofrecen sus propios periféricos de CAN. Ya que los dispositivos CAN ofrecen un sinnúmero de caracterizaciones, dichos dispositivos requieren de igual manera un sinnúmero de librerías de código para operar. Como resultado, estas librerías no son soportadas como parte oficial de WPILib, pero son soportadas por los mismos proveedores. Para una guía de cómo instalar dichas librerías, vea :ref:`3rd Party Libraries <docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries>`

source: A list of common third-party CAN devices from various vendors, along with links to corresponding external documentation, is provided below:
es_mx: A continuación se proporciona una lista de dispositivos CAN comunes de terceros de varios proveedores, junto con enlaces a la documentación externa correspondiente:

source: Cross-the-Road Electronics (CTRE) offers several CAN peripherals with external libraries. General resources for all CTRE devices include:
es_mx: Cross-the-Road Electronics (CTRE) ofrece varios periféricos CAN con bibliotecas externas. Los recursos generales para todos los dispositivos CTRE incluyen:

source: CTRE Motor Controllers
es_mx: Controladores de motor CTRE

source: `Hardware User's Manual <http://www.ctr-electronics.com/downloads/pdf/Falcon%20500%20User%20Guide.pdf>`__
es_mx: `Manual del usuario de hardware <http://www.ctr-electronics.com/downloads/pdf/Falcon%20500%20User%20Guide.pdf>` __

source: `Other Resources <https://www.ctr-electronics.com/talon-fx.html#product_tabs_technical_resources>`__
es_mx: `Otros recursos <https://www.ctr-electronics.com/talon-fx.html#product_tabs_technical_resources>`__

source: API Documentation (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_talon_s_r_x.html>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_talon_s_r_x.html>`__)
es_mx: Documentación API (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_talon_s_r_x.html>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_talon_s_r_x.html>`__)

source: `Hardware User's Manual <https://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__
es_mx: `Manual del usuario de hardware <https://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__

source: `Other Resources <https://www.ctr-electronics.com/talon-srx.html#product_tabs_technical_resources>`__
es_mx: `Otros recursos<https://www.ctr-electronics.com/talon-srx.html#product_tabs_technical_resources>`__

source: API Documentation (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_victor_s_p_x.html>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_victor_s_p_x.html>`__)
es_mx: Documentación API (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_victor_s_p_x.html>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1motorcontrol_1_1can_1_1_victor_s_p_x.html>`__)

source: `Hardware User's Manual <https://www.ctr-electronics.com/downloads/pdf/Victor%20SPX%20User's%20Guide.pdf>`__
es_mx: `Manual del usuario de hardware <https://www.ctr-electronics.com/downloads/pdf/Victor%20SPX%20User's%20Guide.pdf>`__

source: `Other Resources <https://www.ctr-electronics.com/victor-spx.html#product_tabs_technical_resources>`__
es_mx: `Otros recursos <https://www.ctr-electronics.com/victor-spx.html#product_tabs_technical_resources>`__

source: CTRE Sensors
es_mx: Sensores CTRE

source: API Documentation(`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1sensors_1_1_c_a_n_coder.html>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1sensors_1_1_c_a_n_coder.html>`__)
es_mx: Documentación de API (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1sensors_1_1_c_a_n_coder.html>` __, `C ++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1sensors_1_1_c_a_n_coder.html>` __)

source: `Hardware User's Manual <https://www.ctr-electronics.com/downloads/pdf/CANCoder%20User's%20Guide.pdf>`__
es_mx: `Manual del usuario de hardware <https://www.ctr-electronics.com/downloads/pdf/CANCoder%20User's%20Guide.pdf>` __

source: `Other Resources <https://www.ctr-electronics.com/cancoder.html#product_tabs_technical_resources>`__
es_mx: `Otros recursos <https://www.ctr-electronics.com/cancoder.html#product_tabs_technical_resources>` __

source: API Documentation(`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1sensors_1_1_pigeon_i_m_u.html>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1sensors_1_1_pigeon_i_m_u.html>`__)
es_mx: Documentación API(`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1sensors_1_1_pigeon_i_m_u.html>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1sensors_1_1_pigeon_i_m_u.html>`__)

source: `Hardware User's Manual <https://www.ctr-electronics.com/downloads/pdf/Pigeon%20IMU%20User's%20Guide.pdf>`__
es_mx: `Manual del usuario de hardware <https://www.ctr-electronics.com/downloads/pdf/Pigeon%20IMU%20User's%20Guide.pdf>` __

source: `Other Resources <https://www.ctr-electronics.com/gadgeteer-imu-module-pigeon.html#product_tabs_technical_resources>`__
es_mx: `Otros recursos <https://www.ctr-electronics.com/gadgeteer-imu-module-pigeon.html#product_tabs_technical_resources>` __

source: API Documentation (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1_c_a_nifier.html#ad9a05fae7065d3f39f7bc8a86f15b0a1>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1_c_a_nifier.html#a706308fce1dea96785bf3ac845bafc02>`__)
es_mx: Documentación API (`Java <https://www.ctr-electronics.com/downloads/api/java/html/classcom_1_1ctre_1_1phoenix_1_1_c_a_nifier.html#ad9a05fae7065d3f39f7bc8a86f15b0a1>`__, `C++ <https://www.ctr-electronics.com/downloads/api/cpp/html/classctre_1_1phoenix_1_1_c_a_nifier.html#a706308fce1dea96785bf3ac845bafc02>`__)

source: `Hardware User's Manual <https://www.ctr-electronics.com/downloads/pdf/CANifier%20User's%20Guide.pdf>`__
es_mx: `Manual del usuario de hardware <https://www.ctr-electronics.com/downloads/pdf/CANifier%20User's%20Guide.pdf>` __

source: `Other Resources <https://www.ctr-electronics.com/can-can-canifier-driver-led-driver-gpio.html#product_tabs_technical_resources>`__
es_mx: `Otros recursos <https://www.ctr-electronics.com/can-can-canifier-driver-led-driver-gpio.html#product_tabs_technical_resources>` __

source: REV Robotics currently offers the SPARK MAX motor controller, which has a similar feature-set to the Talon SRX.
es_mx: REV Robotics actualmente ofrece el controlador de motor SPARK MAX, que tiene un conjunto de características similar al Talon SRX.

source: REV Motor Controllers
es_mx: Controladores de motor REV

source: API Documentation (`Java <https://www.revrobotics.com/content/sw/max/sw-docs/java/com/revrobotics/CANSparkMax.html>`__, `C++ <https://www.revrobotics.com/content/sw/max/sw-docs/cpp/classrev_1_1_c_a_n_spark_max.html>`__)
es_mx: Documentación API (`Java <https://www.revrobotics.com/content/sw/max/sw-docs/java/com/revrobotics/CANSparkMax.html>`__, `C++ <https://www.revrobotics.com/content/sw/max/sw-docs/cpp/classrev_1_1_c_a_n_spark_max.html>`__)

source: `Technical Manual <https://www.revrobotics.com/sparkmax-users-manual/>`__
es_mx: `Manual técnico<https://www.revrobotics.com/sparkmax-users-manual/>`__

source: Playing With Fusion (PWF) offers the Venom integrated motor/controller as well as a Time-of-Flight distance sensor:
es_mx: Playing With Fusion (PWF) ofrece el motor / controlador integrado Venom, así como un sensor de distancia de tiempo de vuelo:

source: PWF Motor Controllers
es_mx: Controladores de motor PWF

source: API Documentation (`Java <https://www.playingwithfusion.com/frc/2020/javadoc/com/playingwithfusion/package-summary.html>`__, `C++ <https://www.playingwithfusion.com/frc/2020/cppdoc/html/annotated.html>`__)
es_mx: Documentación API (`Java <https://www.playingwithfusion.com/frc/2020/javadoc/com/playingwithfusion/package-summary.html>`__, `C++ <https://www.playingwithfusion.com/frc/2020/cppdoc/html/annotated.html>`__)

source: `Technical Manual <https://www.playingwithfusion.com/include/getfile.php?fileid=7086>`__
es_mx: `Manual técnico <https://www.playingwithfusion.com/include/getfile.php?fileid=7086>` __

source: PWF Sensors
es_mx: Sensores PWF

source: **Time of Flight Sensor**
es_mx: ** Sensor de tiempo de vuelo **

source: API Documentation(`Java <https://www.playingwithfusion.com/frc/2020/javadoc/com/playingwithfusion/package-summary.html>`__, `C++ <https://www.playingwithfusion.com/frc/2020/cppdoc/html/annotated.html>`__)
es_mx: Documentación API(`Java <https://www.playingwithfusion.com/frc/2020/javadoc/com/playingwithfusion/package-summary.html>`__, `C++ <https://www.playingwithfusion.com/frc/2020/cppdoc/html/annotated.html>`__)

source: `Technical Manual <https://www.playingwithfusion.com/include/getfile.php?fileid=7091>`__
es_mx: `Manual técnico <https://www.playingwithfusion.com/include/getfile.php?fileid=7091>`__
