Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/romi-robot/getting-to-know-romi.po
Languages: es_mx

source: Getting to know your Romi
es_mx: Conociendo a tu Romi

source: Directional Conventions
es_mx: Convenciones sobre direcciones

source: The front of the Romi is where the Raspberry Pi USB ports, GPIO pins and suspended caster wheel are.
es_mx: El frente del Romi es donde se encuentran los puertos USB de la Raspberry Pi, los pines GPIO y la rueda giratoria.

source: In all Romi documentation, references to driving forward use the above definition of "front".
es_mx: En toda la documentación del Romi, las referencias a conducir hacia adelante utilizan la definición de arriba de "frente".

source: Hardware, Sensors and GPIO
es_mx: Hardware, Sensores y GPIO

source: The Romi has the following built-in hardware/peripherals:
es_mx: El Romi cuenta con los siguientes accesorios incorporados:

source: 2x geared motors with encoders
es_mx: 2x motorreductores con encoders

source: 1x Inertial Measurement Unit (IMU)
es_mx: 1x Unidad de Medición Inercial (IMU)

source: 3x LEDs (green, yellow, red)
es_mx: 3x LEDs (verde, amarillo, rojo)

source: 3x pushbuttons (marked A, B, and C)
es_mx: 3x pulsadores (marcados A, B y C)

source: 5x configurable GPIO channels
es_mx: 5x canales GPIO configurables

source: Motors, Wheels and Encoders
es_mx: Motores, Ruedas y Encoders

source: The motors used on the Romi have a 120:1 gear reduction, and a no-load output speed of 150 RPM at 4.5V. The free current is 0.13 amps and the stall current is 1.25 amps. Stall torque is 25 oz-in (0.1765 N-m) but the built-in safety clutch might start slipping at lower torques.
es_mx: Los motores usados en el Romi tienen una reducción de 120:1, y una velocidad de salida sin carga de 150 RPM a 4.5V. La corriente libre que consumen es de 0.13 amperes y la corriente de motor en parada es de 1.25 amperes. El torque en parada es de 25 oz-in (0.1765 N-m) pero puede que el embrague de seguridad incorporado se resbale a torques más bajos.

source: The wheels have a diameter of 70mm (2.75"). They have a trackwidth of 141mm (5.55").
es_mx: Las llantas tienen un diámetro de 70mm (2.75"). Tienen un ancho de pista de 141mm (5.55")

source: The encoders are connected directly to the motor output shaft and have 12 Counts Per Revolution (CPR). With the provided gear ratio, this nets 1440 counts per wheel revolution.
es_mx: Los encoders están conectados directamente al eje de salida del motor y tienen 12 Cuentas Por Revolución (CPR). Con la reducción, esto da 1440 cuentas por revolución de la llanta.

source: By default, the encoders count up when the Romi moves forward.
es_mx: Por default, los encoders cuentan de manera positiva cuando el Romi se mueve hacia adelante.

source: Inertial Measurement Unit
es_mx: Unidad de Medición Inercial

source: The Romi includes an STMicroelectronics LSM6DS33 Inertial Measurement Unit (IMU) which contains a 3-axis gyro and a 3-axis accelerometer.
es_mx: El Romi incluye una Unidad de Medición Inercial (IMU) STMicroelectronics LSM6DS33 que contiene un giroscopio de 3 ejes y un acelerómetro de 3 ejes.

source: The accelerometer has selectable sensitivity of 2G, 4G, 8G, and 16G. The gyro has selectable sensitivity of 125 Degrees Per Second (DPS), 250 DPS, 500 DPS, 1000 DPS and 2000 DPS.
es_mx: El acelerómetro tiene una sensibilidad seleccionable de 2G, 4G, 8G y 16G. El giroscopio tiene una sensibilidad seleccionable de 125 Grados Por Segundo (DPS), 250 DPS, 500 DPS, 1000 DPS y 2000 DPS.

source: The Romi Web UI also provides a means to calibrate the gyro and measure its zero-offsets before use with robot code.
es_mx: La interfaz de usuario web de Romi también proporciona un medio para calibrar el giroscopio y medir sus desplazamientos de cero antes de usarlo con el código del robot.

source: LEDs and Push Buttons
es_mx: LEDs y pulsadores

source: The Romi 32U4 control board has 3 push buttons and 3 LEDs that are exposed as Digital IO channels to robot code. The section on GPIO Mapping has more information on how to use the built in LEDs and buttons in robot code.
es_mx: La placa de control Romi 32U4 tiene 3 pulsadores y 3 LED que están expuestos como canales de E/S digitales al código del robot. La sección sobre mapeo GPIO tiene más información sobre cómo usar los LED y botones integrados en el código del robot.

source: Configurable GPIO Channels
es_mx: Canales GPIO configurables

source: The control board has 5 configurable GPIO channels (named EXT0 through EXT4) that allow a user to connect external sensors and actuators to the Romi.
es_mx: La placa de control tiene 5 canales GPIO configurables (denominados EXT0 a EXT4) que permiten al usuario conectar sensores y actuadores externos al Romi.

source: All 5 channels support the following modes: Digital IO, Analog In, PWM (with the exception of EXT 0, which only supports Digital IO and PWM).
es_mx: Los 5 canales admiten los siguientes modos: E / S digital, Entrada analógica, PWM (con la excepción de EXT 0, que solo admite E / S digital y PWM).

source: The GPIO channels are exposed via a 3-pin, servo style interface, with connections for Ground, Power and Signal (with the Ground connection being closest to the edge of the board, and the signal being closest to the inside of the board).
es_mx: Los canales GPIO están expuestos a través de una interfaz de estilo servo de 3 pines, con conexiones para tierra, alimentación y señal (con la conexión a tierra más cercana al borde de la placa y la señal la más cercana al interior de la placa).

source: The power connections for the GPIO channels are initially left unconnected, but can be hooked into the Romi's on-board 5V supply by using a jumper to connect the 5V pin to the power bus (as seen in the image above). Additionally, if more power than the Romi can provide is needed, the user can provide their own 5V power supply and connect it directly to power bus and ground pins.
es_mx: Las conexiones de alimentación para los canales GPIO se dejan inicialmente desconectadas, pero se pueden conectar a la fuente de alimentación de 5V incorporada a la Romi usando un puente para conectar el pin de 5V al bus de alimentación (como se ve en la imagen de arriba). Además, si se necesita más potencia de la que puede proporcionar el Romi, el usuario puede proporcionar su propia fuente de alimentación de 5 V y conectarla directamente al bus de alimentación y a los pines de tierra.

source: GPIO Mapping
es_mx: Mapeo GPIO

source: To support all the built in peripherals on the Romi, we have provided a hard-coded mapping of WPILib channels/devices to the Romi hardware.
es_mx: Para admitir todos los periféricos integrados en Romi, hemos proporcionado un mapeo codificado de canales / dispositivos WPILib al hardware Romi.

source: Digital IO
es_mx: IO digital

source: DIO Channel
es_mx: Canal DIO

source: Romi Hardware Component
es_mx: Componente de hardware del Romi

source: Button A (input only)
es_mx: Botón A (solo entrada)

source: Button B (input), Green LED (output)
es_mx: Botón B (entrada), LED verde (salida)

source: Button C (input), Red LED (output)
es_mx: Botón C (entrada), LED rojo (salida)

source: Yellow LED (output only)
es_mx: LED amarillo (solo salida)

source: Left Encoder Quadrature Channel A
es_mx: Canal A de cuadratura del encoder izquierdo

source: Left Encoder Quadrature Channel B
es_mx: Canal B de cuadratura del encoder izquierdo

source: Right Encoder Quadrature Channel A
es_mx: Canal A de cuadratura del encoder derecho

source: Right Encoder Quadrature Channel B
es_mx: Canal B de cuadratura del encoder derecho

source: PWM Output
es_mx: Salida PWM

source: The right motor is hardwired to spin in a forward direction when forward stick movement is applied on a joystick. Thus there is no need to invert the corresponding motor controller in robot code.
es_mx: El motor derecho está programado para girar hacia adelante cuando se aplica el movimiento de la palanca hacia adelante en un joystick. Por lo tanto, no es necesario invertir el controlador de motor correspondiente en código de robot.

source: GPIO Channels
es_mx: Canales GPIO

source: The Romi Web UI allows the user to customize the functions of the 5 configurable GPIO channels. The UI will also provide the appropriate WPILib channel/device mappings on screen once the IO configuration is complete. More information on this can be found in the next section.
es_mx: La interfaz de usuario web de Romi permite al usuario personalizar las funciones de los 5 canales GPIO configurables. La interfaz de usuario también proporcionará las asignaciones de canal/dispositivo WPILib adecuadas en la pantalla una vez que se complete la configuración de E/S. Puede encontrar más información sobre esto en la siguiente sección.
