Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/romi-robot/programming-romi.po
Languages: es_mx, fr_ca, tr_tr, zh_cn

source: Programming the Romi
es_mx: Programando el Romi
fr_ca: Programmation de Romi
tr_tr: Romi'yi Programlamak
zh_cn: 编程Romi

source: Writing a program for the Romi is very similar to writing a program for a regular FRC robot. In fact, all the same tools (Visual Studio Code, Driver Station, SmartDashboard, etc) can be used with the Romi.
es_mx: Escribir un programa para Romi es muy parecido a escribir un programa para un robot regular de FRC. De hecho, todas las mismas herramientas (Visual Studio Code, Driver Station, SmartDashboard, etc) pueden usarse con Romi.
fr_ca: L'écriture d'un programme pour le Romi est très similaire à l'écriture d'un programme pour un robot FRC ordinaire. En fait, tous les mêmes outils (Visual Studio Code, Driver Station, SmartDashboard, etc.) peuvent être utilisés avec le Romi.
tr_tr: Romi için bir program yazmak, normal bir FRC robotu için bir program yazmaya çok benzer. Aslında, tüm aynı araçlar (Visual Studio Code, Driver Station, SmartDashboard, vb.) Romi ile kullanılabilir.
zh_cn: 为Romi编写程序与为普通的FRC机器人编写程序非常相似，事实上，所有相同的工具(Visual Studio Code、Driver Station、SmartDashboard等)都可以在Romi上使用。

source: Creating a Romi Program
es_mx: Crear un programa Romi
fr_ca: Créer un programme Romi
tr_tr: Bir Romi Programı Oluşturmak
zh_cn: 创建Romi程序

source: Creating a new program for a Romi is no different than creating a normal FRC program, similar to the :doc:`Zero To Robot </docs/zero-to-robot/step-4/index>` programming steps.
es_mx: Crear un nuevo programa para un Romi no es diferente a crear un programa FRC normal, similar a los pasos de programación :doc:`Zero To Robot </docs/zero-to-robot/step-4/index>`.
fr_ca: La création d'un nouveau programme pour un Romi n'est pas différente de la création d'un programme FRC normal, similaire aux étapes de programmation :doc:`De Zéro à Robot</docs/zero-to-robot/step-4/index>`.
tr_tr: Bir Romi için yeni bir program oluşturmak, normal bir FRC programı oluşturmaktan farklı değildir, aynı :doc:`Zero To Robot </docs/zero-to-robot/step-4/index>` programlama adımları.
zh_cn: 为Romi创建一个新程序与创建一个普通的FRC程序没有什么不同，类似于Zero to Robot编程步骤

source: WPILib comes with several templates for Romi projects, including ones based on TimedRobot, and a Command-Based project template. Additionally, an example project is also provided which showcases some of the built-in functionality of the Romi. This article will walk through creating a project from this example.
es_mx: WPILib viene con varias plantillas para proyectos Romi, incluidas las basadas en TimedRobot y una plantilla de proyecto basada en comandos. Además, también se proporciona un proyecto de ejemplo que muestra algunas de las funciones integradas de Romi. Este artículo le explicará cómo crear un proyecto a partir de este ejemplo.
fr_ca: WPILib est livré avec plusieurs modèles pour les projets Romi, y compris ceux basés sur TimedRobot, et un modèle de projet basé sur les commandes. En outre, un exemple de projet est également fourni qui présente certaines des fonctionnalités intégrées du Romi. Cet article décrit la création d'un projet à partir de cet exemple.
tr_tr: WPILib, TimedRobot tabanlı olanlar da dahil olmak üzere Romi projeleri için çeşitli şablonlar ve Komut Tabanlı proje şablonu ile birlikte gelir. Ek olarak, Romi'nin bazı yerleşik işlevlerini gösteren örnek bir proje de sunulmuştur. Bu makale, bu örnekten bir proje oluşturmanın üzerinden geçecektir.
zh_cn: WPILib为Romi项目提供了几个模板，包括基于TimedRobot的模板，以及一个基于命令的项目模板。此外，还提供了一个示例项目，展示了Romi的一些内置功能。本文将从这个例子开始逐步创建一个项目。

source: In order to program the Romi using C++, a compatible C++ desktop compiler must be installed. See :ref:`Robot Simulation - Additional C++ Dependency <docs/software/wpilib-tools/robot-simulation/introduction:Additional C++ Dependency>`.
es_mx: Para programar Romi usando C ++, se debe instalar un compilador de escritorio compatible con C ++. Consulte :ref:`Robot Simulation - Additional C++ Dependency <docs/software/wpilib-tools/robot-simulation/introduction:Additional C++ Dependency>`.
fr_ca: Afin de programmer le Romi à l’aide de C++, un compilateur de bureau Compatible C++ doit être installé. Voir :ref:`Simulation du robot - Dépendance C++ supplémentaire <docs/software/wpilib-tools/robot-simulation/introduction:Additional C++ Dependency>`.
tr_tr: Romi'yi C ++ kullanarak programlamak için, uyumlu bir C ++ masaüstü derleyicisi kurulmalıdır. Bakınız :ref:`Robot Simulation - Additional C++ Dependency <docs/software/wpilib-tools/robot-simulation/introduction:Additional C++ Dependency>`.
zh_cn: 为了使用c++对Romi进行编程，必须安装兼容的c++桌面编译器。参见:ref: ' Robot Simulation - Additional c++ Dependency <docs/software/wpilib-tools/ Robot - Simulation /introduction:Additional c++ Dependency> '。

source: Creating a New WPILib Romi Project
es_mx: Crear un nuevo proyecto WPILib Romi
fr_ca: Création d'un nouveau projet WPILib Romi
tr_tr: Yeni bir WPILib Romi Projesi Oluşturma
zh_cn: 创建一个新的 WPILib Romi项目

source: Bring up the Visual Studio Code command palette with :kbd:`Ctrl+Shift+P`, and type "New project" into the prompt. Select the "Create a new project" command:
es_mx: Abra la paleta de comandos de Visual Studio Code con :kbd:`Ctrl+Shift+P` y escriba "Nuevo proyecto" en el indicador. Seleccione el comando "Crear un nuevo proyecto":
fr_ca: Affichez la palette de commandes Visual Studio Code avec :kbd:`Ctrl+Maj+P`, et tapez "New project". Sélectionnez la commande "Create a new project":
tr_tr: Visual Studio Code komut paletini şu şekilde getirin :kbd:`Ctrl+Shift+P` ve komut istemine " New project-Yeni proje" yazın. "Create a new project-Yeni proje oluştur" komutunu seçin:
zh_cn: 使用Ctrl+Shift+P打开Visual Studio代码命令面板，并在提示符中键入New Project。选择Create a new project命令。

source: This will bring up the "New Project Creator Window". From here, click on "Select a project type (Example or Template), and pick "Example" from the prompt that appears:
es_mx: Esto abrirá la "Ventana del Creador de nuevos proyectos". Desde aquí, haga clic en "Seleccionar un tipo de proyecto (ejemplo o plantilla) y elija "Ejemplo" en el mensaje que aparece:
fr_ca: Cela fera apparaître la "New Project Creator Window". De là, cliquez sur "Select a project type (Example or Template), et choisir "Example" dans la boîte qui apparaît:
tr_tr: Bu, "New Project Creator Window-Yeni Proje Oluşturucu Penceresini" getirecektir. Buradan, "Select a project type-Bir proje türü seçin (Örnek veya Şablon) seçeneğini tıklayın ve beliren istemden "Example-Örnek "i seçin:
zh_cn: 这将弹出“新建项目创建器”窗口。在这里，单击Select a project type (Example或Template)，并从出现的提示符中选择Example。

source: Next, a list of examples will appear. Scroll through the list to find the "RomiReference" example:
es_mx: A continuación, aparecerá una lista de ejemplos. Desplácese por la lista para encontrar el ejemplo "RomiReference":
fr_ca: Ensuite, une liste d'exemples apparaîtra. Faites défiler la liste pour trouver l'exemple "RomiReference":
tr_tr: Ardından, bir örnek listesi görünecektir. "RomiReference" örneğini bulmak için listede ilerleyin:
zh_cn: 接下来，将出现一个示例列表。滚动列表以找到RomiReference示例。

source: Fill out the rest of the fields in the "New Project Creator" and click "Generate Project" to create the new robot project.
es_mx: Complete el resto de los campos en el "Creador de nuevo proyecto" y haga clic en "Generar proyecto" para crear el nuevo proyecto de robot.
fr_ca: Remplissez le reste des champs dans le "New Project Creator" et cliquez sur "Generate Project" pour créer le nouveau projet de robot.
tr_tr: "New Project Creator-Yeni Proje Oluşturucu" daki kalan alanları doldurun ve yeni robot projesini oluşturmak için "Generate Project-Proje Oluştur" u tıklayın.
zh_cn: 填写New Project Creator中的其他字段，并单击Generate Project创建新的robot项目。

source: Running a Romi Program
es_mx: Ejecución de un programa Romi
fr_ca: Exécution d'un programme Romi
tr_tr: Bir Romi Programı Çalıştırmak
zh_cn: 运行一个Romi程序

source: Once the robot project is generated, it is essentially ready to run. The project has a pre-built ``Drivetrain`` class and associated default command that lets you drive the Romi around using a gamepad.
es_mx: Una vez que se genera el proyecto de robot, está esencialmente listo para ejecutarse. El proyecto tiene una clase ``Drivetrain`` prediseñada y un comando predeterminado asociado que le permite conducir el Romi usando un gamepad.
fr_ca: Une fois le projet de robot généré, il est essentiellement prêt à être exécuté. Le projet a une classe prédéfinie ``Drivetrain`` et une commande par défaut associée qui vous permet de conduire le Romi à l'aide d'une manette de jeu.
tr_tr: Robot projesi oluşturulduktan sonra, esasen çalışmaya hazırdır. Proje, önceden oluşturulmuş bir ``Drivetrain`` sınıfına ve Romi'yi bir gamepad kullanarak dolaşmanıza izin veren ilişkili varsayılan komuta sahiptir.
zh_cn: 一旦生成了机器人项目，Romi程序基本上就可以运行了。该项目有一个预构建的Drivetrain类和相关的默认命令，让你使用手柄驾驶Romi。

source: One aspect where a Romi project differs from a regular FRC robot project is that the code is not deployed directly to the Romi. Instead, a Romi project runs on your development computer, and leverages the WPILib simulation framework to communicate with the Romi robot.
es_mx: Un aspecto en el que un proyecto Romi difiere de un proyecto de robot FRC normal es que el código no se implementa directamente en Romi. En cambio, un proyecto Romi se ejecuta en su computadora de desarrollo y aprovecha el marco de simulación WPILib para comunicarse con el robot Romi.
fr_ca: Un aspect où un projet Romi diffère d'un projet de robot FRC classique est que le code n'est pas déployé directement sur le Romi. Au lieu de cela, un projet Romi s'exécute sur votre ordinateur de développement et exploite le cadre de simulation WPILib pour communiquer avec le robot Romi.
tr_tr: Bir Romi projesinin normal bir FRC robot projesinden farklı olduğu bir nokta, kodun doğrudan Romi'ye dağıtılmamasıdır. Bunun yerine, geliştirme bilgisayarınızda bir Romi projesi çalışır ve Romi robotu ile iletişim kurmak için WPILib simülasyon çerçevesini kullanır.
zh_cn: Romi项目与常规FRC机器人项目的一个不同之处在于，代码不是直接部署到Romi中。相反，Romi项目在您的开发计算机上运行，并利用WPILib仿真框架与Romi机器人通信。

source: To run a Romi program, first, ensure that your Romi is powered on. Once you connect to the ``WPILibPi-<number>`` network broadcast by the Romi, press :kbd:`F5` to start running the Romi program on your computer.
es_mx: Para ejecutar un programa Romi, primero, asegúrese de que su Romi esté encendido. Una vez que se conecte a la transmisión de red ``WPILibPi-<number>`` de Romi, presione :kbd:`F5` para comenzar a ejecutar el programa Romi en su computadora.
fr_ca: Pour exécuter un programme Romi, tout d’abord, assurez-vous que votre Romi est alimenté. Une fois que vous vous connectez au réseau ``WPILibPi-<number>`` diffusé par Romi, appuyez sur :kbd:`F5` pour commencer à exécuter le programme de Romi à partir de votre ordinateur.
tr_tr: Bir Romi programını çalıştırmak için önce Romi'nizin açık olduğundan emin olun. Romi tarafından yayınlanan ``WPILibPi- <number>``ağına bağlandıktan sonra, bilgisayarınızda Romi programını çalıştırmaya başlamak için : kbd:`F5` e basın.
zh_cn: 要运行Romi程序，首先，确保您的Romi是通电的。一旦你连接到WPILibPi-<number>网络广播由Romi，按F5开始在您的计算机上运行Romi程序。

source: If you changed the Romi network settings (for example, to connect it to your own WiFi network), you can change the IP address that your program uses to connect to the Romi. To do this, open the "build.gradle" file and update the ``envVar`` line to the appropriate IP address.
es_mx: Si cambió la configuración de red de Romi (por ejemplo, para conectarlo a su propia red WiFi), puede cambiar la dirección IP que usa su programa para conectarse a Romi. Para hacer esto, abra el archivo "build.gradle" y actualice la línea ``envVar`` a la dirección IP apropiada.
fr_ca: Si vous avez modifié les paramètres du réseau Romi (par exemple, pour le connecter à votre propre réseau WiFi), vous pouvez changer l'adresse IP que votre programme utilise pour se connecter au Romi. Pour ce faire, ouvrez le fichier "build.gradle" et mettez à jour la ligne ``envVar`` avec l'adresse IP appropriée.
tr_tr: Romi ağ ayarlarını değiştirdiyseniz (örneğin, kendi WiFi ağınıza bağlamak için), programınızın Romi'ye bağlanmak için kullandığı IP adresini değiştirebilirsiniz. Bunu yapmak için "build.gradle" dosyasını açın ve ``envVar`` satırını uygun IP adresine güncelleyin.
zh_cn: 如果您更改了Romi网络设置(例如，将其连接到您自己的WiFi网络)，您可以更改程序用于连接Romi的IP地址。为此，打开构建。将envVar行更新到适当的IP地址。

source: Now you just need to start your Romi robot code! This is done by opening the WPILib Command Palette (type :kbd:`Ctrl+Shift+P`) or by pressing :kbd:`F8`.
fr_ca: Il ne vous reste plus qu'à démarrer votre code robot Romi ! Cela se fait en ouvrant la palette de commandes WPILib (tapez :kbd:`Ctrl+Shift+P`) ou en appuyant sur :kbd:`F8`.

source: If all goes well, you should see a line in the console output that reads "HALSimWS: WebSocket Connected":
es_mx: Si todo va bien, debería ver una línea en la salida de la consola que dice "HALSimWS: WebSocket Connected":
fr_ca: Si tout se passe bien, vous devriez voir une ligne dans la sortie de la console qui lit "HALSimWS: WebSocket Connected":
tr_tr: Her şey yolunda giderse, konsol çıktısında "HALSimWS:WebSocket Connected" yazan bir satır görmelisiniz:
zh_cn: 如果一切顺利，您应该在控制台输出中看到一行读取HALSimWS: WebSocket Connected的内容。

source: Your Romi code is now running!
es_mx: ¡Tu código Romi ya se está ejecutando!
fr_ca: Votre code Romi est maintenant en cours d'exécution!
tr_tr: Romi kodunuz şimdi çalışıyor!
zh_cn: 您的ROMI代码现在正在运行！

source: By default, the Romi templates and examples are set up so that positive drive values correspond to the Romi moving forward. Since forward movement on a Joystick produces negative values, you will need to invert the values in appropriate places (e.g. the ``xSpeed`` parameter to ``arcadeDrive`` on a ``DifferentialDrive`` object).
es_mx: De forma predeterminada, las plantillas y los ejemplos de Romi están configurados de modo que los valores de conducción positivos se correspondan con el avance de Romi. Dado que el movimiento hacia adelante en un joystick produce valores negativos, deberá invertir los valores en los lugares apropiados (por ejemplo, el parámetro ``xSpeed`` a ``arcadeDrive`` en un objeto``DifferentialDrive``).
fr_ca: Par défaut, les modèles et exemples de Romi sont configurés de telle sorte que les valeurs d’entraînement positives correspondent à un déplacement vers l'avant de Romi. Étant donné que le mouvement vers l’avant sur un Joystick produit des valeurs négatives, vous devrez inverser les valeurs aux endroits appropriés (par exemple, le paramètre ``xSpeed`` de la méthode ``arcadeDrive`` sur un objet ``DifferentialDrive`` ).
tr_tr: Varsayılan olarak, Romi şablonları ve örnekleri ve pozitif sürücü değerleri, ilerleyen Romi'ye karşılık gelecek şekilde ayarlanmıştır. Bir Joystick üzerinde ileri doğru hareket negatif değerler oluşturduğundan, değerleri uygun yerlerde ters çevirmeniz gerekecektir (örneğin, bir ``DifferentialDrive`` nesnesinde ``xSpeed`` parametresini``arcadeDrive`` olarak değiştirmelisiniz).
zh_cn: 注意:默认情况下，ROMI模板和示例的设置使正驱动器值对应于前进的Romi。因为在操纵杆上向前移动会产生负值，所以你需要在适当的位置反转这些值(例如，在一个differaldrive对象上将xSpeed参数转化为arcdedrive)
