Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-gradlerio/code-formatting.po
Languages: tr_tr

source: Using a Code Formatter
tr_tr: Kod Biçimlendirici - Code Formatter Kullanma

source: For this article, we will highlight using `Spotless <https://github.com/diffplug/spotless>`__ for Java teams and `wpiformat <https://github.com/wpilibsuite/styleguide/blob/main/wpiformat/README.rst>`__ for C++ teams.
tr_tr: Bu makalede; Java kullanan takımlar için `Spotless <https://github.com/diffplug/spotless>`__, C++ kullanan takımlar için de <https://github.com/wpilibsuite/styleguide/blob/main/wpiformat/README.rst>`__ kullanmayı vurgulayacağız

source: Configuration
tr_tr: Yapılandırma

source: Running Spotless
tr_tr: Spotless Çalıştırmak

source: Explanation of Options
tr_tr: Seçeneklerin Açıklaması

source: Formatting Java
tr_tr: Java'yı Biçimlendirmek

source: Formatting Gradle files
tr_tr: Gradle Dosyalarını Biçimlendirmek

source: Formatting XML files
tr_tr: XML Dosyalarını Biçimlendirmek

source: Formatting Miscellaneous files
tr_tr: Miscellaneous - Çeşitli Dosyaları Biçimlendirmek

source: Let's explain what each of the options mean.
tr_tr: Seçeneklerin her birinin ne anlama geldiğini açıklayalım.

source: Issues with Line Endings
tr_tr: Satır Sonları ile ilgili sorunlar

source: Requirements
tr_tr: Gereksinimler

source: `Python 3.6 or higher <https://www.python.org/>`__
tr_tr: `Python 3.6 veya daha yüksek <https://www.python.org/>`__

source: Usage
tr_tr: Kullanım

source: ``.clang-format``: :download:`Download <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/.clang-format>`
tr_tr: ``.clang-format``: :download:`İndir <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/.clang-format>`

source: ``.styleguide-license``: :download:`Download <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/.styleguide-license>`
tr_tr: ``.styleguide-license``: :download:`İndirme <https://raw.githubusercontent.com/wpilibsuite/allwpilib/main/.styleguide-license>`

source: An example styleguide is shown below:
tr_tr: Örnek bir stil kılavuzu aşağıda gösterilmiştir:

source: Below is an example GitHub Actions check that uses wpiformat
tr_tr: Aşağıda, wpiformat kullanan örnek bir GitHub Actions denetimi verilmiştir
