Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controllers/feedforward.po
Languages: tr_tr

source: Feedforward Control in WPILib
tr_tr: WPILib'de Feedforward Kontrolü

source: So far, we've used feedback control for reference tracking (making a system's output follow a desired reference signal). While this is effective, it's a reactionary measure; the system won't start applying control effort until the system is already behind. If we could tell the controller about the desired movement and required input beforehand, the system could react quicker and the feedback controller could do less work. A controller that feeds information forward into the plant like this is called a feedforward controller.
tr_tr: Şimdiye kadar, referans izleme için geri besleme kontrolü kullandık (sistemin çıktısının istenen bir referans sinyalini takip etmesini sağladık). Bu etkili olmakla birlikte, tepki verici bir önlemdir; sistem zaten geride kalana kadar sisteme kontrol uygulamaya başlamaz. Denetleyiciye istenen hareketi ve gerekli girdiyi önceden söyleyebilseydik, sistem daha hızlı tepki verebilir ve geri bildirim denetleyicisi daha az iş yapabilirdi. Bilgiyi sisteme bu şekilde besleyen bir kontrolör, feedforward-ileri beslemeli kontrolör olarak adlandırılır.

source: A feedforward controller injects information about the system’s dynamics (like a mathematical model does) or the intended movement. Feedforward handles parts of the control actions we already know must be applied to make a system track a reference, then feedback compensates for what we do not or cannot know about the system’s behavior at runtime.
tr_tr: Feedforward bir denetleyici, sistemin dinamikleri (matematiksel bir modelin yaptığı gibi) veya amaçlanan hareket hakkında bilgi verir. Feedforward, bir sistemin bir referansı takip etmesi için uygulanması gerektiğini bildiğimiz kontrol eylemlerinin bazı kısımlarını ele alır, ardından geri bildirim, sistemin çalışma zamanında davranışı hakkında bilmediğimiz veya bilemediğimiz şeyleri telafi eder.

source: There are two types of feedforwards: model-based feedforward and feedforward for unmodeled dynamics. The first solves a mathematical model of the system for the inputs required to meet desired velocities and accelerations. The second compensates for unmodeled forces or behaviors directly so the feedback controller doesn't have to. Both types can facilitate simpler feedback controllers. We'll cover several examples below.
tr_tr: İki tür feedforward vardır: model tabanlı feedforward ve modellenmemiş dinamikler için feedforward. Birincisi, istenen hızları ve ivmeleri karşılamak için gerekli girdiler için sistemin matematiksel bir modelini çözer. İkincisi, modellenmemiş güçleri veya davranışları doğrudan telafi eder, böylece geri besleme kontrolörünün bunu yapmasına gerek kalmaz. Her iki tür de daha basit geri besleme denetleyicilerinden yararlanabilir. Aşağıda birkaç örneği ele alacağız.

source: WPILib provides a number of classes to help users implement accurate feedforward control for their mechanisms. In many ways, an accurate feedforward is more important than feedback to effective control of a mechanism. Since most FRC\ |reg| mechanisms closely obey well-understood system equations, starting with an accurate feedforward is both easy and hugely beneficial to accurate and robust mechanism control.
tr_tr: WPILib, kullanıcıların mekanizmaları için doğru ileri besleme kontrolü uygulamalarına yardımcı olmak için bir dizi sınıf sağlar. Birçok yönden, doğru bir ileri besleme, bir mekanizmanın etkili kontrolü için geri bildirimden daha önemlidir. Çoğu FRC \ |reg| mekanizmalar, iyi anlaşılmış sistem denklemlerine yakından uyar, doğru bir ileri beslemeyle başlamak, doğru ve sağlam mekanizma kontrolü için hem kolay hem de büyük ölçüde faydalıdır.

source: WPILib currently provides the following three helper classes for feedforward control:
tr_tr: WPILib şu anda feedforward denetimi için aşağıdaki üç yardımcı sınıfı sağlar:

source: In C++, the ``SimpleMotorFeedforward`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in gains *must* have units consistent with the distance units, or a compile-time error will be thrown. ``kS`` should have units of ``volts``, ``kV`` should have units of ``volts * seconds / distance``, and ``kA`` should have units of ``volts * seconds^2 / distance``. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
tr_tr: C ++ 'da, ``SimpleMotorFeedforward`` sınıfı, açısal veya doğrusal olabilen mesafe ölçümleri için kullanılan birim türüne göre şablonlanır. Kabul edilen kazançlar, mesafe birimleriyle tutarlı birimlere sahip *olmalıdır*, yoksa bir derleme zamanı hatası alınır. ``kS`` birimleri ``volt``, ``kV`` birimleri ``volt * saniye / mesafe`` ve ``kA'' birimleri ``volt * saniye^2 / mesafe`` olmalıdır. C ++ birimleri hakkında daha fazla bilgi için bkz :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.

source: The Java feedforward components will calculate outputs in units determined by the units of the user-provided feedforward gains. Users *must* take care to keep units consistent, as WPILibJ does not have a type-safe unit system.
tr_tr: Java feedforward bileşenleri, çıktıları, kullanıcı tarafından sağlanan feedforward kazançlarının birimleri cinsinden hesaplar. WPILibJ'in güvenli-tip bir unit sistemi olmadığı için kullanıcılar *unitleri tutarlı tutmaya özen göstermelidir*.

source: The ``SimpleMotorFeedforward`` class calculates feedforwards for mechanisms that consist of permanent-magnet DC motors with no external loading other than friction and inertia, such as flywheels and robot drives.
tr_tr: ``SimpleMotorFeedforward`` sınıfı, dönen tekerlekler ve robot sürücüler gibi sürtünme ve atalet dışında hiçbir harici yüke sahip olmayan sabit mıknatıslı DC motorlardan oluşan mekanizmalar için ileri beslemeyi hesaplar.

source: To create a ``SimpleMotorFeedforward``, simply construct it with the required gains:
tr_tr: Bir ``SimpleMotorFeedforward`` oluşturmak için, basitçe gerekli kazançları kullanın:

source: The ``kA`` gain can be omitted, and if it is, will default to a value of zero. For many mechanisms, especially those with little inertia, it is not necessary.
tr_tr: ``kA`` kazancı ihmal edilebilir ve eğer öyleyse, varsayılan olarak sıfır değerine ayarlanır. Bu pek çok mekanizma için, özellikle az eylemsizliği olanlar için gerekli değildir.

source: To calculate the feedforward, simply call the ``calculate()`` method with the desired motor velocity and acceleration:
tr_tr: Feedforward hesaplamak için, istenen motor hızı ve ivmesiyle ``calculate()`` yöntemini çağırmanız yeterlidir:

source: The acceleration argument may be omitted from the ``calculate()`` call, and if it is, will default to a value of zero. This should be done whenever there is not a clearly-defined acceleration setpoint.
tr_tr: İvme argümanı ``calculate()`` çağrısından çıkarılabilir ve eğer öyleyse, varsayılan olarak sıfır değerine ayarlanır. Bu, açıkça tanımlanmış bir ivmelenme ayar noktası olmadığında yapılmalıdır.

source: In C++, the ``ArmFeedforward`` class assumes distances are angular, not linear. The passed-in gains *must* have units consistent with the angular unit, or a compile-time error will be thrown. ``kS`` and ``kCos`` should have units of ``volts``, ``kV`` should have units of ``volts * seconds / radians``, and ``kA`` should have units of ``volts * seconds^2 / radians``. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
tr_tr: C ++ 'da, ``ArmFeedforward`` sınıfı mesafelerin doğrusal değil açısal olduğunu varsayar. İletilen kazançlar, açısal birim ile tutarlı birimlere sahip *olmalıdır*, aksi takdirde bir derleme zamanı hatası atılır. ``kS`` ve ``kCos`` birimleri ``volt``, ``kV`` birimleri ``volt * saniye / radyan`` ve ``kA`` birimleri `` volt * saniye^2 / radyan``. C ++ birimleri hakkında daha fazla bilgi için bkz :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.

source: The ``ArmFeedforward`` class calculates feedforwards for arms that are controlled directly by a permanent-magnet DC motor, with external loading of friction, inertia, and mass of the arm. This is an accurate model of most arms in FRC.
tr_tr: ``ArmFeedforward`` sınıfı, doğrudan kalıcı mıknatıslı bir DC motor tarafından kontrol edilen kollar için sürtünme, atalet ve kol kütlesinin harici yüklemesi ile ileri beslemeyi hesaplar. Bu, FRC'deki çoğu kol için doğru bir modelidir.

source: To create an ``ArmFeedforward``, simply construct it with the required gains:
tr_tr: Bir ``ArmFeedforward`` oluşturmak için, onu gerekli kazançlarla ayarlamanız yeterlidir:

source: To calculate the feedforward, simply call the ``calculate()`` method with the desired arm position, velocity, and acceleration:
tr_tr: Feedforward hesaplamak için, istenen kol konumu, hızı ve ivmeyle ``calculate()`` yöntemini çağırmanız yeterlidir:

source: In C++, the ``ElevatorFeedforward`` class is templated on the unit type used for distance measurements, which may be angular or linear. The passed-in gains *must* have units consistent with the distance units, or a compile-time error will be thrown. ``kS`` and ``kG`` should have units of ``volts``, ``kV`` should have units of ``volts * seconds / distance``, and ``kA`` should have units of ``volts * seconds^2 / distance``. For more information on C++ units, see :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`.
tr_tr: C ++ 'da, ``ElevatorFeedforward`` sınıfı, açısal veya doğrusal olabilen mesafe ölçümleri için kullanılan birim türüne göre şablonlanır. Kabul edilen kazançlar, mesafe birimleriyle tutarlı birimlere sahip *olmalıdır*, yoksa bir derleme zamanı hatası atılır. ``kS`` ve ``kG`` birimleri ``volt``, ``kV`` birimleri ``volt * saniye / mesafe`` ve ``kA`` birimleri ``volt * saniye^ 2 / mesafe``. C ++ birimleri hakkında daha fazla bilgi için bkz :ref:`docs/software/basic-programming/cpp-units:The C++ Units Library`

source: The ``ElevatorFeedforward`` class calculates feedforwards for elevators that consist of permanent-magnet DC motors loaded by friction, inertia, and the mass of the elevator. This is an accurate model of most elevators in FRC.
tr_tr: ``ElevatorFeedforward`` sınıfı, sürtünme, atalet ve asansör kütlesi ile yüklenen sabit mıknatıslı DC motorlardan oluşan asansörler için feedforward hesaplar. Bu, FRC'deki çoğu asansörün uygun bir modelidir.

source: To create a ``ElevatorFeedforward``, simply construct it with the required gains:
tr_tr: ``ElevatorFeedforward`` oluşturmak için, onu gerekli kazançlarla yapılandırmanız yeterlidir:

source: Using Feedforward to Control Mechanisms
tr_tr: Kontrol Mekanizmaları için Feedforward Kullanma

source: Feedforward control can be used entirely on its own, without a feedback controller. This is known as "open-loop" control, and for many mechanisms (especially robot drives) can be perfectly satisfactory. A ``SimpleMotorFeedforward`` might be employed to control a robot drive as follows:
tr_tr: Feedforward kontrolü, bir geri bildirim denetleyicisi olmadan tamamen kendi başına kullanılabilir. Bu, "açık döngü" kontrolü olarak bilinir ve birçok mekanizma için (özellikle robot sürücüler) mükemmel şekilde tatmin edici olabilir. Bir robot sürücüsünü aşağıdaki şekilde kontrol etmek için bir ``SimpleMotorFeedforward`` kullanılabilir:
