Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/frc-glossary.po
Languages: fr_ca, tr_tr

source: FRC Glossary
fr_ca: Glossaire FRC
tr_tr: FRC Sözlüğü

source: accelerometer
fr_ca: accéléromètre

source: A common sensor used to measure acceleration in one or more axis.
fr_ca: Un capteur commun utilisé pour mesurer l'accélération dans un ou plusieurs axes.

source: A cooperative of up to four (4) FIRST\ |reg| Robotics Competition teams.
fr_ca: Une coopérative d'au plus quatre (4) FIRST \ | reg | Équipes de compétition de robotique.

source: The first phase of each :term:`match` is called Autonomous (auto) and consists of the first fifteen (0:15) seconds.
fr_ca: La première phase de chaque: term: `match` est appelée Autonome (auto) et comprend les quinze premières (0:15) secondes.

source: Commercial off the shelf, a standard (i.e. not custom order) part commonly available from a vendor to all teams for purchase.
fr_ca: Commercial Off The Shelf. Une pièce standard (c'est-à-dire non personnalisée) généralement disponible auprès d'un fournisseur à toutes les équipes à l'achat.

source: One of the three officially supported programming languages.
fr_ca: Un des trois langages de programmation officiellement pris en charge.

source: deprecated
fr_ca: obsolète

source: Software that will be maintained for at least 1 year, but may be removed after that.
fr_ca: Un logiciel qui sera maintenu pendant au moins 1 an, mais qui pourra être supprimé par la suite.

source: Dynamic Host Configuration Protocol, the protocol that allows a central device to assign unique IP addresses to all other devices.
fr_ca: Dynamic Host Configuration Protocol, le protocole qui permet à un périphérique central d'attribuer des adresses IP uniques à tous les autres périphériques.

source: Field Management System, the electronics core responsible for sensing and controlling the FIRST Robotics Competition field.
fr_ca: Field Management System, le noyau électronique responsable de la détection et du contrôle du champ FIRST Robotics Competition.

source: The mechanism that powers the deployment of robot code to the roboRIO.
fr_ca: Le mécanisme qui alimente le déploiement du code du robot sur le roboRIO.

source: A device that measures rate of rotation. It can add up the rotation measurements to determine :term:`heading` of the robot. (“gyro”, for short)
fr_ca: Un appareil qui mesure le taux de rotation. Il peut additionner les mesures de rotation pour déterminer: terme: «cap» du robot. («Gyro», pour faire court)

source: heading
fr_ca: cap
tr_tr: rota

source: The direction the robot is pointed, usually expressed as an angle in degrees.
fr_ca: La direction dans laquelle le robot est pointé, généralement exprimée sous forme d'angle en degrés.
tr_tr: Robotun işaret ettiği yön, genellikle bir açı olarak derece cinsinden ifade edilir.

source: Inertial Measurement Unit, a sensor that combines both an :term:`accelerometer` and a :term:`gyroscope` into a single sensor.
fr_ca: Unité de mesure inertielle, un capteur qui combine à la fois un: term: «accéléromètre» et un: term: «gyroscope» en un seul capteur.

source: Kit of Parts, the collection of items listed on the Kickoff Kit checklists, distributed to the team via FIRST Choice, or paid for completely (except shipping) with a Product Donation Voucher (PDV).
fr_ca: Kit of Parts, la collection d'articles répertoriés sur les listes de contrôle du kit de lancement, distribués à l'équipe via FIRST Choice, ou payés entièrement (sauf les frais d'expédition) avec un bon de don de produit (PDV).

source: KOP chassis
fr_ca: Châssis KOP

source: The `AM14U4 <https://www.andymark.com/products/am14u4-kit-of-parts-chassis>`__ chassis distributed to every team (that did not opt out) as part of the :term:`KOP`.
fr_ca: Le châssis `AM14U4 <https://www.andymark.com/products/am14u4-kit-of-parts-chassis>`__ distribué à chaque équipe (qui ne s'est pas désinscrite) dans le cadre du :term:`KOP`.

source: match
fr_ca: match (joute)
tr_tr: maç

source: A two (2) minute and thirty (30) second period of time in which an :term:`alliance` plays a FRC game.
fr_ca: Une période de deux (2) minutes et trente (30) secondes au cours de laquelle une: term: «alliance» joue une partie de FRC.

source: Ranking Point, a way of ordering teams rewarding specific objectives in addition to winning the match.
fr_ca: Point de classement, une façon de classer les équipes récompensant des objectifs spécifiques en plus de gagner le match.
tr_tr: Sıralama Puanı, belirli hedefleri gerçekleştiren yanı sıra maçı kazanan takımları sıralamanın bir yoludur.

source: A way for teams to test their code without having an actual robot available.
fr_ca: Un moyen pour les équipes de tester leur code sans disposer d'un robot réel.
tr_tr: Takımların yanlarında gerçek bir robot bulunmadan kodlarını test edebilmeleri için bir yol.

source: teleop
fr_ca: téléop
tr_tr: uzaktan kontrol

source: The second phase of each match is called the Teleoperated Period (teleop) and consists of drivers controlling their robots.
fr_ca: La deuxième phase de chaque match est appelée la période de téléopération (téléopération) et consiste en des pilotes contrôlant leurs robots.
tr_tr: Maçın ikinci aşamasına Uzaktan Kontrol Periyodu (Teleoperated Period / Teleop) adı verilir ve bu bölümde sürücüler robotlarını uzaktan kontrol ederler.

source: trajectory
fr_ca: trajectoire

source: A trajectory is a smooth curve, with velocities and accelerations at each point along the curve, connecting two endpoints on the field.
fr_ca: Une trajectoire est une courbe lisse, avec des vitesses et des accélérations à chaque point le long de la courbe, reliant deux extrémités sur le terrain.

source: alliance
tr_tr: ittifak

source: auto
tr_tr: otonom

source: simulation
tr_tr: simülasyon
