Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vision-processing/apriltag/apriltag-intro.po
Languages: tr_tr

source: What Are AprilTags?
tr_tr: AprilTags nedir?

source: A demonstration of AprilTag fiducial targets attached to generic robots.
tr_tr: Jenerik robotlara iliştirilmiş AprilTag güvenilir hedeflerinin gösterimi.

source: AprilTags are a system of visual tags developed by researchers at the University of Michigan to provide low overhead, high accuracy localization for many different applications.
tr_tr: AprilTags, birçok farklı uygulama için düşük ek yük, yüksek doğrulukta yerelleştirme sağlamak üzere Michigan Üniversitesi'ndeki araştırmacılar tarafından geliştirilmiş bir görsel etiketler sistemidir.

source: Additional information about the tag system and its creators `can be found on their website <https://april.eecs.umich.edu/software/apriltag>`__ This document attempts to summarize the content for FIRST robotics related purposes.
tr_tr: Etiket sistemi ve yaratıcılarıyla ilgili detaylı bilgiye ilgili internet sitesinden ulaşılabilir. <https://april.eecs.umich.edu/software/apriltag>`__ Bu belge FIRST robotik ile ilgili amaçlar için içeriği özetlemeyi amaçlar.

source: Application to FRC
tr_tr: FRC uygulaması

source: In the context of FRC, AprilTags are useful for helping your robot know where it is at on the field, so it can align itself to some goal position.
tr_tr: FRC şartlarında, AprilTag'ler, robotunuzun sahada nerede olduğunu bilmesine yardımcı olmak için yararlıdır, böylece robotunuzu bir hedef konumuna hizalayabilir.

source: AprilTags have been in development since 2011, and have been refined over the years to increase the robustness and speed of detection.
tr_tr: AprilTag'ler 2011'den beri geliştirilmektedir ve saptama sağlamlığını ve hızını artırmak için yıllar içinde geliştirilmiştir.

source: `Starting in 2023, FIRST is providing a number of tags, <https://www.firstinspires.org/robotics/frc/blog/2022-2023-approved-devices-rules-preview-and-vision-target-update>`__ scattered throughout the field, each at a known :term:`pose`.
tr_tr: 2023'ten itibaren FIRST, bir dizi etiket sağlıyor. <https://www.firstinspires.org/robotics/frc/blog/2022-2023-approved-devices-rules-preview-and-vision-target-update>`__alana dağılmış, her biri bilinen bir :term`poz`da.

source: All of the tags are from the 16h5 family.
tr_tr: Etiketlerin tamamı 16h5 ailesindendir.

source: Many of the pictures in this documentation are from the 36h11 family, which are similar (but not identical) to the 16h5 actually in use for FRC. All the underlying concepts are the same.
tr_tr: Bu belgedeki resimlerin çoğu, aslında FRC için kullanılan 16h5'e benzeyen (ancak aynı olmayan) 36h11 ailesindendir. Tüm temel kavramlar aynıdır.

source: While there are :math:`2^{16} = 65536` theoretical possible tags, only 30 are actually used. These are chosen to:
tr_tr: :math:`2^{16} = 65536` teorik olası etiket varken aslında sadece 30 tanesi kullanılmaktadır. Bunlar şu sebepler için seçilir:

source: Be robust against some bit flips (IE, issues where a bit has its color incorrectly identified).
tr_tr: Bazı bit çevirmelerine karşı dikkatli olun (IE, bir bitin renginin yanlış tanımlandığı sorunlar).

source: Not involve "simple" geometric patterns likely to be found on things which are not tags. (IE, squares, stripes, etc.)
tr_tr: Etiket olmayan şeylerde bulunması muhtemel "basit" geometrik desenleri içermez. (IE, kareler, çizgiler vb.)

source: Ensure the geometric pattern is asymmetric enough that you can always figure out which way is up.
tr_tr: Geometrik desenin, hangi yolun yukarı olduğunu her zaman anlayabilmeniz için yeterince asimetrik olduğundan emin olun.

source: All tags will be printed such that the tag's main "body" is 6 inches in length.
tr_tr: Tüm etiketler, etiketin ana "gövdesi" 6 inç uzunluğunda olacak şekilde yazdırılacaktır.

source: Diagram showing the dimensions of an FRC AprilTag fiducial target.
tr_tr: Bir FRC AprilTag referans hedefinin boyutlarını gösteren diyagram.

source: For home usage, tag files may be printed off and placed around your practice area. Mount them to a rigid backing material to ensure the tag stays flat, as the processing algorithm assumes the tags are flat.
tr_tr: Evde kullanım için, etiket dosyalarının çıktısı alınabilir ve çalışma alanınızın etrafına yerleştirilebilir. İşleme algoritması etiketlerin düz olduğunu varsaydığından, etiketin düz kalmasını sağlamak için bunları sert bir destek malzemesine monte edin.

source: Software Support
tr_tr: Yazılım Desteği

source: WPILib has forked the repository to add new features for FRC. These include:
tr_tr: WPILib, FRC için yeni özellikler eklemek üzere depoyu ayırdı. Bunlar içerilir:

source: Building the source code for common FRC targets, including the roboRIO and Raspberry Pi.
tr_tr: Raspberry Pi ve roboRIO dahil olmak üzere , yaygın FRC hedefleri için kaynak kodu oluşturmak

source: Adding Java Native Interface (JNI) support to allow invoking its functionality from Java
tr_tr: Java'dan işlevselliğini çağırmaya izin vermek için Java Yerel Arayüz (JNI) desteği ekleme

source: Gradle & Maven publishing support
tr_tr: Gradle & Maven yayınlama desteği

source: Work in this library is still ongoing, this list may change in the future.
tr_tr: Bu kütüphanedeki çalışmalar hala devam ediyor , bu liste gelecekte değişebilir.

source: Processing Technique
tr_tr: İşleme Tekniği

source: While most FRC teams should not have to implement their own code to identify AprilTags in a camera image, it is useful to know the basics of how the underlying libraries function.
tr_tr: Çoğu FRC ekibinin bir kamera görüntüsünde AprilTag'leri tanımlamak için kendi kodlarını uygulaması gerekmese de, temeldeki kitaplıkların nasıl çalıştığının temellerini bilmek yararlıdır.

source: Original Image
tr_tr: Gerçek görüntü
