Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/yearly-overview/known-issues.po
Languages: es_mx, zh_cn

source: Known Issues
es_mx: Problemas Conocidos
zh_cn: 已知问题

source: This article details known issues (and workarounds) for FRC\ |reg| Control System Software.
es_mx: Este artículo detalla problemas conocidos (y soluciones) para el Software de Control de Sistema de FRC\ |reg|
zh_cn: 本文详细介绍了FRC\ |reg|控制系统软件的已知问题（和解决方法）。

source: Open Issues
es_mx: Problemas Abiertos
zh_cn: 公开的问题

source: Failed to change IP Address in Radio Configuration
zh_cn: 无法在无线电配置中更改 IP 地址

source: **Issue**
zh_cn: **问题**

source: The following error message may appear when configuring the radio ``Bridge configuration failed: Failed to change IP Address...``. This is due to a change in behavior in java versions 8u291 and 11.0.11.
zh_cn: 配置无线电时可能会出现以下错误消息``Bridge configuration failed: Failed to change IP Address...``。这是由于 Java 版本 8u291 和 11.0.11 中的行为发生了变化。

source: **Workaround**
zh_cn: **解决方法**

source: Install Java from the `WPILib 2020.3.2 installer <https://github.com/wpilibsuite/allwpilib/releases/tag/v2020.3.2>`__ . It is only necessary to install the Java JDK/JRE as shown below. The radio tool will use this version instead of any other system installed versions of java. This will take approximately 600 mb of disk space.
zh_cn: 从 `WPILib 2020.3.2 安装程序 <https://github.com/wpilibsuite/allwpilib/releases/tag/v2020.3.2>`__ 安装 Java。只需要安装Java JDK/JRE，如下所示。无线电工具将使用此版本而不是任何其他系统安装的 java 版本。这将需要大约 600 MB 的磁盘空间。

source: As the radio tool is unchanged from 2020, it will use the WPILib java installation from 2020, not 2021, so it is necessary to use the 2020 installer.
zh_cn: 由于radio工具自2020年起没有变化，将使用2020年的WPILib java安装，而不是2021年，所以需要使用2020年的安装程序。

source: WPILib 2020.3.2 installer showing only Java JDK/JRE checked.
zh_cn: WPILib 2020.3.2 安装程序仅显示选中的 Java JDK/JRE。

source: No such host is known in the WPILib Installer
es_mx: No se conoce dicho host en el instalador de WPILib
zh_cn: WPILib 安装程序中没有这样的主机

source: The following error message will show up when downloading VS Code with WPILib Installer version ``2021.2.1`` or earlier **or** version ``2021.2.2`` that was downloaded before ``3/24/2021``.
es_mx: El siguiente mensaje de error aparecerá cuando se descargue VS Code con la versión del instalador de WPILib ``2021.2.1`` o anterior **o** la versión ``2021.2.2`` que se haya descargado antes del ``3/24/2021``.
zh_cn: 使用 WPILib 安装程序版本 ``2021.2.1`` 或更早的 ** 或** 版本 ``2021.2.2`` 在 ``3/24/2021`` 之前下载 VS Code 时，将显示以下错误消息.

source: This is due to the VS Code download URL being changed. A hotfix has been published and users should redownload the ``2021.2.2`` release or later. This fix can be downloaded `here <https://github.com/wpilibsuite/allwpilib/releases>`__.
es_mx: Esto se debe a que la URL de descarga de VS Code ha cambiado. Se ha publicado una corrección y los usuarios deben volver a descargar la versión ``2021.2.2`` o posterior. Esta corrección puede descargarse ``aquí <https://github.com/wpilibsuite/allwpilib/releases>`__.
zh_cn: 这是由于更改了 VS Code 下载 URL。一个修补程序已经被下载，用户应重新下载 ``2021.2.2`` 版本或更高版本。此修复程序可以在`这里下载<https://github.com/wpilibsuite/allwpilib/releases>`__。

source: Invalid build due to missing GradleRIO
es_mx: Construcción inválida debido a la falta de GradleRIO
zh_cn: 由于缺少 GradleRIO 导致构建无效

source: **Issue:** Rarely, a user's Gradle cache will get broken and they will get shown errors similar to the following:
es_mx: **Problema:** En raras ocasiones, el caché de Gradle de un usuario se rompe y se muestran errores similares a los siguientes:
zh_cn: **问题：** 用户的 Gradle 缓存很少会损坏，并且会显示类似于以下内容的错误：

source: **Workaround:**
es_mx: **Solución Alternativa:**
zh_cn: **解决方法：**

source: Delete your Gradle cache located under ``~$USER_HOME/.gradle``. Windows machines may need to enable the ability to `view hidden files <https://support.microsoft.com/en-us/windows/view-hidden-files-and-folders-in-windows-10-97fbc472-c603-9d90-91d0-1166d1d9f4b5>`__. This issue has only shown up on Windows so far. Please `report <https://github.com/wpilibsuite/frc-docs/issues/new>`__ this issue if you get it on an alternative OS.
es_mx: Elimina tu caché de Gradle ubicado en ``~$USER_HOME/.gradle``. Las máquinas Windows pueden necesitar habilitar la capacidad de `ver archivos ocultos <https://support.microsoft.com/en-us/windows/view-hidden-files-and-folders-in-windows-10-97fbc472-c603-9d90-91d0-1166d1d9f4b5>`__. Este problema sólo ha aparecido en Windows hasta ahora. Por favor, `informe <https://github.com/wpilibsuite/frc-docs/issues/new>`__ este problema si lo tiene en un sistema operativo alternativo.
zh_cn: 删除位于``~$USER_HOME/.gradle`` 下的 Gradle 缓存。 Windows 可能需要启用查看隐藏文件的能力 <https://support.microsoft.com/en-us/windows/view-hidden-files-and-folders-in-windows-10-97fbc472-c603- 9d90-91d0-1166d1d9f4b5>`__。到目前为止，此问题仅出现在 Windows 上。如果您在其他操作系统上遇到此问题，请向 <https://github.com/wpilibsuite/frc-docs/issues/new>`__ 报告这个问题。

source: Chinese characters in Driver Station Log
es_mx: Caracteres Chinos al iniciar la Driver Station
zh_cn: Driver Station日志中的汉字

source: **Issue:** Rarely, the driver station log will show Chinese characters instead of the English text. This appears to only happen when Windows is set to a language other then English.
es_mx: **Problema:** Rara vez, al iniciar la driver station se mostrarán caracteres Chinos en vez de texto en Inglés. Esto aparece solo cuando Windows esta configurado en otro idioma que no es Inglés.
zh_cn: **问题：**极少情况下，driver station日志会显示中文字符而不是英文文本。仅当Windows设置为英语以外的其他语言时，才会出现这种情况。

source: Chinese character appearing in the Driver Station log window.
zh_cn: 机器操控台日志窗口中出现中文字符。

source: **Workaround:** There are two known workarounds:
es_mx: **Solución alternativa:** Hay dos soluciones alternativas conocidas:
zh_cn: **解决方法：**有两种已知的解决方法：

source: Copy and paste the Chinese characters into notepad, and the English text will be shown.
es_mx: Copie y pegue los caracteres Chinos en un bloc de notas, y el texto en Inglés se mostrará.
zh_cn: 将中文字符复制并粘贴到记事本中，将显示英文文本。

source: Temporarily change the Windows language to English.
es_mx: Cambie temporalmente el lenguaje de Windows a Inglés.
zh_cn: 暂时将Windows语言更改为英语。

source: C++ Intellisense - Files Open on Launch Don't Work Properly
es_mx: C++ Intellisense - Los Archivos Abiertos al Iniciarse No Funcionan Correctamente
zh_cn: C ++ Intellisense-启动时打开的文件无法正常工作

source: **Issue:** In C++, files open when VS Code launches will have issues with Intellisense showing suggestions from all options from a compilation unit and not just the appropriate ones or not finding header files. This is a bug in VS Code.
es_mx: **Problema:** En C++, los archivos que se abren cuando se inicia VS Code tendrán problemas con Intellisense mostrando sugerencias de todas las opciones desde una unidad de compilación y no solo las apropiadas o no encontrando archivos de encabezado. Este es un error en VS Code.
zh_cn: **问题：**在C++中，当VS Code启动时打开的文件将出现“Intellisense”功能异常，显示来自编译单元的所有选项的建议而不仅仅是适当的选项，或者找不到头文件。这是VS Code中的一个bug。

source: Close all files in VS Code, but leave VS Code open
es_mx: Cierre todos los archivos en VS Code, pero deje VS Code abierto
zh_cn: 关闭VS Code中的所有文件，但保持VS Code处于打开状态

source: Delete c_cpp_properties.json file in the .vscode folder, if it exists
es_mx: Elimine el archivo c_cpp_properties.json en la carpeta .vscode, si existe
zh_cn: 如果存在，删除 .vscode文件夹中的c_cpp_properties.json文件

source: Run the "Refresh C++ Intellisense" command in vscode.
es_mx: Corra el comando "Refresh C++ Intellisense" en vscode.
zh_cn: 在VS Code中运行“Refresh C++Intellisense”指令

source: In the bottom right you should see something that looks like a platform (linuxathena or windowsx86-64 etc). If it’s not linuxathena click it and set it to linuxathena (release)
es_mx: En la esquina inferior derecha debe ver algo que se vea como una plataforma (linuxathena o windowsx86-64 etc). Si no es linuxathena de click y configure a linuxathena (lanzamiento)
zh_cn: 在右下角，您应该会看到类似于平台的东西（ linuxathna或windowsx86-64等）。如果不是linuxastina，请单击它并将其设置为linuxastina(release)。

source: Wait ~1 min
es_mx: Espere ~1 min
zh_cn: 等待〜1分钟

source: Open the main cpp file (not a header file). Intellisense should now be working
es_mx: Abra el archivo main cpp (no el archivo de título). Intellisense debe de funcionar ahora
zh_cn: 打开主cpp文件（而不是头文件）。 Intellisense现在应该可以工作了

source: SmartDashboard and Simulation fail to launch on Windows N Editions
es_mx: SmartDashboard y Simulation fallan al iniciar en Windows N Editions
zh_cn: SmartDashboard和Simulation无法在Windows N版本上启动

source: **Issue:** WPILib code using CSCore (dashboards and simulated robot code) will fail to launch on Education N editions of Windows.
es_mx: **Problema:** Código de WPILib usando CSCore (dashboards y código simulados de robot) van a fallar al iniciar en versiones Education N de Windows.
zh_cn: **问题：**使用CSCore（仪表盘和模拟机器人代码）的WPILib代码将无法在Windows的Education N版本上启动。

source: **Solution:** Install the `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__
es_mx: **Solución:** Intalar el `Media Feature Pack <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__
zh_cn: **解决方案：**安装`媒体功能包 <https://www.microsoft.com/en-us/software-download/mediafeaturepack>`__

source: NetworkTables Interoperability
es_mx: Interoperabilidad de NetworkTables
zh_cn: NetworkTables互用性

source: There is currently an issue with inter-operating C++/Java :term:`NetworkTables` clients (dashboards or co-processors) with LabVIEW servers (LV robot code). In some scenarios users will see updates from one client fail to be replicated across to other clients (e.g. data from a co-processor will not be properly replicated out to a dashboard). Data still continues to return correctly when accessed by code on the server.
es_mx: Actualmente hay un problema con la interoperabilidad de los clientes C++/Java :term:`NetworkTables` (dashboards o coprocesadores) con los servidores de LabVIEW (código del robot LV). En algunos escenarios, los usuarios verán que las actualizaciones de un cliente no se replican a otros clientes (por ejemplo, los datos de un coprocesador no se replicarán correctamente en la dashboard). Los datos siguen regresando correctamente cuando se accede a ellos mediante código en el servidor.
zh_cn: 当前存在与 LabVIEW 服务器（LV 机器人代码）互操作 C++/Java 客户端（仪表板或协处理器）的问题。在某些情况下，用户会看到来自一个客户端的更新无法复制到其他客户端（例如，来自协处理器的数据无法正确复制到仪表板）。当被服务器上的代码访问时，数据仍然继续正确返回。

source: **Workaround**: Write code on the server to mirror any keys you wish to see on other clients (e.g. dashboards) to a separate key. For example, if you have a key named ``targetX`` being published by a co-processor that you want to show up on a dashboard, you could write code on the robot to read the key and re-write it to a key like ``targetXDash``.
es_mx: **Solución**: Escriba el código en el servidor para reflejar cualquier clave que desee ver en otros clientes (por ejemplo, dashboards) en una clave separada. Por ejemplo, si tiene una clave llamada ``targetX`` que está siendo publicada por un coprocesador y desea que aparezca en la dashboard, puede escribir código en el robot para leer la clave y volver a escribirla en una clave como ``targetXDash``.
zh_cn: **解决方法**：在服务器上编写代码，将您希望在其他客户端（例如仪表板）上看到的任何键镜像到各自的键。例如，如果您有一个在协处理器上名为targetX的键，当你想在仪表板上显示它时，你可以在机器人上编写代码来读取这个键并将其重新写入一个类似targetXDash的键在仪表板上显示。

source: Fixed in WPILib 2021.2.2
es_mx: Corregido en WPILib 2021.2.2
zh_cn: 在WPILib 2021.2.2中已修复

source: macOS Mojave Simulation Crash
es_mx: Bloqueo de Simulación de macOS Mojave
zh_cn: macOS Mojave模拟崩溃

source: **Issue:** The simulation GUI fails to launch on macOS Mojave (10.14.x) due to a dynamic linker error (example below):
es_mx: **Problema:** La Interfaz Gráfica del Usuario de la simulación no se inicia en macOS Mojave (10.14.x) debido a un error del enlazador dinámico (ejemplo a continuación):
zh_cn: **问题：**由于动态链接器错误（以下示例），模拟GUI无法在macOS Mojave（10.14.x）上启动：（例子如下）

source: **Solution:** Upgrade to WPILib 2021.2.2 by using the latest installer or the "Check for WPILib Updates" feature in VS Code.
es_mx: **Solución:** Actualice a WPILib 2021.2.2 utilizando el instalador más reciente o la función "Buscar actualizaciones de WPILib" en VS Code.
zh_cn: **解决方案：**通过使用最新的安装程序或VS Code中的“检查WPILib更新”功能，升级到WPILib 2021.2.2。

source: Fixed in Game Tools 2021 f1
es_mx: Game Tools fijos 2021 f1
zh_cn: 已在Game Tools 2021 f1中修复

source: 2021_v3.0 Imaging Issue
es_mx: 2021_v3.0 Problema de Imagen
zh_cn: 2021_v3.0映像问题

source: **Issue:** An issue was discovered with the roboRIO image version 2021_v3.1 included in the initial release of the 2021 NI Game Tools that prevents successful imaging of roboRIOs.
es_mx: **Problema:** Se descubrió un problema con la versión de imagen de la roboRIO 2021_v3.1 incluida en el lanzamiento inicial de las Herramientas de Juego de NI 2021 que evita la generación de imágenes exitosas de la roboRIO.
zh_cn: **问题：** 在2021Ni Game Tools的V3.1中发现了一个问题，包括初始版本也有阻止roboRIO的成功映像这一问题。

source: **Solution:** Teams that downloaded the 2021 Game Tools installer prior to the morning of January 11, 2021 should :doc:`re-download and re-install</docs/zero-to-robot/step-2/frc-game-tools>` the latest installer (no need to uninstall first). The new version is 2021 f1. Users with the correct version installed will not see 2021_v3.1 as an option in the roboRIO imaging tool. Once the new version is installed, the roboRIO can be imaged with 2021_v3.0.
es_mx: **Solutción:** Los equipos que descargaron el instalador de las Herramientas de Juego del 2021 antes de la mañana del 11 de enero de 2021 deben :doc:`volver a descargar e instalar</docs/zero-to-robot/step-2/frc-game-tools>` el instalador más reciente (no es necesario desinstalarlo primero). La nueva versión es 2021 f1. Los usuarios con la versión correcta instalada no verán 2021_v3.1 como una opción en la herramienta de imágenes roboRIO. Una vez que se instala la nueva versión, se puede crear una imagen de la roboRIO con 2021_v3.0.
zh_cn: **解决方案：**在2021年1月11日上午之前下载了2021 Game Tools安装程序的团队应该重新下载并重新安装最新版本的安装程序（无需先卸载）。新版本是2021 f1。安装了正确版本的用户不会在roboRIO映像工具中看到2021_v3.1作为选项。安装新版本后，可以使用2021_v3.0对roboRIO进行映像。
