Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/creating-robot-program.po
Languages: es_mx

source: Creating a Robot Program
es_mx: Creando un programa para el robot

source: Once everything is installed, we're ready to create a robot program. WPILib comes with several templates for robot programs. Use of these templates is highly recommended for new users; however, advanced users are free to write their own robot code from scratch.
es_mx: Una vez que todo esté instalado, estamos listos para crear un programa para el robot. WPILib viene con una serie de platillas para los programas del robot. El uso de estas plantillas es altamente recomendado para los nuevos usuarios; sin embargo, usuarios avanzados son libres de hacer su código desde cero.

source: Choosing a Base Class
es_mx: Escogiendo una Clase Base

source: To start a project using one of the WPILib robot program templates, users must first choose a base class for their robot. Users subclass these base classes to create their primary :code:`Robot` class, which controls the main flow of the robot program. There are three choices available for the base class:
es_mx: Para iniciar un proyecto usando una de las plantillas de programa de robot de WPILib, los usuarios deben elegir una clase base para su robot. Los usuarios ponen como subclase estas clases base para crear su clase primaria para :code:`Robot`, que controla el flujo principal del programa del robot. Existen tres opciones disponibles para la clase base:

source: Documentation: `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/TimedRobot.html>`__ - `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TimedRobot.html>`__
es_mx: Documentación: `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/TimedRobot.html>`__ - `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1TimedRobot.html>`__

source: Source: `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/TimedRobot.java>`__ - `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cpp/TimedRobot.cpp>`__
es_mx: Fuente: `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/TimedRobot.java>`__ - `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cpp/TimedRobot.cpp>`__

source: The :code:`TimedRobot` class is the the base class recommended for most users. It provides control of the robot program through a collection of :code:`init()` and :code:`periodic()` methods, which are called by WPILib during specific robot states (e.g. autonomous or teleoperated). The ``TimedRobot`` class also provides an example of retrieving autonomous routines through SendableChooser (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/smartdashboard/SendableChooser.html>`__/ `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1SendableChooser.html>`__
es_mx: La clase :code:`TimedRobot` es la clase base recomendada para la mayoría de los usuarios. Proporciona control sobre el programa del robot a través de un conjunto de métodos, :code:`init()` y :code:`periodic()` que son llamadas por WPILib durante estados específicos del robot (ej.: autónomo o tele operado). La clase ``TimedRobot`` también proporciona un ejemplos de recuperar rutinas de autónomo a través de SendableChooser (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/smartdashboard/SendableChooser.html>`__/ `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1SendableChooser.html>`__

source: A `TimedRobot Skeleton` template is available that removes some informative comments and the autonomous example. You can use this if you're already familiar with `TimedRobot`. The example shown below is of `TimedRobot Skeleton`.
es_mx: Hay disponible una plantilla `TimedRobot Skeleton` que elimina algunos comentarios informativos y el ejemplo autónomo. Puede usar esto si ya está familiarizado con `TimedRobot`. El ejemplo que se muestra a continuación es de `TimedRobot Skeleton`.

source: Periodic methods are called every 20 ms by default. This can be changed by calling the superclass constructor with the new desired update rate.
es_mx: Los métodos periódicos son llamados cada 20 ms por defecto. Esto puede cambiarse llamando la superclase constructor con la nueva actualización deseada.

source: Changing your robot rate can cause some unintended behavior (loop overruns). Teams can also use `Notifiers <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Notifier.html>`__ to schedule methods at a custom rate.
es_mx: Cambiar la velocidad de su robot puede causar algún comportamiento no deseado (sobre ejecuciones de bucle). Los equipos también pueden usar `Notifiers <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Notifier.html>` __ para programar métodos a un ritmo personalizado.

source: Documentation: `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/RobotBase.html>`__ - `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1RobotBase.html>`__
es_mx: Documentación: `Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/RobotBase.html>`__ - `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1RobotBase.html>`__

source: Source: `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/RobotBase.java>`__ - `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cppcs/RobotBase.cpp>`__
es_mx: Fuente: `Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibj/src/main/java/edu/wpi/first/wpilibj/RobotBase.java>`__ - `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibc/src/main/native/cppcs/RobotBase.cpp>`__

source: The :code:`RobotBase` class is the most minimal base-class offered, and is generally not recommended for direct use. No robot control flow is handled for the user; everything must be written from scratch inside the :code:`startCompetition()` method. The template by default showcases how to process the different operation modes (teleop, auto, etc).
es_mx: La clase :code:`RobotBase` es la clase base más mínima que se ofrece y, por lo general, no se recomienda para uso directo. No se maneja ningún flujo de control del robot para el usuario; todo debe escribirse desde cero dentro del método :code:`startCompetition()`. La plantilla por defecto muestra cómo procesar los diferentes modos de operación (teleop, auto, etc.).

source: A ``RobotBase Skeleton`` template is available that offers a blank ``startCompetition()`` method.
es_mx: Hay disponible una plantilla `` RobotBase Skeleton`` que ofrece un método ``startCompetition ()`` en blanco.

source: Command Robot
es_mx: Robot a base de comandos

source: Teams using ``Command Robot`` or ``Old Command Robot`` should see the :ref:`Command-Based Programming Tutorial <docs/software/commandbased/index:Command-Based Programming>` or :ref:`[Old] Command Based Programming <docs/software/old-commandbased/index:[Old] Command Based Programming>`.
es_mx: Los equipos que utilicen ``Command Robot`` o ``Old Command Robot`` deberían ver :ref:`Tutorial de programación basada en comandos <docs/software/commandbased/index:Command-Based Programming>` o :ref:`` Programación a base de comandos [Antiguo] <docs/software/old-commandbased/index:[Old] Command Based Programming>`.

source: Teams using a :ref:`Romi <docs/romi-robot/index:Getting Started with Romi>` should use the ``Romi - Timed`` or ``Romi - Command Bot`` template.
es_mx: Los equipos que estén utilizando :ref:`Romi <docs/romi-robot/index:Getting Started with Romi>` deberían de utilizar la plantilla ``Romi - Timed`` o ``Romi - Command Bot``.

source: The ``Romi - Timed`` template provides a ``RomiDrivetrain`` class that exposes an ``arcadeDrive(double xaxisSpeed, double zaxisRotate)`` method. It's up to the user to feed this arcadeDrive function.
es_mx: La plantilla ``Romi - Timed`` proporciona la clase ``RomiDrivetrain`` que expone un método ``arcadeDrive(double xaxisSpeed, double zaxisRotate)`` . Depende del usuario alimentar esta función arcadeDrive.

source: This class also provides functions for retrieving and resetting the Romi's onboard encoders.
es_mx: Esta clase también provee funciones para recuperar y restablecer los encoders integrados de Romi.

source: Romi - Command Bot
es_mx: Romi - Robot a base de comandos

source: The ``Romi - Command Bot`` template provides a ``RomiDrivetrain`` subsystem that exposes an ``arcadeDrive(double xaxisSpeed, double zaxisRotate)`` method. It's up to the user to feed this arcadeDrive function.
es_mx: La plantilla ``Romi - Command Bot`` proporciona un subsistema ``RomiDrivetrain`` que expone un método ``arcadeDrive (double xaxisSpeed, double zaxisRotate)`` Depende del usuario alimentar esta función arcadeDrive.

source: This subsystem also provides functions for retrieving and resetting the Romi's onboard encoders.
es_mx: Este subsistema también proporciona funciones para recuperar y restablecer los codificadores integrados de Romi.

source: Not Using a Base Class
es_mx: No usando una clase base

source: If desired, users can omit a base class entirely and simply write their program in a :code:`main()` method, as they would for any other program. This is *highly* discouraged - users should not "reinvent the wheel" when writing their robot code - but it is supported for those who wish to have absolute control over their program flow.
es_mx: Si así lo desean, los usuarios pueden omitir una clase base entera y simplemente escribir el programa en un método :code:`main()`, como sería para cualquier otro programa. Esto es *altamente* no recomendado - los usuarios no deberían "reinventar la rueda" cuando escriben el código de su robot - pero esto está soportado para quienes quieren tener control absoluto en el flujo de su programa.

source: Users should *not* modify the :code:`main()` method of a robot program unless they are absolutely sure of what they are doing.
es_mx: Los usuarios *no* deberían modificar el método :code:`main()` de un programa de robot a menos que estén absolutamente seguros de lo que están haciendo.

source: Creating a New WPILib Project
es_mx: Creando un Proyecto Nuevo de WPILib

source: Once we've decided on a base class, we can create our new robot project. Bring up the Visual Studio Code command palette with :kbd:`Ctrl+Shift+P`:
es_mx: Una vez que nos hemos decidido por una clase base, podemos crear nuestro nuevo proyecto para el robot. Abra la paleta de comandos de Visual Studio Code con :kbd:`Ctrl+Shift+P`:

source: Then, type "WPILib" into the prompt. Since all WPILib commands start with "WPILib," this will bring up the list of WPILib-specific VS Code commands:
es_mx: Después, escriba "WPILib" en el aviso. Dado que todos los comandos de WPILib empiezan con "WPILib", esto trae una lista de comandos específicos de WPILib VS Code:

source: Now, select the :guilabel:`Create a new project` command:
es_mx: Ahora, seleccione el comando :guilabel:`Create a new project`:

source: This will bring up the "New Project Creator Window:"
es_mx: Esto va a abrir la "New Project Creator Window:"

source: The elements of the New Project Creator Window are explained below:
es_mx: Los elementos de la New Project Creator Window o Ventana del Creador de Nuevo Proyecto está explicado abajo:

source: **Project Type**: The kind of project we wish to create. This can be an example project, or one of the project templates provided by WPILib. Templates exist for each of the robot base classes. Additionally, a template exists for :ref:`Command-based <docs/software/commandbased/what-is-command-based:What is "command-based" programming?>` projects, which are built on the :code:`TimedRobot` base class but include a number of additional features - this type of robot program is highly recommended for new teams.
es_mx: **Tipo de Proyecto**: El tipo de proyecto que queremos crear. Esto puede ser un proyecto de ejemplo, o uno de los proyectos modelo brindados por WPILib. Los modelos existen para cada clase de base del robot. Adicionalmente, un modelo existe para proyectos :ref:`Command-based <docs/software/commandbased/what-is-command-based:What is "command-based" programming?>`, que están hechos en la clase base :code:`TimedRobot` pero incluye un número de características adicionales - este tipo de programa de robot es altamente recomendado para equipos nuevos.

source: **Language**: This is the language (C++ or Java) that will be used for this project.
es_mx: **Lenguaje**: Este es el lenguaje (C++ o Java) que será usado en el proyecto.

source: **Base Folder**: If this is a template project, this specifies the type of template that will be used.
es_mx: **Carpeta base**: Si se trata de un proyecto de plantilla, esto especifica el tipo de plantilla que se utilizará.

source: **Project Location**: This determines the folder in which the robot project will be located.
es_mx: **Localización del Proyecto**: Esto determina la carpeta en la que el proyecto del robot estará localizado.

source: **Project Name**: The name of the robot project. This also specifies the name that the project folder will be given if the Create New Folder box is checked.
es_mx: **Nombre del Proyecto**: El nombre del proyecto del robot. Esto también especifica el nombre que la carpeta del proyecto tendrá si la caja de Crear Nueva Carpeta está marcada.

source: **Create a New Folder**: If this is checked, a new folder will be created to hold the project within the previously-specified folder. If it is *not* checked, the project will be located directly in the previously-specified folder. An error will be thrown if the folder is not empty and this is not checked.
es_mx: **Cree una Nueva Carpeta**: Si se marca esta casilla, se creará una nueva carpeta para mantener el proyecto dentro de la carpeta previamente especificada. Si se marca *no*, el proyecto se ubicará directamente en la carpeta previamente especificada. Se producirá un error si la carpeta no está vacía y no está marcada.

source: **Team Number**: The team number for the project, which will be used for package names within the project and to locate the robot when deploying code.
es_mx: **Número del Equipo**: El número del equipo para la carpeta, que es el que se usará para empacar nombres con el proyecto y localizarlo en el robot cuando se corra el código.

source: **Enable Desktop Support**: Enables unit test and simulation. While WPILib supports this, third party software libraries may not. If libraries do not support desktop, then your code may not compile or may crash. It should be left unchecked unless unit testing or simulation is needed and all libraries support it.
es_mx: **Habilitar soporte de escritorio *: Habilita la prueba unitaria y la simulación. Si bien WPILib admite esto, es posible que las bibliotecas de software de terceros no. Si las bibliotecas no son compatibles con el escritorio, es posible que su código no se compile o se bloquee. Debe dejarse sin marcar a menos que se necesiten pruebas unitarias o simulación y todas las bibliotecas lo admitan.

source: Once all the above have been configured, click "Generate Project" and the robot project will be created.
es_mx: Una vez que todo lo de arriba está configurado, de click en "Generar Proyecto" y el proyecto del robot será creado.

source: Any errors in project generation will appear in the bottom right-hand corner of the screen.
es_mx: Ningún error en la generación de proyecto debe aparecer en la esquina inferior derecha de la pantalla.

source: An example after all options are selected is shown below.
es_mx: Un ejemplo de todas las opciones seleccionadas se muestra abajo.

source: Opening The New Project
es_mx: Abriendo El Nuevo Proyecto

source: After successfully creating your project, VS Code will give the option of opening the project as shown below. We can choose to do that now or later by typing :kbd:`Ctrl+K` then :kbd:`Ctrl+O` (or just :kbd:`Command+O` on macOS) and select the folder where we saved our project.
es_mx: Después de crear su proyecto satisfactoriamente, VS Code dará la opción de abrir el proyecto como se muestra abajo. Podemos elegir hacer eso ahora o después escribiendo :kbd:`Ctrl-K` después :kbd:`Ctrl-O` (o solo :kbd:`Comando+O` en macOS) y seleccionar la carpeta donde guardamos nuestro proyecto.

source: Once opened we will see the project hierarchy on the left. Double clicking on the file will open that file in the editor.
es_mx: Una vez que abrimos, vamos a ver el proyecto jerarquizado a la izquierda. Dando doble click en el archivo abrirá ese archivo en el editor.

source: C++ Configurations (C++ Only)
es_mx: Configuraciones de C++ (Solo C++)

source: For C++ projects, there is one more step to set up IntelliSense. Whenever we open a project, we should get a pop-up in the bottom right corner asking to refresh C++ configurations. Click "Yes" to set up IntelliSense.
es_mx: Para proyectos C++, hay un paso más para configurar IntelliSense. Cada vez que abrimos un proyecto, debería aparecernos una ventana emergente en la esquina inferior derecha pidiendo actualizar las configuraciones de C++. Haga clic en "Yes" para configurar IntelliSense
