Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/importing-gradle-project.po
Languages: es_mx, fr_ca

source: Importing a Gradle Project
es_mx: Importar un proyecto de Gradle
fr_ca: Importation d’un projet Gradle

source: Due to changes in the project, it is necessary to update the build files for a previous years Gradle project. It is also necessary to import vendor libraries again, since last year's vendor libraries must be updated to be compatible with this year's projects.
es_mx: Debido a cambios en el proyecto, es necesario actualizar los archivos de compilación de un proyecto Gradle de años anteriores. También es necesario importar de nuevo las librerías de proveedores, ya que las librerías de proveedores del año pasado deben ser actualizadas para que sean compatibles con los proyectos de este año.
fr_ca: En raison de changements dans le projet, il est nécessaire de mettre à jour les fichiers de compilation pour un projet Gradle des années précédentes. Il est également nécessaire d’importer à nouveau les librairies de fournisseurs, puisque les librairies de fournisseurs de l’année dernière doivent être mises à jour pour être compatibles avec les projets de l'année en cours.

source: Automatic Import
es_mx: Importación automática
fr_ca: Importation automatique

source: To make it easy for teams to import previous years gradle projects into the current year's framework, WPILib includes a wizard for importing previous years projects into VS Code. This will generate the necessary gradle components and load the project into VS Code. In place upgrades are not supported. The importer automatically imports the old or new command framework 3rd party library (which ever one was used on the imported project).
es_mx: Para facilitar a los equipos la importación de proyectos gradle de años anteriores en el marco del año actual, WPILib incluye un asistente para importar proyectos de años anteriores en VS Code. Esto generará los componentes gradle necesarios y cargará el proyecto en VS Code. Las actualizaciones in situ no están soportadas. El importador importa automáticamente la biblioteca del 3er marco de comandos antiguo o nuevo (el que se haya utilizado en el proyecto importado).
fr_ca: Pour faciliter aux équipes l’importation de projets gradle des années précédentes dans l'infrastructure logicielle de l’année en cours, WPILib inclut un assistant pour importer des projets des années précédentes dans VS Code. Cet assistant générera les composants gradle nécessaires et chargera le projet dans Vs Code. Les mises à niveau en place ne sont pas prises en charge. L’importateur importe automatiquement l’ancienne ou la nouvelle infrastructure orientée commande de la librairie tierce (quelle que soit celle qui a été utilisée dans le projet importé).

source: The import process copies your project source files from the current directory to a new directory and completely regenerates the gradle files. If you made non-standard updates to the build.gradle, you will need to make those changes again. For this reason, in place upgrades are not supported. It is also necessary to import vendor libraries again, since last year's vendor libraries must be updated to be compatible with this year's projects.
es_mx: El proceso de importación copia los archivos fuente del proyecto desde el directorio actual a un nuevo directorio y regenera completamente los archivos de grados. Si ha hecho actualizaciones no estándar al build.gradle, tendrá que hacer esos cambios de nuevo. Por esta razón, no se admiten las actualizaciones. También es necesario volver a importar las librerías vendor, ya que las del año pasado deben ser actualizadas para que sean compatibles con el proyecto de este año.
fr_ca: Le processus d'importation copie les fichiers source de votre projet du répertoire actuel vers un nouveau répertoire et régénère complètement les fichiers gradle. Si vous avez effectué des mises à jour non standard sur build.gradle, vous devrez à nouveau effectuer ces modifications. Pour cette raison, les mises à niveau sur place ne sont pas prises en charge. Il est également nécessaire d'importer à nouveau les librairies des fournisseurs, car les librairies des fournisseurs de l'année dernière doivent être mises à jour pour être compatibles avec les projets de cette année.

source: The automatic import process is broken in version 2021.3.1. As a workaround, the project may be :ref:`manually imported <docs/software/vscode-overview/importing-gradle-project:Manual Import Process (2020 to 2021)>`.
fr_ca: La précédure d’importation automatique est interrompue dans la version 2021.3.1. Pour contourner ce problème, le projet peut être :ref:`importé manuellement <docs/software/vscode-overview/importing-gradle-project:Manual Import Process (2020 to 2021)>`.

source: Launching the Import Wizard
es_mx: Iniciar el asistente de importación
fr_ca: Lancement de l’Assistant d'Importation

source: When you open a previous year's project, you will be prompted to import that project. Click :guilabel:`yes`.
es_mx: Cuando abre un proyecto de un año previo, se le pedirá que se importe ese proyecto. Haga clic en :guilabel:`si`.
fr_ca: Lorsque vous ouvrez un projet de l'année précédente, vous serez invité à importer ce projet. Cliquez sur :guilabel:`yes`.

source: Alternately, you can chose to import it from the menu. Press :kbd:`Ctrl+Shift+P` and type "WPILib" or click the WPILib icon to locate the WPILib commands. Begin typing "Import a WPILib 2020 Gradle project" and select it from the dropdown as shown below.
es_mx: Alternativamente, puede elegir importarlo desde el menú. Presione :kbd:`Ctrl+Shift+P` y escriba "WPILib" o haga clic en el ícono de WPILib para localizar los comandos de WPILib. Empiece escribiendo "Importar proyecto WPILib 2020 Gradle" y selecciónelo del menú desplegable como se muestra a continuación.
fr_ca: Vous pouvez également choisir de l'importer à partir du menu. Appuyez sur :kbd:`Ctrl+Shift+P` et tapez "WPILib" ou cliquez sur l'icône WPILib pour localiser les commandes WPILib. Commencez à taper "Import a WPILib 2020 Gradle project" et sélectionnez-le dans la liste déroulante comme indiqué ci-dessous.

source: You'll be presented with the WPILib Project Importer window. This is similar to the process of creating a new project and the window and the steps are shown below. This window contains the following elements:
es_mx: Se le presentará la ventana Importador de proyectos de WPILib. Esto es similar al proceso de creación de un nuevo proyecto y la ventana y los pasos se muestran a continuación. Esta ventana contiene los siguientes elementos:
fr_ca: Il vous sera présenté la fenêtre WPILib Project Importer. Cette opération est similaire au processus de création d’un nouveau projet et la fenêtre ainsi que les étapes sont affichées ci-dessous. Cette fenêtre contient les éléments suivants :

source: **Gradle Project**: Selects the project to be imported. Users should select the build.gradle file in the root directory of the gradle project.
es_mx: **Proyecto Gradle**: Selecciona el proyecto que se va a importar. Los usuarios deben seleccionar el archivo build.gradle en el directorio raíz del proyecto gradle.
fr_ca: **Gradle Project**: Sélectionne le projet à importer. Les utilisateurs doivent sélectionner le fichier build.gradle dans le répertoire racine du projet gradle.

source: **Project Location**: This determines the folder in which the robot project will be located.
es_mx: **Ubicación del proyecto**: Esto determina la carpeta en la que se ubicará el proyecto del robot.
fr_ca: **Project Location**: Ce paramètre définit le dossier dans lequel le projet de robot sera situé.

source: **Project Name**: The name of the robot project. This also specifies the name that the project folder will be given if the Create New Folder box is checked. This must be a different directory from the original location.
es_mx: **Nombre del proyecto**: El nombre del proyecto del robot. Esto también especifica el nombre que se le dará a la carpeta del proyecto si la casilla Crear nueva carpeta está marcada. Debe ser un directorio diferente de la ubicación original.
fr_ca: **Project Name**: Ce paramètre définit le nom du projet de robot. Il spécifie également le nom que le dossier de projet recevra si la zone "Create New Folder" est cochée. Il doit s’agir d’un répertoire différent de l’emplacement d’origine.

source: **Create a New Folder**: If this is checked, a new folder will be created to hold the project within the previously-specified folder. If it is *not* checked, the project will be located directly in the previously-specified folder. An error will be thrown if the folder is not empty and this is not checked.
es_mx: **Cree una Nueva Carpeta**: Si se marca esta casilla, se creará una nueva carpeta para mantener el proyecto dentro de la carpeta previamente especificada. Si se marca *no*, el proyecto se ubicará directamente en la carpeta previamente especificada. Se producirá un error si la carpeta no está vacía y no está marcada.
fr_ca: **Create a New Folder**: Si cette case est cochée, un nouveau dossier sera créé pour contenir le projet dans le dossier précédemment spécifié. Si elle n'est *pas* cochée, le projet sera situé directement dans le dossier précédemment spécifié. Une erreur sera générée si le dossier n'est pas vide et que cela n'est pas vérifié.

source: **Team Number**: The team number for the project, which will be used for package names within the project and to locate the robot when deploying code.
es_mx: **Número de equipo**: el número de equipo del proyecto, que se utilizará para los nombres de los paquetes dentro del proyecto y para ubicar el robot al implementar el código.
fr_ca: **Team Number**: Ce paramètre définit le numéro d’équipe du projet, qui sera utilisé pour les noms de packages dans le projet et pour localiser le robot lors du déploiement du code.

source: **Enable Desktop Support**: If this is checked, simulation and unit test support is enabled. However, there are some cases where this will do some unexpected things. In addition, all vendor libraries need desktop support which not all libraries do.
es_mx: **Habilitar Soporte de Escritorio**: Si esto está marcado, el soporte de simulación y prueba de unidades está activado. Sin embargo, hay algunos casos en los que esto hará unas cosas inesperadas. Además. todas las bibliotecas de proveedores necesitan soporte de escritorio, lo cual no todas las bibliotecas hacen.
fr_ca: **Enable Desktop Support**: si cette case est cochée, la prise en charge de la simulation et des tests unitaires est activée. Cependant, dans certains cas, cela entraînera des choses inattendues. De plus, toutes les librairies des fournisseurs ont besoin d'une prise en charge de bureau, contrairement à certaines librairies qui n'en n'ont pas besoin..

source: Click :guilabel:`Import Project` to begin the upgrade.
es_mx: Click :guilabel:`Importar Proyecto` para empezar la actualización.
fr_ca: Cliquez sur :guilabel:`Import Project` pour commencer la mise à niveau.

source: The gradle project will be upgraded and copied into the new project directory. You can then either open the new project immediately (the pop-up shown below should appear in the bottom right) or open it later using the :kbd:`Ctrl+O` (or :kbd:`Command+O` for macOS) shortcut.
es_mx: El proyecto se actualizará y será copiado en el nuevo directorio de proyectos. Puede entonces abrir el nuevo proyecto inmediatamente (el pop-up que se muestra abajo debería aparecer en la parte inferior derecha) o abrirlo más tarde usando :kbd:`Ctrl+O` (o :kbd:`Command+O` para macOS).
fr_ca: Le projet gradle sera mis à niveau et copié dans le nouveau répertoire du projet. Vous pouvez alors soit ouvrir le nouveau projet immédiatement (la fenêtre contextuelle ci-dessous devrait apparaître en bas à droite) soit l'ouvrir plus tard en utilisant le raccourci :kbd:`Ctrl+O` (ou :kbd:`Command+O` sous macOS)

source: C++ Configurations (C++ Only)
es_mx: Configuraciones de C++ (solo C++)
fr_ca: Configurations C++ (C++ uniquement)

source: For C++ projects, there is one more step to set up IntelliSense. Whenever you open a project, you should get a pop-up in the bottom right corner asking to refresh C++ configurations. Click :guilabel:`Yes` to set up IntelliSense.
es_mx: Para los proyectos C++, hay un paso más para estableces IntelliSense. Cada vez que abre un proyecto, debería aparecer un pop-up en la esquina inferior derecha pidiendo que se refresquen las configuraciones de C++. Haga clic en :guilabel:`Si` para configurar IntelliSense.
fr_ca: Pour les projets C++, il existe une étape supplémentaire pour configurer IntelliSense. Chaque fois que vous ouvrez un projet, vous devriez obtenir une fenêtre contextuelle dans le coin inférieur droit vous demandant d'actualiser les configurations C++. Cliquez sur :guilabel:`Yes` pour configurer IntelliSense.

source: 3rd Party Libraries
es_mx: Bibliotecas de 3ros
fr_ca: Bibliothèques des tierces parties

source: It is necessary to update and re-import 3rd party libraries. See :doc:`3rd Party Libraries <3rd-party-libraries>` for details.
es_mx: Es necesario actualizar y volver a importar las bibliotecas de terceros. Consulte :doc:`3rd Party Libraries <3rd-party-libraries>` para obtener más detalles.
fr_ca: Il est nécessaire de mettre à jour et de ré-importer les bibliothèques tierces. Voir :doc:`Librairies tierces <3rd-party-libraries>` pour plus de détails.

source: Manual Import Process (2020 to 2021)
es_mx: Proceso de importación manual (2020 a 2021)
fr_ca: Processus manuel d’importation (2020 à 2021)

source: As there were minimal changes to the gradle templates in 2021, it is possible to manually import a project from a 2020 version of GradleRIO to 2021, which may be convenient if you've heavily customized your build.gradle file. This method does *not* work for importing a 2019 project, and will not work for future years. There are two files that need to be updated.
es_mx: Como los cambios en las plantillas gradle en 2021 son mínimos, es posible importar manualmente un proyecto de una versión 2020 de GradleRIO a 2021, lo que puede ser conveniente si has personalizado mucho tu archivo build.gradle. Este método *no* funciona para importar un proyecto de 2019, y no funcionará para años futuros. Hay dos archivos que necesitan ser actualizados.
fr_ca: Comme il y avait des changements minimes aux modèles gradle en 2021, il est possible d’importer manuellement un projet d’une version 2020 de GradleRIO à 2021, ce qui peut être pratique si vous avez fortement personnalisé votre fichier build.gradle. Cette méthode ne fonctionne *pas* pour l’importation d’un projet 2019, et ne fonctionnera pas pour les années à venir. Il y a deux fichiers qui doivent être mis à jour.

source: Open ``.wpilib\wpilib_preferences.json`` and change the ``projectYear`` to ``2021``.
es_mx: Abra ``.wpilib\wpilib_preferences.json`` y cambie el ``projectYear`` a ``2021``.
fr_ca: Ouvrez ``.wpilib\wpilib_preferences.json`` et changez le ``projectYear`` en ``2021``.

source: Change the GradleRIO version to the latest version (e.g. 2021.1.2 for the kickoff release)
es_mx: Cambiar la versión de GradleRIO a la última versión (por ejemplo, 2021.1.2 para la versión inicial)
fr_ca: Remplacez la version GradleRIO par la dernière version (par exemple 2021.1.2 pour la version du lancement de la saison 2021)

source: (C++ Only) move ``wpi.deps.vendor.cpp(it)`` above ``wpi.deps.wpilib(it)`` (2 places)
es_mx: (Sólo C++) mover ``wpi.deps.vendor.cpp(it)`` por encima de ``wpi.deps.wpilib(it)`` (2 lugares)
fr_ca: (C++ seulement) déplacez ``wpi.deps.vendor.cpp(it)`` au-dessus de ``wpi.deps.wpilib(it)`` (2 endroits)

source: (Optional) add ``simulation wpi.deps.sim.driverstation(wpi.platforms.desktop, XXXX)`` where XXXX is false for Java and true for C++. This allows the driver station to be used in simulation
es_mx: (Opcional) añadir ``simulation wpi.deps.sim.drivertation(wpi.platforms.desktop, XXXX)`` donde XXXX es falso para Java y verdadero para C++. Esto permite utilizar la driver station en la simulación
fr_ca: (Facultatif) ajoutez ``simulation wpi.deps.sim.driverstation(wpi.platforms.desktop, XXXX)`` où XXXX est false pour Java et true pour C++. Cette opération permet d'utiliser l'application Driver Station en simulation

source: (Optional) add the websocket and simulation configuration blocks to support websockets simulation (i.e. Romi)
es_mx: (Opcional) añadir los bloques de configuración de websockets y de simulación para soportar la simulación de websockets (por ejemplo, Romi)
fr_ca: (Facultatif) ajoutez les blocs de configuration websocket et simulation pour prendre en charge la simulation websockets (c.-à-dire Romi)

source: Delete ``imgui.ini`` (the Simulator GUI ini file) if it exists. The 2020 file format is not compatible with the 2021 format. The file will be regenerated when the Simulator GUI is run).
es_mx: Elimine ``imgui.ini`` (el archivo ini de la GUI del Simulador) si es que existe. El formato de archivo 2020 no es compatible con el formato 2021. El archivo se regenerará cuando se ejecute el Simulador GUI).
fr_ca: Supprimez ``imgui.ini`` (le fichier in de l'interface graphique du Simulateur) s’il existe. Le format de fichier pour l'année 2020 n’est pas compatible avec le format 2021. Le fichier sera régénéré lorsque l’interface graphique du simulateur sera gérée.

source: Update 3rd Party Libraries
es_mx: Actualización de bibliotecas de 3eros
fr_ca: Mettez à jour les librairies tierces

source: It is necessary to update 3rd party libraries. See :doc:`3rd Party Libraries <3rd-party-libraries>` for details.
es_mx: Es necesario actualizar las bibliotecas de terceros. Vea :doc:`3rd Party Libraries<3rd-party-libraries>` para más detalles.
fr_ca: Il est nécessaire de mettre à jour les librairies tierces. Voir :doc:`Libraries tierces<3rd-party-libraries>` pour les détails.
