Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station.po
Languages: fr_ca, tr_tr, zh_cn

source: The top graph charts trip time in milliseconds in green (against the axis on the right) and lost packets per second in orange (against the axis on the left)
fr_ca: Le graphique en haut trace le temps de survoltage en millisecondes en vert (contre l’axe à droite) et les paquets perdus par seconde en orange (contre l’axe à gauche)
tr_tr: Üstteki grafik milisaniye cinsinden açma süresini (sağdaki eksene karşı) yeşil renkte ve saniyedeki kayıp paketleri turuncu renkte (soldaki eksene karşı) gösterir.
zh_cn: 最上面的图标是绿色的，追踪以毫秒为单位的时间 (对于右侧的轴) 和橘色的每秒丢包 (相对于左侧的轴)

source: The bottom graph plots battery voltage in yellow (against the axis on the left), roboRIO CPU in red (against the axis on the right), DS Requested mode as a continuous line on the bottom of the chart and robot mode as a discontinuous line above it.
fr_ca: Le graphique en bas montre la tension de la batterie en jaune (contre l’axe à gauche), le %CPU du roboRIO en rouge (contre l’axe à droite), le mode DS Requested en ligne continue en bas du graphique et le mode du robot en ligne discontinue au-dessus.
tr_tr: Alt grafikte pil voltajı sarı renkte (soldaki eksene karşı), roboRIO CPU kırmızı renkte (sağdaki eksene karşı), DS Requested modu grafiğin altında sürekli bir çizgi olarak ve onubn üzerinde robot modunu kesintili bir çizgi olarak gösterir.
zh_cn: 底部图形以黄色（相对于左侧的轴）绘制电池电压，roboRIO CPU以红色（相对于右侧的轴）绘制，DS Requested模式为图表底部的实线，而Robot模式为它上面不连续线。

source: This key shows the colors used for the DS Requested and Robot Reported modes in the bottom chart.
fr_ca: Cette légende affiche les couleurs utilisées pour les modes DS Requested et Robot Reported dans le graphique inférieur.
tr_tr: Bu anahtar, alttaki grafikte DS Requested ve Robot Reported modları için kullanılan renkleri gösterir.
zh_cn: 此按键在底图中显示用于“ DS请求”和“机器人报告”模式的颜色。

source: Chart scale - These controls change the time scale of the DS Charts
fr_ca: Échelle des graphiques - Ces contrôles modifient l’échelle de temps des graphiques DS
tr_tr: Chart Scale - Bu kontroller, DS Grafiklerinin zaman ölçeğini değiştirir
zh_cn: 图表比例尺-这些控件可更改DS图表的时间比例

source: This button launches the :doc:`DS Log File Viewer <driver-station-log-viewer>`
fr_ca: Ce bouton lance le :doc:`DS Log File Viewer <driver-station-log-viewer>`
tr_tr: Bu düğme şunları başlatır :doc`DS Log File Viewer<driver-station-log-viewer>`
zh_cn: 此按钮启动 DS Log File Viewer

source: The DS Requested mode is the mode that the Driver Station is commanding the robot to be in. The Robot Reported mode is what code is actually running based on reporting methods contained in the coding frameworks for each language.
fr_ca: Le mode DS Requested est le mode dans lequel Driver Station commande au robot d'opérer. Le mode Robot Reported correspond au code en cours d'exécution selon les méthodes définies dans les programmes propres à chacun des langages.
tr_tr: DS Requested , Drive Station'ın robota giriş için komut verdiği moddur. Robot Reported modu, her dil için kodlama çerçevelerinde bulunan raporlama yöntemlerine göre gerçekte kodun çalıştırıldığı moddur.
zh_cn: DS Requested 模式是 Driver Station 命令机器人进入的模式。Robot Reported 模式是基于每种语言的编码框架中包含的报告方法实际运行的代码。

source: Both Tab
fr_ca: Onglet Côte-à-côte
tr_tr: Her İki Sekme
zh_cn: 双窗口栏

source: The last tab on the right side is the Both tab which displays Messages and Charts side by side
fr_ca: Le dernier onglet sur le côté droit affiche Messages et Graphiques côte à côte
tr_tr: Sağ taraftaki son sekme, Mesajları ve Grafikleri yan yana görüntüleyen Both sekmesidir.
zh_cn: 右侧最后一栏是双窗口栏，同时显示信息和图标

source: Driver Station Key Shortcuts
fr_ca: Principaux raccourcis clavier de Driver Station
tr_tr: Driver Station Tuş Kısayolları
zh_cn: Driver Station 快捷键

source: `F1` - Force a Joystick refresh.
fr_ca: `F1` - Force un rafraîchissement de la manette
tr_tr: `F1` - Joystick yenilemesini zorla.
zh_cn: F1 - 强制刷新手柄

source: `[` + `]` + `\\` - Enable the robot (the 3 keys above Enter on most keyboards)
fr_ca: `[` + `]` + `\\` - Active le robot (les 3 touches au-dessus de Entrée sur la plupart des claviers)
tr_tr: `[` + `]` + `\\` - Robotu etkinleştirin (çoğu klavyede Enter'ın üzerindeki 3 tuş)
zh_cn: ［ + ］+ \ - 启用机械人（大多数键盘上Enter键上方的3个键）

source: `Enter` - Disable the Robot
fr_ca: `Entrée` - Désactive le robot
tr_tr: `Enter` - Robotu devre dışı bırak
zh_cn: 回车 - 禁用机器人

source: `Space` - Emergency Stop the robot. After an emergency stop is triggered the roboRIO will need to be rebooted before the robot can be enabled again.
fr_ca: `Barre d'espacement` - Arrêt d'urgence du robot. Après le déclenchement d'un arrêt d’urgence, le roboRIO doit être redémarré avant que le robot ne puisse être activé à nouveau.
tr_tr: `Space` - Emergency Stop ile robotu durdurun. Bir acil durdurma tetiklendikten sonra, robotun tekrar etkinleştirilebilmesi için roboRIO'nun yeniden başlatılması gerekecektir.
zh_cn: 空格 - 紧急停止机器人。触发紧急停止后，需要重新启动roboRIO，然后才能再次启用机器人。

source: Space bar will E-Stop the robot regardless of if the Driver Station window has focus or not
fr_ca: La barre d’espacement arrêtera en urgence le robot, que la fenêtre Driver Station soit active ou non
tr_tr: Boşluk çubuğu, Driver Station penceresinin seçili olup olmadığına bakılmaksızın robotu E-Stop yapar
zh_cn: 无论Driver Station是否有键盘焦点，空格键都会紧急停止机器人

source: When connected to FMS in a match, teams must press the Team Station E-Stop button to emergency stop their robot as the DS enable/disable and E-Stop key shortcuts are ignored.
fr_ca: Lorsqu'elles sont connectées au FMS dans un match, les équipes doivent appuyer sur le bouton d'arrêt d'urgence du Team Station pour arrêter leur robot étant donné que les raccourcis d'activation / désactivation de DS et d'arrêt d'urgence sont désactivés.
tr_tr: Bir maçta FMS'ye bağlandıklarında, DS etkin / devre dışı ve E-Stop tuş kısayolları göz ardı edildiğinden takımların robotlarını acil olarak durdurmak için Team Station E-Stop düğmesine basması gerekir.
zh_cn: 在比赛中连接至场控系统时，由于DS启用/禁用和紧急停止快捷键被忽略，因此团队必须按Team Station的E-Stop按钮紧急停止其机器人。
