Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station.po
Languages: fr_ca, tr_tr, zh_cn

source: FRC Driver Station Powered by NI LabVIEW
fr_ca: Driver Station FRC par NI LabVIEW
zh_cn: FRC Driver Station (由NI LabVIEW提供支持)

source: This article describes the use and features of the FRC\ |reg| Driver Station Powered by NI LabVIEW.
fr_ca: Cet article décrit l’utilisation et les caractéristiques de l'application Driver Station FRC\ |reg| optimisée par NI LabVIEW.
tr_tr: Bu makale, FRC\|reg| Sürücü İstasyonu NI LabVIEW tarafından desteklenmektedir.
zh_cn: 这篇文章讲的是FRC ® Driver Station (由NI LabVIEW提供支持) 的使用和特性。

source: For information on installing the Driver Station software see :ref:`this document <docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools>`.
fr_ca: Pour plus d’informations sur l’installation de l'application Driver Station, consulter :ref:`ce document <docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools>`.
tr_tr: Driver Station yazılımının yüklenmesi hakkında bilgi için bkz :ref:`this document <docs/zero-to-robot/step-2/frc-game-tools:Installing the FRC Game Tools>`
zh_cn: 关于安装 Driver Station 软件的信息，请参见本文档：5.4 Installing the FRC Game Tools

source: Starting the FRC Driver Station
fr_ca: Démarrage de Driver Station FRC
tr_tr: FRC Driver Station - Sürücü İstasyonunu Başlatma
zh_cn: 启动 FRC Driver Station

source: This is the FRC Driver Station icon.
zh_cn: 这是FRC机器操控台图标。

source: The FRC Driver Station can be launched by double-clicking the icon on the Desktop or by selecting Start->All Programs->FRC Driver Station.
fr_ca: Driver Station FRC peut être lancé en double-cliquant sur l’icône sur le Bureau ou en sélectionnant Start->All Programs->FRC Driver Station.
tr_tr: FRC Driver Station, Masaüstündeki simgeye çift tıklayarak veya Start->All Programs->FRC Driver Station seçilerek başlatılabilir.
zh_cn: 可以通过双击桌面上的图标或选择 开始->所有程序-> FRC Driver Station 来启动 FRC Driver Station。

source: By default the FRC Driver Station launches the :ref:`LabVIEW Dashboard <docs/software/dashboards/labview-dashboard/driver-station-labview-dashboard:FRC LabVIEW Dashboard>`. It can also be configured on :ref:`docs/software/driverstation/driver-station:Setup Tab` to launch the other Dashboards: :ref:`SmartDashboard <docs/software/dashboards/smartdashboard/smartdashboard-intro:SmartDashboard Introduction>` and :ref:`Shuffleboard <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>`.
fr_ca: Par défaut, le FRC Driver Station lance le :ref:`LabVIEW Dashboard <docs/software/dashboards/labview-dashboard/driver-station-labview-dashboard:FRC LabVIEW Dashboard>`. Il peut également être configuré sur :ref:`docs/software/driverstation/driver-station:Setup Tab` to launch the other Dashboards: :ref:`SmartDashboard <docs/software/dashboards/smartdashboard/smartdashboard-intro:SmartDashboard Introduction>` et :ref:`Shuffleboard <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>`.
zh_cn: 默认情况下，FRC机器操控台启动 :ref:`LabVIEW Dashboard <docs/software/dashboards/labview-dashboard/driver-station-labview-dashboard:FRC LabVIEW Dashboard>`. It can also be configured on :ref:`docs/software/driverstation/driver-station:Setup Tab` to launch the other Dashboards: :ref:`SmartDashboard <docs/software/dashboards/smartdashboard/smartdashboard-intro:SmartDashboard Introduction>` and :ref:`Shuffleboard <docs/software/dashboards/shuffleboard/getting-started/shuffleboard-tour:Tour of Shuffleboard>`.

source: Setting Up the Driver Station
fr_ca: Configuration de Driver Station
tr_tr: Sürücü İstasyonunu Kurmak
zh_cn: 设置 Driver Station

source: The team number box on the setup (gear) tab.
zh_cn: 在设置(齿轮)选项卡上的队伍编号框。

source: The DS should be set to your team number in order to connect to your robot. In order to do this click the Setup tab then enter your team number in the team number box. Press return or click outside the box for the setting to take effect.
fr_ca: Le DS doit être configuré sur votre numéro d’équipe afin de vous connecter à votre robot. Pour ce faire, cliquez sur l’onglet Setup puis entrez votre numéro d’équipe dans la boîte de numéro d’équipe. Appuyez sur return ou cliquez en dehors de la boîte pour que la configuration prenne effet.
tr_tr: Robotunuza bağlanmak için DS, takım numaranıza ayarlanmalıdır. Bunu yapmak için Kurulum sekmesine tıklayın ve ardından takım numarası kutusuna takım numaranızı girin. Ayarın etkili olması için return tuşuna basın veya kutunun dışını tıklayın.
zh_cn: Driver Station 应该被设置成你的队伍号，才能连上你的机器人。单击Setup按钮，然后在“队伍号”一栏里面输入你的队伍号。按回车或者单击窗口外面来完成设置。

source: PCs will typically have the correct network settings for the DS to connect to the robot already, but if not, make sure your Network adapter is set to DHCP.
fr_ca: Généralement la configuration des paramètres réseau des PC est telle que DS se connecte automatiquement au robot, sinon, assurez-vous que votre carte réseau est configurée à DHCP.
tr_tr: Bilgisayarlar, DS'nin robota zaten bağlanması için tipik olarak doğru ağ ayarlarına sahip olacaktır, ancak yoksa, Ağ adaptörünüzün DHCP'ye ayarlandığından emin olun.
zh_cn: 电脑通常应该有正确的网络设置，以便 Driver Station 连接到机器人，但如果没有，请确保将你的网络适配器设置为 DHCP。

source: Status Pane
fr_ca: Volet Status
tr_tr: Status Paneli
zh_cn: 状态栏

source: This is the pane in the center of the Driver station that is always visible.
zh_cn: 这是机器操控台中心的面板，它总是可见的。

source: The Status Pane of the Driver Station is located in the center of the display and is always visible regardless of the tab selected. It displays a selection of critical information about the state of the DS and robot:
fr_ca: Le volet Status de Driver Station est situé au centre de l’interface et est toujours visible quel que soit l’onglet sélectionné. Il affiche une sélection d’informations essentielles sur l’état de DS et du robot:
tr_tr: Driver Station Status Bölmesi, ekranın ortasında yer alır ve seçilen sekmeden bağımsız olarak her zaman görülebilir. DS ve robotun durumu hakkında bir dizi kritik bilgi görüntüler:
zh_cn: Driver Station 的状态栏位于显示屏的中央，并且无论选择哪个选项，它将始终可见。它将显示有关Driver Station和机器人状态的重要信息：

source: Team # - The Team number the DS is currently configured for. This should match your FRC team number. To change the team number see the Setup Tab.
fr_ca: Team # - Numéro d’équipe auquel DS est actuellement configuré. Cela devrait correspondre à votre numéro d’équipe FRC. Pour modifier le numéro d’équipe, voir l’onglet Setup .
tr_tr: Team # - DS'nin şu anda yapılandırıldığı Takım numarası. Bu, FRC takım numaranızla eşleşmelidir. Takım numarasını değiştirmek için Setup Sekmesine bakın.
zh_cn: Team # - 是Driver Station 当前配置的队号。这应该匹配您的 FRC 队号。要更改Driver Station中的队号，请参阅“设置选项”。

source: Battery Voltage - If the DS is connected and communicating with the roboRIO this displays current battery voltage as a number and with a small chart of voltage over time in the battery icon. The background of the numeric indicator will turn red when the roboRIO brownout is triggered. See :doc:`/docs/software/roborio-info/roborio-brownouts` for more information.
fr_ca: Battery Voltage - Si DS est connecté et communique avec le roboRIO, la tension actuelle de la batterie s'affiche sous la forme d'un nombre accompagné d'un petit graphique de la tension en fonction du temps dans l’icône de la batterie. L’arrière-plan de l’indicateur numérique deviendra rouge lorsque l'avertissement de déclin de performance du roboRIO est déclenché. Voir :doc:`/docs/software/roborio-info/roborio-brownouts` pour plus d'information.
tr_tr: Battery Voltage - DS bağlıysa ve roboRIO ile iletişim halindeyse, bu mevcut akü voltajını bir sayı olarak ve pil simgesinde zaman içinde küçük bir voltaj çizelgesiyle görüntüler. RoboRIO karartması tetiklendiğinde sayısal göstergenin arka planı kırmızıya dönecektir. Daha fazla bilgi için :doc:`/docs/software/roborio-info/roborio-brownouts` a bakın.
zh_cn: Battery Voltage （电池电压）- 如果 Driver Station 已连接至 roboRio 并与其通信，则会在电池图标中以数字形式显示当前电池电压，并显示一小段电压-时间图表。当 roboRIO 掉电情况发生时，数字指示器的背景将变为红色。有关更多信息，请参见本文档：29.4 roboRIO Brownout and Understanding Current Draw

source: Major Status Indicators - These three indicators display major status items for the DS. The "Communications" indicates whether the DS is currently communicating with the FRC Network Communications Task on the roboRIO (it is split in half for the TCP and UDP communication). The "Robot Code" indicator shows whether the team Robot Code is currently running (determined by whether or not the Driver Station Task in the robot code is updating the battery voltage), The "Joysticks" indicator shows if at least one joystick is plugged in and recognized by the DS.
fr_ca: Major Status Indicators - Ces trois indicateurs affichent les trois principaux éléments concernant l’état de la DS. "Communications" indique si DS communique actuellement avec la tâche de communication réseau FRC du roboRIO (elle est divisée en deux, soit pour la communication TCP et pour UDP). L’indicateur "Robot Code" indique si le Programme du robot est en cours d’exécution (déterminé par si oui ou non la tâche Driver Station met à jour la tension de la batterie), l’indicateur "Joysticks" indique si au moins une manette est branchée et reconnue par DS.
tr_tr: Major Status Indicators - Bu üç gösterge, DS için ana durum öğelerini görüntüler. "Communications", DS'nin şu anda roboRIO üzerindeki FRC Network Communications Task ile iletişim kurup kurmadığını gösterir (TCP ve UDP iletişimi için ikiye bölünmüştür). "Robot Code" göstergesi, takım Robot Kodunun şu anda çalışıp çalışmadığını gösterir (robot kodundaki Drive Station görevinin pil voltajını güncelleyip güncellemediğine göre belirlenir), "Joysticks" göstergesi en az bir kumanda çubuğunun takılı olup olmadığını gösterir ve DS tarafından tanındı.
zh_cn: Maor Status Indicator (主要状态指示器) - 这三个指示器显示 Driver Station 的主要状态项目。 “Communication” 指示 Driver Station 当前是否正在与 roboRIO 上的 FRC网络通信任务进行通信（ 通信被分为 TCP 和 UDP 通信）。 “The Robot Code” 指示器显示机器人代码当前是否正在运行（是否运行由机器人代码中的 Driver Station Task 是否更新电池电压来确定）。 “Joysticks” 指示器显示是否至少插入了一个操纵杆，并被 Driver Station 识别。

source: Status String - The Status String provides an overall status message indicating the state of the robot, some examples are "No Robot Communication", "No Robot Code", "Emergency Stopped", and "Teleoperated Enabled". When the roboRIO brownout is triggered this will display "Voltage Brownout".
fr_ca: Status String - Chaîne de caractères fournissant un message global indiquant l’état du robot, quelques exemples sont "No Robot Communication", "No Robot Code", "Emergency Stopped", et "Teleoperated Enabled". Lorsque le signal de déclin de performance du roboRIO est déclenché, "Voltage Brownout" s'affiche.
tr_tr: Status String - Durum Dizesi, robotun durumunu gösteren genel bir durum mesajı sağlar, bazı örnekler "No Robot Communication", "No Robot Code", "Emergency Stopped" ve "Teleoperated Enabled" dir. RoboRIO voltaj düşmesi tetiklendiğinde, bu "Voltage Brownout" gösterecektir.
zh_cn: Status String (状态字符串) - 状态字符串提供指示机器人状态的总体消息，例如“无机器人通信”，“无机器人代码”，“紧急停止”和“启用远程操作”。当 roboRIO 电压低时，将显示“Voltage Brownout”。

source: Operation Tab
fr_ca: Onglet Operation
tr_tr: Operation Tabı
zh_cn: Operation Tab (操作标签)

source: This is the first tab from the top on the left hand side.
zh_cn: 这是左边顶部的第一个标签。

source: The Operations Tab is used to control the mode of the robot and provide additional key status indicators while the robot is running.
fr_ca: L’onglet Operations est utilisé pour contrôler le mode du robot et fournir d'importants indicateurs d’état supplémentaires lorsque que le robot est activé.
tr_tr: Operations Sekmesi, robotun modunu kontrol etmek ve robot çalışırken ek anahtar durum göstergeleri sağlamak için kullanılır.
zh_cn: “Operation Tab” 用于控制机器人的操作模式，并在机器人运行时提供其他的关键状态指示。

source: Robot Mode - This section controls the Robot Mode. Practice Mode causes the robot to cycle through the same transitions as an FRC match after the Enable button is pressed (timing for practice mode can be found on the setup tab).
fr_ca: Robot Mode - Cette section contrôle le mode de fonctionnement du Robot. Practice Mode fait passer le robot à travers les mêmes phases qu’un match FRC, après avoir appuyé sur le bouton Enable (la configuration de la durée du Practice Mode se trouve dans l’onglet Setup).
tr_tr: Robot Mode - Bu bölüm Robot Modunu kontrol eder. Practice Modu, Robotun, Enable düğmesine basıldıktan sonra bir FRC maçıyla aynı şekilde modlar arasında geçiş yapmasına neden olur (alıştırma modu için zamanlama, Setup sekmesinde bulunabilir).
zh_cn: Robot Mode (机械模式) - 这个部分控制机械模式。在按下“启用”按钮后，练习模式会使机器人循环进行和FRC比赛相同的转换（可以在“设置”选项上找到练习模式的时间）。

source: Enable/Disable - These controls enable and disable the robot. See also `Driver Station Key Shortcuts`_
fr_ca: Enable/Disable - Ces contrôles permettent d'activer et de désactiver le robot. Voir aussi `Driver Station Key Shortcuts`_
tr_tr: Enable/Disable - Bu kontroller robotu etkinleştirir ve devre dışı bırakır. Ayrıca bkz. ``Driver Station Key Shortcuts`_
zh_cn: Enable/Disable (启用/禁用) - 这些按键控制机器人的启动和停止。另请参见本文档：17.1.12 Driver Station Key Shortcuts

source: Elapsed Time - Indicates the amount of time the robot has been enabled
fr_ca: Elapsed Time - Indique le temps écoulé depuis le moment où le robot a été activé.
tr_tr: Elapsed Time - Robotun etkinleştirildiği süreyi gösterir
zh_cn: Elapsed Time (运行时间) - 显示机器人启动了多久

source: PC Battery - Indicates current state of DS PC battery and whether the PC is plugged in
fr_ca: PC Battery - Indique l’état de chargement de la batterie du PC de pilotage et si le PC est branché.
tr_tr: PC Battery - DS PC pilinin mevcut durumunu ve PC'nin takılı olup olmadığını gösterir.
zh_cn: PC Battery (电脑电池) - 指示 Driver Station 上电脑的电池当前电量以及PC是否插电

source: PC CPU% - Indicates the CPU Utilization of the DS PC
fr_ca: PC CPU% - Indique le pourcentage d’utilisation du processeur du PC de pilotage
tr_tr: PC CPU% - DS PC'nin CPU Kullanımını gösterir
zh_cn: PC CPU％-指示Driver Station 在电脑上的CPU占用率

source: Window Mode - When not on the Driver account on the Classmate allows the user to toggle between floating (arrow) and docked (rectangle)
fr_ca: Window Mode - Lorsqu’il n’est pas sous le compte Driver du Classmate, permet à l’utilisateur de basculer entre fenêtre flottante (flèche) et amarrée (rectangle)
tr_tr: Window Mode - Classmate bilgisayarında Driver kullanıcı hesabında olmadığında, kullanıcının kayan (ok) ve sabitlenmiş (dikdörtgen) görünüm arasında geçiş yapmasına izin verir
zh_cn: Window Mode (窗口模式) - 如果不在Classmate上的Driver帐户中，则允许用户在浮动（箭头）和停靠（矩形）之间切换

source: Team Station - When not connected to FMS, sets the team station to transmit to the robot.
fr_ca: Team Station - Lorsque non connecté au FMS, configure la station d’équipe à transmettre au robot.
tr_tr: Team Station - FMS'ye bağlı olmadığında, takım istasyonunu robota aktarım yapacak şekilde ayarlar.
zh_cn: Team Station-未连接到FMS时，向机器人传输Team Station设置

source: When connected to the Field Management System the controls in sections 1, and 2 will be replaced by the words FMS Connected and the control in Section 7 will be greyed out.
fr_ca: Lorsqu’ils sont connectés au Field Management System, les contrôles des sections 1 et 2 seront remplacés par les mots FMS Connected et le contrôle de la section 7 sera grisé.
tr_tr: Saha Yönetim Sistemine bağlandığında, bölüm 1 ve 2'deki kontroller FMS Connected sözcükleriyle değiştirilecek ve Bölüm 7'deki kontrol grileşecektir.
zh_cn: 连接到场控系统后，选项1和选项2中控件将替换为FMS Connected（已连接场控系统），选项7控件将变为灰色。

source: Diagnostics Tab
fr_ca: Onglet Diagnostics
tr_tr: Diagnostics-Arıza tespit Tabı
zh_cn: Diagnostics Tab (诊断标签)

source: This is the second tab from the top on the left hand side.
zh_cn: 这是左边顶部的第二个标签。

source: The Diagnostics Tab contains additional status indicators that teams can use to diagnose issues with their robot:
fr_ca: L’onglet Diagnostics contient des indicateurs d’état supplémentaires que les équipes peuvent utiliser pour identifier les problèmes de leur robot :
tr_tr: Diagnostics Sekmesi, takımların robotlarıyla ilgili sorunları teşhis etmek için kullanabilecekleri ek durum göstergeleri içerir:
zh_cn: Dianostics Tab包含额外的状态指示器，团队可以使用这些指示器来诊断其机器人的问题：

source: DS Version - Indicates the Driver Station Version number
fr_ca: DS Version - Indique le numéro de la version de Driver Station
tr_tr: DS Version - Sürücü İstasyonu Sürüm numarasını gösterir
zh_cn: DS Version (Driver Station版本) - 显示Driver Station的版本号

source: roboRIO Image Version - String indicating the version of the roboRIO Image
fr_ca: roboRIO Image Version - Chaîne de caractères indiquant la version de l’image du roboRIO
tr_tr: roboRIO Image Version - roboRIO Görüntüsünün sürümünü belirtir
zh_cn: roboRIO Image Version (roboRIO镜像版本) - 指示roboRIO镜像的版本

source: WPILib Version - String indicating the version of WPILib in use
fr_ca: WPILib Version - Chaîne de caractères indiquant la version de WPILib en cours d’utilisation
tr_tr: WPILib Version - Kullanımdaki WPILib sürümünü gösterir
zh_cn: WPILib Version (WPILib 版本) - 指示正在用的WPILib的版本

source: CAN Device Versions - String indicating the firmware version of devices connected to the CAN bus. These items may not be present if the CTRE Phoenix Framework has not been loaded
fr_ca: CAN Device Versions - Chaîne de caractères indiquant la version firmware des périphériques connectés au bus CAN. Ces éléments peuvent ne pas être présents si le framework CTRE Phoenix n’a pas été chargé
tr_tr: CAN Cihaz Versiyonları - CAN veriyoluna bağlı cihazların ürün yazılımı versiyonunu gösteren dize. CTRE Phoenix Framework yüklenmemişse bu öğeler mevcut olmayabilir
zh_cn: CAN Device Versions -指示连接到CAN总线的设备的固件版本的字符串。如果cre Phoenix框架没有被加载，这些项目可能不存在

source: Memory Stats - This section shows stats about the roboRIO memory
fr_ca: Memory Stats - Cette section affiche des statistiques sur la mémoire du roboRIO
tr_tr: Memory Stats - Bu bölüm roboRIO belleğiyle ilgili istatistikleri gösterir
zh_cn: Memory Stats (存储状态) - 这个部分显示roboRIO内存的状态

source: Connection Indicators - The top half of these indicators show connection status to various components.
fr_ca: Connection Indicators - La moitié supérieure de ces indicateurs montre l’état de connexion à divers composants.
tr_tr: Connection Indicators - Bu göstergelerin üst yarısı, çeşitli bileşenlere bağlantı durumunu gösterir.
zh_cn: Connection Indicators (连接指示器) - 指示器的上半部分会显示多个组件的连接状态

source: "Enet Link" indicates the computer has something connected to the ethernet port.
fr_ca: "Enet Link" indique que l’ordinateur détecte une connexion quelconque à son port ethernet.
tr_tr: "Enet Link", bilgisayarın ethernet bağlantı noktasına bağlı bir şey olduğunu gösterir.
zh_cn: “Enet Link” (局域网连接) 会指示电脑是否连接上了ethernet网线接口

source: "Robot Radio" indicates the ping status to the robot wireless bridge at 10.XX.YY.1.
fr_ca: "Robot Radio" indique l’état de ping du pont sans fil du robot à 10.XX.YY.1.
tr_tr: "Robot Radio", 10.XX.YY.1'de robot kablosuz ağ köprüsüne ping durumunu gösterir.
zh_cn: “Robot Radio” (机器人信号) 会指示在10.XX.YY.1机器人无线桥接的延迟ping值

source: "Robot" indicates the ping status to the roboRIO using mDNS (with a fallback of a static 10.TE.AM.2 address).
fr_ca: "Robot" indique le résultat de la commande ping au roboRIO à l’aide de mDNS (avec un repli de l'adresse statique 10.TE.AM.2).
tr_tr: "Robot", mDNS kullanarak roboRIO'ya ping durumunu gösterir (statik 10.TE.AM.2 adresinin geri dönüşü ile).
zh_cn: “Robot”会指示在使用 mDNS 时 (后面带有静态10.TE.AM.2地址) roboRIO的延迟ping值

source: "FMS" indicates if the DS is receiving packets from FMS (this is NOT a ping indicator).
fr_ca: "FMS" indique si DS reçoit des paquets du FMS (ce N’EST PAS un indicateur de ping).
tr_tr: "FMS", DS'nin FMS'den paket alıp almadığını gösterir (bu bir ping göstergesi DEĞİLDİR).
zh_cn: "FMS"(场控) 会指示Driver Station是否从FMS收到数据包 (这不是个ping指示器)

source: Network Indicators - The second section of indicators indicates status of network adapters and firewalls. These are provided for informational purposes, communication may be established with one or more unlit indicators in this section
fr_ca: Network Indicators - La deuxième section des indicateurs indique l’état des cartes réseau et des pare-feux. Ceux-ci sont fournis à titre d’information, la communication peut être établie avec un ou plusieurs indicateurs non traités dans la présente section
tr_tr: Network Indicators - Göstergelerin ikinci bölümü ağ bağdaştırıcılarının ve güvenlik duvarlarının durumunu gösterir. Bunlar bilgilendirme amaçlıdır, bu bölümde bir veya daha fazla yanmayan gösterge ile iletişim kurulabilir.
zh_cn: Network Indicators (网络指示器) - 指示器的第二个部分会显示network adapter和防火墙的状态。仅供参考，通讯可以在大于等于1个指示器没有点亮的情况下建立连接

source: "Enet" indicates the IP address of the detected Ethernet adapter
fr_ca: "Enet" indique l’adresse IP de l’adaptateur Ethernet détecté
tr_tr: "Enet", tespit edilen Ethernet adaptörünün IP adresini gösterir
zh_cn: "Enet" (以太网) 会指示所检测到的 Ethenet adapter 的IP地址

source: "WiFi" indicates if a wireless adapter has been detected as enabled
fr_ca: "WiFi" indique si un adaptateur sans fil a été détecté comme activé
tr_tr: "WiFi", bir kablosuz adaptörün etkin olarak algılanıp algılanmadığını gösterir
zh_cn: "WiFi" 会指示是否已经启用无线网卡

source: "USB" indicates if a roboRIO USB connection has been detected
fr_ca: "USB" indique si une connexion USB du roboRIO a été détectée
tr_tr: "USB", bir roboRIO USB bağlantısının tespit edilip edilmediğini gösterir
zh_cn: "USB" 会指示是否检测到roboRIO已经使用USB连接

source: "Firewall" indicates if any firewalls are detected as enabled. Enabled firewalls will show in orange ( Dom = Domain, Pub = Public, Prv = Private)
fr_ca: "Firewall" indique si des pare-feux sont détectés comme activés. Les pare-feux activés s’affichent en orange ( Dom = Domaine, Pub = Public, Prv = Privé)
tr_tr: "Firewall", herhangi bir güvenlik duvarının etkin olarak algılanıp algılanmadığını belirtir. Etkinleştirilmiş güvenlik duvarları turuncu renkte gösterilir (Dom = Domain, Pub = Public, Prv = Private)
zh_cn: "Firewall" (防火墙) 会指示任何检测到的已启用防火墙。启用了的防火墙会显示橘黄色 (Dom是Domain，Pub是Public，Prv是Private)

source: Reboot roboRIO - This button attempts to perform a remote reboot of the roboRIO (after clicking through a confirmation dialog)
fr_ca: Reboot roboRIO - Ce bouton permet d’effectuer un redémarrage à distance du roboRIO (après avoir cliqué sur une boîte de dialogue de confirmation)
tr_tr: Reboot roboRIO - Bu düğme, roboRIO'yu uzaktan yeniden başlatmayı dener (bir onay iletişim kutusu tıklandıktan sonra)
zh_cn: Reboot roboRIO (重启roboRIO) - 这个按钮会在单击确认按钮以后远程重启roboRIO

source: Restart Robot Code - This button attempts to restart the code running on the robot (but not restart the OS)
fr_ca: Restart Robot Code - Ce bouton permet de redémarrer le programme en cours d’exécution sur le robot (mais pas redémarrer l’OS)
tr_tr: Restart Robot Code - Bu düğme, robot üzerinde çalışan kodu yeniden başlatmaya çalışır (ancak işletim sistemini yeniden başlatmaz)
zh_cn: Restart Robot Code (重新加载机器人代码) - 这个按钮会重新加载机器人上面的代码 (但不会重启系统)

source: Setup Tab
fr_ca: Onglet Setup
tr_tr: Setup Tabı
zh_cn: 设置栏

source: This is the third tab from the top on the left hand side.
zh_cn: 这是左边从上到下的第三个标签。

source: The Setup Tab contains a number of buttons teams can use to control the operation of the Driver Station:
fr_ca: L’onglet Setup contient un certain nombre de boutons que les équipes peuvent utiliser pour contrôler le fonctionnement de Driver Station :
tr_tr: Setup Sekmesi, ekiplerin Driver Station'ın çalışmasını kontrol etmek için kullanabileceği bir dizi düğme içerir:
zh_cn: 设置栏包含一系列按钮，可以用来控置Driver Station的操作
