Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/driver-station.po
Languages: fr_ca, tr_tr, zh_cn

source: Team Number - Should contain your FRC Team Number. This controls the mDNS name that the DS expects the robot to be at. Shift clicking on the dropdown arrow will show all roboRIO names detected on the network for troubleshooting purposes.
fr_ca: Team Number - Devrait contenir votre numéro d’équipe FRC. Cela contrôle le nom mDNS où DS s’attend à ce que le robot soit. Appuyer sur Shift tout en cliquant sur la flèche déroulante affichera tous les noms de roboRIO détectés sur le réseau à des fins de dépannage.
tr_tr: Team Number - FRC Takım Numaranızı içermelidir. Bu, DS'nin robotta olmasını beklediği mDNS adını kontrol eder. Açılır oka tıklamak, sorun giderme amacıyla ağda tespit edilen tüm roboRIO adlarını gösterecektir.
zh_cn: Team Number (队伍代码) - 需要包含贵队FRC队伍号。这将控制Driver Stationm希望机器人使用的mDNS名称。按住Shift键并单击朝下的箭头，将显示在网络上检测到的所有roboRIO名称，以进行故障排除。

source: Dashboard Type - Controls what Dashboard is launched by the Driver Station. :guilabel:`Default` launches the file pointed to by the "FRC DS Data Storage.ini" (for more information about setting a :ref:`custom dashboard <docs/software/driverstation/manually-setting-the-driver-station-to-start-custom-dashboard:Manually Setting the Driver Station to Start Custom Dashboard>` ), by default this is Dashboard.exe in the Program Files (x86)\\FRC Dashboard folder. :guilabel:`LabVIEW` attempts to launch a dashboard at the default location for a custom built LabVIEW dashboard, but will fall back to the default if no dashboard is found. :guilabel:`SmartDashboard` and :guilabel:`Shuffleboard` launch the respective dashboards included with the C++ and Java WPILib installation. :guilabel:`Remote` launches another dashboard from the "DashboardRemoteIP" field in the "FRC DS Data Storage.ini" file.
fr_ca: Dashboard Type - Contrôle quel dashboard est lancé par l'application Driver Station. :guilabel:`Default` lance le fichier vers lequel pointe le "FRC DS Data Storage.ini" (pour plus d’informations sur la configuration d’un :ref:`dashboard personnalisé <docs/software/driverstation/manually-setting-the-driver-station-to-start-custom-dashboard:Manually Setting the Driver Station to Start Custom Dashboard>` ), par défaut c’est le Dashboard.exe situé dans le dossier Fichiers de programme (x86)\\FRC Dashboard. :guilabel:`LabVIEW` tente de lancer un dashboard situé à l’emplacement par défaut pour un dashboard LabVIEW personnalisé, mais reviendra à la valeur par défaut si aucun tableau de bord n’est trouvé. :guilabel:`SmartDashboard` et :guilabel:`Shuffleboard` lancent les dashboards respectivement inclus avec l’installation WPILib C++ et Java . :guilabel:`Remote` lance un autre dashboard à partir du champ "DashboardRemoteIP" du fichier "FRC DS Data Storage.ini".
tr_tr: Dashboard Type - Driver Station tarafından hangi Dashboard'un başlatıldığını kontrol eder. :guilabel:`Default`, "FRC DS Data Storage.ini" tarafından işaret edilen dosyayı başlatır (:ref:`custom dashboard <docs/software/driverstation/manually-setting-the-driver-station-to-start-custom-dashboard:Manually Setting the Driver Station to Start Custom Dashboard> `), varsayılan olarak bu Program Files (x86)\\ RC Dashboard klasöründeki Dashboard.exe'dir. : guilabel: `LabVIEW`, özel olarak oluşturulmuş bir LabVIEW panosu için varsayılan konumda bir gösterge panosu başlatmaya çalışır, ancak hiçbir gösterge tablosu bulunmazsa varsayılana geri döner. : guilabel: `SmartDashboard` ve: guilabel:` Shuffleboard`, C++ ve Java WPILib kurulumunda bulunan ilgili kontrol panellerini başlatın. : :guilabel:`Remote`, "FRC DS Data Storage.ini" dosyasındaki "DashboardRemoteIP" alanından başka bir gösterge panosunu başlatır.
zh_cn: Dashboard Type (Dashboard 类型) - 控制 Driver Station 内置的 Dashboard。默认启动“ FRC DS Data Storage.ini”指向的文件（有关设置自定义Dashboard<docs/software/driverstation/manually-setting-the-driver-station-to-start-custom-dashboard:Manually Setting the Driver Station to Start Custom Dashboard>的更多信息），默认情况下，它是 Program Files (x86)\\FRC Dashboard.exe文件夹。 LabVIEW会尝试在自定义构建的 LabVIEW Dashboard的默认位置启动 Dashboard，但如果未找到 Dashboard，则会恢复为默认设置。 “SmartDashboard” 和 “Shuffleboard” 启动 C ++ 和 Java WPILib 安装中的各自的 Dashboard。“Remote” 从“ FRC DS Data Storage.ini”文件中的“DashboardRemoteIP”中启动另一个Dashboard。

source: Game Data - This box can be used for at home testing of the Game Data API. Text entered into this box will appear in the Game Data API on the Robot Side. When connected to FMS, this data will be populated by the field automatically.
fr_ca: Game Data - Cette boîte peut être utilisée en phase de développement pour les tests de l’API Game Data. Le texte entré dans cette zone apparaîtra dans l’API Game Data du côté robot. Lorsqu’elles sont connectées au FMS, ces données sont automatiquement remplies par le système de gestion du terrain.
tr_tr: Game Data - Bu kutu, Game Data API'nin evde test edilmesi için kullanılabilir. Bu kutuya girilen metin, Robot tarafındaki Game Data API'sinde görünecektir. FMS'ye bağlandığında, bu veriler alan tarafından otomatik olarak doldurulacaktır.
zh_cn: Game Data (比赛数据) - 这个窗口可以用于在家中测试 Game Data API。在这个栏输入的文本会出现在 Robot Side 的 Game Data 中。连接到场控系统时，这个数据会由field自动填充。

source: Practice Mode Timing - These boxes control the timing of each portion of the practice mode sequence. When the robot is enabled in practice mode the DS automatically proceeds through the modes indicated from top to bottom.
fr_ca: Practice Mode Timing - Ces cases contrôlent le minutage de chaque partie de la séquence du Mode de Pratique. Lorsque le robot est activé en Mode Pratique, DS passe automatiquement par les modes indiqués de haut en bas.
tr_tr: Practice Mode Timing - Bu kutular, uygulama modu sırasının her bir kısmının zamanlamasını kontrol eder. Robot uygulama modunda etkinleştirildiğinde, DS otomatik olarak yukarıdan aşağıya gösterilen modlarda ilerler.
zh_cn: Practice Mode Timing (练习模式时序) - 这些窗口制练习模式序列各部分的时序。在练习模式下启用机器人后，Driver Station 会自动执行从上到下的指示。

source: Audio Control - This button controls whether audio tones are sounded when the Practice Mode is used.
fr_ca: Audio Control - Ce bouton contrôle si les signaux sonores doivent être joués en Mode Pratique.
tr_tr: Audio Kontrolü - Bu düğme, practice Modu kullanıldığında ses tonlarının çıkıp çıkmayacağını kontrol eder.
zh_cn: Audio Control (音频控制) - 此按钮控制使用练习模式时是否发出音频。

source: USB Devices Tab
fr_ca: Onglet USB Devices
tr_tr: USB Devices Sekmesi
zh_cn: USB 设备栏

source: This is the fourth tab from the top on the left hand side.
zh_cn: 这是左边的第四个标签。

source: The USB Devices tab includes the information about the USB Devices connected to the DS
fr_ca: L’onglet USB Devices ou Périphériques USB inclut les informations relatives aux périphériques USB connectés à DS
tr_tr: USB Devices sekmesi, DS'ye bağlı USB Aygıtları hakkındaki bilgileri içerir.
zh_cn: USB设备栏包括有关连接到 Driver Station 的USB设备的信息

source: USB Setup List - This contains a list of all compatible USB devices connected to the DS. Pressing a button on a device will highlight the name in green and put 2 \*s before the device name
fr_ca: USB Setup List - Contient une liste de tous les périphériques USB compatibles connectés à DS. Appuyer sur un bouton d'un périphérique mettra en surbrillance le nom de ce périphérique en vert précédé de 2 *s.
tr_tr: USB Setup List - Bu, DS'ye bağlı tüm uyumlu USB cihazlarının bir listesini içerir. Bir cihazda bir düğmeye basmak, adı yeşil renkte vurgular ve cihaz adının önüne 2 \* lar koyar
zh_cn: USB Setup List (USB 设置列表) - 这包含连接到 Driver Station 的所有兼容USB设备的列表。按下设备上的按钮将以绿色突出显示名称，并在设备名称前加2 * s

source: Rescan - This button will force a Rescan of the USB devices. While the robot is disabled, the DS will automatically scan for new devices and add them to the list. To force a complete re-scan or to re-scan while the robot is Enabled (such as when connected to FMS during a match) press F1 or use this button.
fr_ca: Rescan - Ce bouton forcera un nouvel examen des périphériques USB. Quand le robot est désactivé, DS analyse automatiquement les nouveaux appareils et les ajoute à la liste. Pour forcer une analyse complète ou pour un réexamen alors que le robot est activé (par exemple lorsqu’il est connecté au FMS pendant un match) appuyez sur F1 ou utilisez ce bouton.
tr_tr: Rescan - Bu düğme, USB aygıtlarını yeniden taramaya zorlar. Robot devre dışı bırakıldığında, DS otomatik olarak yeni cihazları tarayacak ve bunları listeye ekleyecektir. Robot Enabled durumdayken tam bir yeniden taramayı zorlamak veya yeniden taramak için (örneğin bir maç sırasında FMS'ye bağlıyken) F1'e basın veya bu düğmeyi kullanın.
zh_cn: Rescan (重新扫描) - 此按钮将强制重新扫描USB设备。禁用机械人后，Driver Station 会自动扫描新设备并将其添加到列表中。要强制执行完整的重新扫描或在启用机器人时（例如在比赛中将其连接到场控系统时）重新扫描，请按F1或使用此按钮。

source: Device indicators - These indicators show the current status of the Axes, buttons and POV of the joystick.
fr_ca: Indicateurs de périphériques - Ces indicateurs montrent l’état actuel des Axes, boutons et POV de la manette.
tr_tr: Device indicators - Bu göstergeler, eksenlerin, düğmelerin ve joystick'in POV'unun mevcut durumunu gösterir.
zh_cn: Device indicators (设备指示器) - 这些指示器显示 Joystick 手柄的轴、按钮和POV的状态

source: Rumble - For XInput devices (such as X-Box controllers) the Rumble control will appear. This can be used to test the rumble functionality of the device. The top bar is "Right Rumble" and the bottom bar is "Left Rumble". Clicking and holding anywhere along the bar will activate the rumble proportionally (left is no rumble = 0, right is full rumble = 1). This is a control only and will not indicate the Rumble value set in robot code.
fr_ca: Rumble - Pour les périphériques XInput (tels que les contrôleurs X-Box), le contrôle Rumble s’affiche. Ceci peut être utilisé pour tester la fonction de vibration de l’appareil. La barre supérieure est "Left Rumble" et la barre inférieure est "Right Rumble". Cliquer et tenir n’importe où le long de la barre activera proportionnellement la vibration (à gauche, sans vibration = 0, à droite pleine vibration = 1). Il s’agit d’un contrôle uniquement et n’indiquera pas la valeur Rumble définie dans le code du robot.
tr_tr: Rumble - XInput cihazları (X-Box denetleyicileri gibi) için Rumble denetimi görünecektir. Bu, cihazın gürültü işlevselliğini test etmek için kullanılabilir. Üst çubuk "Sağ Rumble" ve alttaki çubuk "Sol Rumble" dır. Bar boyunca herhangi bir yere tıklamak ve basılı tutmak sarsıntıyı orantılı olarak etkinleştirecektir (sol sarsıntı yok = 0, sağ tam sarsıntı = 1). Bu yalnızca bir kontroldür ve robot kodunda ayarlanan Rumble değerini göstermez.
zh_cn: Rumble (蜂鸣器) - 对于X输入设备 (例如Xbox控制器) 会出现蜂鸣器控制。这可以用于测试设备的蜂鸣功能。最上面一栏是 "Right Rumble" (右蜂鸣器)，最下面一栏是 "Left Rumpble" (左蜂鸣器)。单击并按住任何蜂鸣器栏将启动部分蜂鸣器 (左侧是 rumble = 0，右侧是 rumbelr = 1)。这只能用来控制，不会指示机器人代码里的蜂鸣器的值。

source: Re-Arranging and Locking Devices
fr_ca: Réarrangement et ancrage des dispositifs
tr_tr: Cihazları Yeniden Düzenleme ve Kilitleme
zh_cn: Re-Arranging and Locking Devices (重新排序和锁定设备)

source: USB Order box where you can click and drag to rearrange the joysticks.
zh_cn: USB命令框，您可以点击和拖动，以重新安排操纵杆。

source: The Driver Station has the capability of "locking" a USB device into a specific slot. This is done automatically if the device is dragged to a new position and can also be triggered by double clicking on the device. "Locked" devices will show up with an underline under the device. A locked device will reserve it's slot even when the device is not connected to the computer (shown as grayed out and underlined). Devices can be unlocked (and unconnected devices removed) by double clicking on the entry.
fr_ca: Driver Station a la capacité de "verrouiller" un périphérique USB dans un port virtuel spécifique. Cela se fait automatiquement si le périphérique est déplacé vers une nouvelle position et peut également être déclenché en double-cliquant sur ce périphérique. Les périphériques "verrouillés" s’affichent soulignés. Un périphérique verrouillé conservera son port même lorsque l’appareil n’est pas connecté à l’ordinateur (affiché comme grisé et souligné). Les périphériques peuvent être déverrouillés (et les périphériques non connectés supprimés) en cliquant deux fois sur l’entrée.
tr_tr: Driver Station, bir USB aygıtını belirli bir yuvaya "kilitleme" özelliğine sahiptir. Bu, cihaz yeni bir konuma sürüklendiğinde otomatik olarak yapılır ve cihaza çift tıklanarak da tetiklenebilir. "Kilitli" cihazlar, cihazın altında bir alt çizgi ile gösterilir. Kilitli bir cihaz, cihaz bilgisayara bağlı olmadığında bile yuvasını rezerve eder (gri renkli ve altı çizili olarak gösterilir). Girişe çift tıklayarak cihazların kilidi açılabilir (ve bağlı olmayan cihazlar kaldırılabilir).
zh_cn: Driver Station 有能力把一个USB设备锁定在一个指定的插槽上。如果设备被拽到了一个新的插槽，双击设备则会自动触发。“锁定”设备会在设备下方显示下划线。就算一个锁定的设备没有连上电脑，也会保留该设备的位置插槽 (字体是灰色的且有下划线)。双击回车可以解锁设备 (并移除未连接的设备)。

source: If you have two or more of the same device, they should maintain their position as long as all devices remain plugged into the computer in the same ports they were locked in. If you switch the ports of two identical devices the lock should follow the port, not the device. If you re-arrange the ports (take one device and plug it into a new port instead of swapping) the behavior is not determinate (the devices may swap slots). If you unplug one or more of the set of devices, the positions of the others may move, they should return to the proper locked slots when all devices are reconnected.
fr_ca: Si vous avez deux ou plusieurs périphériques de même type, ils doivent maintenir leur position tant que tous les périphériques restent branchés sur l’ordinateur dans les mêmes ports physiques dans lesquels ils étaient verrouillés. Si vous changez les ports de deux périphériques de même type, le verrouillage est lié au port, et non au périphérique. Si vous ré-organisez les ports (prendre un périphérique et le brancher dans un nouveau port au lieu d’échanger), le comportement n’est pas prévisible (les périphériques peuvent permuter des ports). Si vous débranchez un ou plusieurs des périphériques, les positions des autres peuvent se déplacer, ils doivent revenir aux ports verrouillés appropriés lorsque tous les périphériques sont reconnectés.
tr_tr: Aynı aygıttan iki veya daha fazlasına sahipseniz, tüm aygıtlar bilgisayara kilitlendikleri aynı bağlantı noktalarında takılı kaldığı sürece konumlarını korumalıdırlar. Aynı iki aygıtın bağlantı noktalarını değiştirirseniz, kilit bağlantı noktasını izlemelidir. , cihaz değil. Bağlantı noktalarını yeniden düzenlerseniz (bir aygıtı alıp, değiştirmek yerine yeni bir bağlantı noktasına takın) davranış belirleyici olmaz (aygıtlar yuvaları değiştirebilir). Bir veya daha fazla aygıt setini çıkarırsanız, diğerlerinin konumları hareket edebilir, tüm aygıtlar yeniden bağlandığında uygun kilitli yuvalara dönmeleri gerekir.
zh_cn: 如果您有两个或多个相同的设备，只要所有设备都保持在它们锁定的相同端口中，它们就应保持其位置插槽。如果切换两个相同设备的端口，则锁定应紧随该端口 ，而不是设备。 如果您重新排列端口（拿一个设备并将其插入新端口而不是交换端口），则行为并不确定（设备可能交换位置）。 如果拔下一组设备中的一个或多个，其他设备的插槽位置可能会移动，则在重新连接所有设备时，它们应返回到正确的锁定位置。

source: Example: The image above shows 4 devices:
fr_ca: Exemple : L’image ci-dessus montre 4 périphériques :
tr_tr: Örnek: Yukarıdaki görüntü 4 cihazı göstermektedir:
zh_cn: 例如：上面的图片有4个设备

source: A Locked "Logitech Attack 3" joystick. This device will stay in this position unless dragged somewhere else or unlocked
fr_ca: Une manette "Logitech Attack 3" verrouillée. Ce périphérique restera dans cette position à moins d’être déplacé ailleurs ou déverrouillé
tr_tr: Kilitli "Logitech Attack 3" joystick. Bu cihaz, başka bir yere sürüklenmedikçe veya kilidi açılmadıkça bu konumda kalacak
zh_cn: 一个锁定的"Logitech Attack 3"手柄。这个设备会待在这各位，除非被拽到了别的插槽或者解锁

source: An unlocked "Logitech Extreme 3D" joystick
fr_ca: Une manette "Logitech Extreme 3D" déverrouillée
tr_tr: Kilitlenmemiş bir "Logitech Extreme 3D" joystick
zh_cn: 一个解锁的“Logitech Extreme 3D”手柄

source: An unlocked "Gamepad F310 (Controller)" which is a Logitech F310 gamepad
fr_ca: Un contrôleur "Gamepad F310 (Controller)" déverrouillé; c'est un Gamepad Logitech F310
tr_tr: Logitech F310 oyun kumandası olan kilidi açılmış bir "Gamepad F310 (Denetleyici)"
zh_cn: 一个解锁的“Gamepad F310 (Controller)"是一个 Logitech F310 gamepad

source: A Locked, but disconnected "MadCatz GamePad (Controller)" which is a MadCatz Xbox 360 Controller
fr_ca: Un contrôleur "MadCatz GamePad (Controller)" verrouillé mais déconnecté; c'est un contrôleur MadCatz Xbox 360
tr_tr: MadCatz Xbox 360 Kumandası olan kilitli, ancak bağlantısı kesilmiş bir "MadCatz GamePad (Denetleyici)"
zh_cn: 一个锁定但断开的 ”MadCatz GamePad (Controller)"，这是一个 MadCatz Xbox 360 Controller。

source: In this example, unplugging the Logitech Extreme 3D joystick will result in the F310 Gamepad moving up to slot 1. Plugging in the MadCatz Gamepad (even if the devices in Slots 1 and 2 are removed and those slots are empty) will result in it occupying Slot 3.
fr_ca: Dans cet exemple, débrancher la manette Logitech Extreme 3D se traduira pour le F310 Gamepad à passer au port 1. Le branchement du Gamepad MadCatz (même si les périphériques aux ports 1 et 2 sont supprimés et que ces emplacements sont vides) se traduira par l’occupation du port 3.
tr_tr: Bu örnekte, Logitech Extreme 3D oyun çubuğunun çıkarılması, F310 Gamepad'in 1. yuvaya çıkmasına neden olacaktır. MadCatz Gamepad takmak (Yuva 1 ve 2'deki cihazlar çıkarılsa ve bu yuvalar boş olsa bile) Yuva 3'ü işgal edecektir.
zh_cn: 在此示例中，拔下Logitech Extreme 3D游戏杆将导致F310游戏手柄向上移动到插槽1。插入MadCatz游戏手柄（即使已卸下插槽1和2中的设备并且这些插槽为空）也会导致其占用插槽3。

source: CAN/Power Tab
fr_ca: Onglet CAN/Power
tr_tr: CAN/Power Tabı
zh_cn: CAN/Power 选项

source: This is the fifth tab from the top on the left hand side.
zh_cn: 这是左手边的第5个标签。

source: The last tab on the left side of the DS is the CAN/Robot Power Tab. This tab contains information about the power status of the roboRIO and the status of the CAN bus:
fr_ca: Le dernier onglet sur le côté gauche de DS est l’onglet CAN/Power. Cet onglet contient des informations sur l’état de l’alimentation du roboRIO et l’état du bus CAN :
tr_tr: DS'nin sol tarafındaki son sekme CAN/Robot Power sekmesidir. Bu sekme roboRIO'nun güç durumu ve CAN veriyolunun durumu hakkında bilgiler içerir:
zh_cn: Driver Station 左边一栏最后一个选项是 CAN/Robot Powe 选项。这个选项包含 roboRIO 供电信息和 CAN 线的状态。

source: Comms Faults - Indicates the number of Comms faults that have occurred since the DS has been connected
fr_ca: Pannes Comms - Indique le nombre d'incidents de communication qui se sont produits depuis que DS a été connecté
tr_tr: Comms Faults - DS'nin bağlandığından beri meydana gelen Haberleşme arızalarının sayısını gösterir
zh_cn: Comms Faults (Comms 故障) - 显示 Driver Station 连接后出现了多少个 Comms 故障

source: 12V Faults - Indicates the number of input power faults (Brownouts) that have occurred since the DS has been connected
fr_ca: Pannes 12V - Indique le nombre de pannes de puissance d’entrée (sous-tensions) qui se sont produites depuis que DS a été connecté
tr_tr: 12V Faults - DS'nin bağlanmasından bu yana meydana gelen giriş gücü arızalarının (Brownouts) sayısını gösterir.
zh_cn: 12V Faults (12V故障) - 显示 Driver Station 连接后出现多少个输入电流故障 (电压过低)。

source: 6V/5V/3.3V Faults - Indicates the number of faults (typically cause by short circuits) that have occurred on the User Voltage Rails since the DS has been connected
fr_ca: Pannes 6V/5V/3.3V - Indique le nombre de pannes (généralement causées par des courts-circuits) qui se sont produites sur les barrettes de tension de l’utilisateur depuis que DS a été connecté
tr_tr: 6V/5V/3.3V Faults - DS bağlandıktan sonra kullanıcı elektrik hatlarında meydana gelen (tipik olarak kısa devrelerin neden olduğu) hata sayısını gösterir
zh_cn: 6V/5V/3.3V Faults (6V/5V/3.3V 故障) - 指示 Driver Station 连接后出在 User Voltage Rails 现的故障 (通常由短路导致) 的数量

source: CAN Bus Utilization - Indicates the percentage utilization of the CAN bus
fr_ca: Utilisation du Bus CAN - Indique le pourcentage d’utilisation du système bus CAN
tr_tr: CAN Bus Utilization - CAN veriyolunun kullanım yüzdesini gösterir
zh_cn: CAN Bus Utilization (CAN Bus 使用率) - 指示CAN线的占用率

source: CAN faults - Indicates the counts of each of the 4 types of CAN faults since the DS has been connected
fr_ca: Pannes CAN - Indique, pour chacun des 4 types de pannes CAN, le nombre de pannes produites depuis que DS a été connecté
tr_tr: CAN faults - DS bağlandığından beri 4 tip CAN arızasının her birinin sayısını gösterir.
zh_cn: CAN faults (CAN 线故障) - 指示 Driver Station 连接之后出现的4种CAN线错误的数量

source: If a fault is detected, the indicator for this tab (shown in blue in the image above) will turn red.
fr_ca: Si une panne survient, l’indicateur de cet onglet (indiqué en bleu dans l’image ci-dessus) deviendra rouge.
tr_tr: Bir arıza tespit edilirse, bu sekmenin göstergesi (yukarıdaki resimde mavi ile gösterilmiştir) kırmızıya dönecektir.
zh_cn: 如果检测到故障，这一栏的指示器 (上图显示的是蓝色) 会变红。

source: Messages Tab
fr_ca: Onglet Messages
tr_tr: Messages Tabı
zh_cn: 信息栏

source: This is the first tab from the top on the right hand side.
zh_cn: 这是右手边的第1个标签。

source: The Messages tab displays diagnostic messages from the DS, WPILib, User Code, and/or the roboRIO. The messages are filtered by severity. By default, only Errors are displayed.
fr_ca: L’onglet Messages affiche les messages de diagnostic de DS, de WPILib, du code de l'utilisateur et/ou du roboRIO. Les messages sont filtrés selon la gravité. Par défaut, seules les erreurs s’affichent.
tr_tr: Messages sekmesi DS, WPILib, User Code ve/veya roboRIO'dan tanı mesajlarını görüntüler. Mesajlar önem derecesine göre filtrelenir. Varsayılan olarak, yalnızca Hatalar görüntülenir.
zh_cn: 信息栏显示从 Driver Station、WPILib、用户代码或者 roboRIO 发送的诊断信息。信息会根据严重程度排序。默认上，只会显示错误。

source: To access settings for the Messages tab, click the Gear icon. This will display a menu that will allow you to select the detail level (Errors, Errors+Warnings or Errors+Warnings+Prints), Clear the box, launch a larger Console window for viewing messages, or launch the DS Log Viewer.
fr_ca: Pour accéder aux paramètres de l’onglet Messages, cliquez sur l’icône engrenage. Un menu vous permettra de sélectionner le niveau de détail (Erreurs, Erreurs+Avertissements ou Erreurs+Avertissements+Impressions), d’effacer la zone d'affichage, de lancer une console de fenêtre plus grande pour afficher les messages ou de lancer DS Log Viewer.
tr_tr: Messages sekmesinin ayarlarına erişmek için Dişli simgesini tıklayın. Bu, ayrıntı düzeyini (Errors, Errors+Warnings or Errors+Warnings+Prints) seçmenize, kutuyu temizlemenize, mesajları görüntülemek için daha büyük bir Konsol penceresi açmanıza veya DS Günlük Görüntüleyiciyi başlatmanıza olanak tanıyan bir menü görüntüler.
zh_cn: 想访问信息栏的设置，单击齿轮图标。这会显示一个菜单，允许你选择细节程度 (错误，错误+警告，错误+警告+打印)，清屏，载入更大的控制台窗口供浏览信息，或者载入 DS Log Viewer.

source: Charts Tab
fr_ca: Onglet Graphiques
tr_tr: Charts Sekmesi
zh_cn: 图标栏

source: This is the second tab from the top on the right hand side.
zh_cn: 这是右手边的第2个标签。

source: The Charts tab plots and displays advanced indicators of robot status to help teams diagnose robot issues:
fr_ca: L’onglet Graphiques trace et affiche des indicateurs avancés de l’état du robot pour aider les équipes à diagnostiquer les problèmes :
tr_tr: Charts sekmesi, takımların robot sorunlarını teşhis etmesine yardımcı olmak için robot durumunun gelişmiş göstergelerini çizer ve görüntüler:
zh_cn: 图标栏会绘制并显示更高级的机器人状态指示器，来帮助队伍诊断机器人的问题：
