Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/driverstation/programming-radios-for-fms-offseason.po
Languages: es_mx, tr_tr, zh_cn

source: Programming Radios for FMS Offseason
es_mx: Programación de Radios para FMS Offseason
tr_tr: FMS Offseason için Radyo Programlama
zh_cn: 给季后赛场控系统的路由器编程

source: When using the FMS Offseason software, the typical networking setup is to use a single access point with a single SSID and WPA key. This means that the radios should all be programmed to connect to this network, but with different IPs for each team. The Team version of the FRC\ |reg| Bridge Configuration Utility has an FMS-Lite mode that can be used to do this configuration.
es_mx: Cuando se usa el software FMS Offseason, la configuración de red típica es usar un solo punto de acceso con un solo SSID y clave WPA. Esto significa que todas las radios deben estar programadas para conectarse a esta red, pero con diferentes IP para cada equipo. La versión Team del FRC\ |reg| Bridge Configuration Utility tiene un modo FMS-Lite que se puede utilizar para realizar esta configuración.
tr_tr: FMS Offseason yazılımını kullanırken, tipik ağ kurulumu, tek bir SSID ve WPA anahtarı ile tek bir erişim noktası kullanmaktır. Bu, telsizlerin tümünün bu ağa bağlanmak üzere programlanması gerektiği anlamına gelir, ancak her ekip için farklı IP'lerle. FRC'nin Takım sürümü \ |reg| Bridge Configuration Utility, bu yapılandırmayı yapmak için kullanılabilen bir FMS-Lite moduna sahiptir.
zh_cn: 使用 FMS Offseason 软件时，典型的网络设置是使用具有单个 SSID 和 WPA 密钥的单个访问点。这意味着应该对所有路由器进行编程以连接到该网络，但是每个队伍的 IP 地址都不同。 FRC的团队版本 ® 网桥配置实用程序具有 FMS-Lite 模式，可用于执行此配置。

source: Before you begin using the software:
es_mx: Antes que empiece a usar el software:
tr_tr: Yazılımı kullanmaya başlamadan önce:
zh_cn: 在开始使用该软件之前：

source: Disable WiFi connections on your computer, as it may prevent the configuration utility from properly communicating with the bridge
es_mx: Deshabilite las conexiones WiFi en su computadora, ya que puede impedir a la utilidad de la configuración comunicarse adecuadamente con el puente de red.
tr_tr: Yapılandırma yardımcı programının köprü ile düzgün bir şekilde iletişim kurmasını engelleyebileceğinden bilgisayarınızdaki WiFi bağlantılarını devre dışı bırakın.
zh_cn: 禁用计算机上的 WiFi 连接，因为这可能会阻止配置使用与网桥正确通信

source: Make sure no devices are connected to your computer via ethernet, other than the wireless bridge.
es_mx: Asegúrese de que no haya dispositivos conectados a su computadora a través de Ethernet, excepto el puente de red inalámbrico.
tr_tr: Bilgisayarınıza ethernet kablosuyla kablosuz bağlantı cihazı dışında hiçbir aygıtın bağlı olmadığından emin olun.
zh_cn: 确保除无线网桥外，没有其他设备通过以太网连接到您的计算机。

source: Pre-Requisites
es_mx: Requisitos Previos
tr_tr: Önkoşullar
zh_cn: 前提条件

source: Even though WPILib uses Java 11, the FRC Radio Configuration Utility requires Java 8.
es_mx: Aunque WPILib usa Java 11, la FRC Radio Configuration Utility requiere Java 8.
tr_tr: WPILib, Java 11 kullansa da, FRC Radio Configuration Utility Java 8 gerektirir.
zh_cn: 即使 WPILib 使用 Java 11，FRC 路由器配置实用程序也需要 Java 8。

source: The FRC Radio Configuration Utility requires the Java Runtime Engine (JRE). If you do not have Java installed, you can download the JRE from `here <https://www.java.com/en/download/>`__.
es_mx: La FRC Radio Configuration Utility requiere el Java Runtime Engine (JRE). Si usted no tiene Java instalado, puede descargar el JRE desde `aquí <https://www.java.com/en/download/>`__.
tr_tr: FRC Radyo Yapılandırma Yardımcı Programı, Java Runtime Engine (JRE) gerektirir. Java kurulu değilse, JRE'yi `buradan <https://www.java.com/en/download/>`__ adresinden indirebilirsiniz.
zh_cn: FRC 路由器配置实用程序需要 Java 运行时引擎（JRE）。如果未安装 Java，则可以从“此处 https://www.java.com/en/download/ 下载 JRE。

source: The FRC Radio Configuration Utility requires Administrator privileges to configure the network settings on your machine. The program should request the necessary privileges automatically (may require a password if run from a non-Administrator account), but if you are having trouble try running it from an Administrator account.
es_mx: La FRC Radio Configuration Utility requiere privilegios del administrador para configurar los ajustes de red en su máquina. El programa debe solicitar los privilegios necesarios automáticamente (puede requerir una contraseña si se ejecuta desde una cuenta que no sea de administrador), pero si usted está teniendo problemas, intente ejecutarlo desde una cuenta de administrador.
tr_tr: FRC FRC Radio Configuration Utility Programı, makinenizdeki ağ ayarlarını yapılandırmak için Yönetici ayrıcalıkları gerektirir. Program gerekli ayrıcalıkları otomatik olarak istemelidir (Yönetici olmayan bir hesaptan çalıştırılırsa bir parola gerektirebilir), ancak sorun yaşıyorsanız, bir Yönetici hesabından çalıştırmayı deneyin.
zh_cn: FRC 路由器配置实用程序需要管理员权限，才能配置计算机上的网络设置。该程序应自动请求必要的权限（如果从非管理员帐户运行，则可能需要密码），但是如果遇到问题，请尝试从管理员帐户运行。

source: Application Notes
es_mx: Notas de Aplicación
tr_tr: Uygulama Notları
zh_cn: 应用须知

source: The Radio Kiosk will program the radio to enforce the 4 Mbps bandwidth limit on traffic exiting the radio over the wireless interface. In the home configuration (AP mode) this is a total, not a per client limit. This means that streaming video to multiple clients is not recommended.
es_mx: El Radio Kiosk programará la radio para aplicar el límite de ancho de banda de 4 Mbps en la salida de tráfico de la radio a través de la interfaz inalámbrica. En la configuración de inicio (modo AP) esto es un total, no un límite por cliente. Esto significa que no se recomienda transmitir video a múltiples clientes al mismo tiempo.
tr_tr: Radyo Kiosku, radyoyu kablosuz arayüz üzerinden radyodan çıkan trafiğe 4 Mbps bant genişliği sınırını uygulayacak şekilde programlayacaktır. Ev yapılandırmasında (AP modu) bu, istemci başına bir sınır değil, toplamdır. Bu, birden fazla istemciye video akışının tavsiye edilmediği anlamına gelir.
zh_cn: Radio Kiosk 将对路由器进行编程，以强制通过无线接口离开路由器的流量达到4 Mbps带宽限制。在家庭配置（AP模式）下，这是总带宽，而不是每个客户端的限制。这意味着不建议将视频流传输到多个客户端。

source: The Kiosk has been tested on Windows 7, 8, and 10. It may work on other operating systems, but has not been tested.
es_mx: El Kiosk ha sido probado en Windows 7, 8 y 10. Puede funcionar en otros sistemas operativos, pero no ha sido probado aun.
tr_tr: Bu Kiosk Windows 7, 8 ve 10'da test edilmiştir. Diğer işletim sistemlerinde çalışabilir, ancak test edilmemiştir.
zh_cn: Kiosk 已在Windows 7、8和10上进行了测试。它也许可以在其他操作系统上运行，但尚未经过测试。

source: Programmed Configuration
es_mx: Configuración Programada
tr_tr: Programlanmış Configuration
zh_cn: 程序配置

source: The Radio Configuration Utility programs a number of configuration settings into the radio when run. These settings apply to the radio in all modes (including at events). These include:
es_mx: La FRC Radio Configuration Utility programa una serie de ajustes de configuración en la radio cuando se inicia. Esta configuración se aplica a la radio en todos los modos (incluso en eventos). Éstos incluyen:
tr_tr: Radio Configuration Utility Programı, çalıştırıldığında radyoya bir dizi yapılandırma ayarı programlar. Bu ayarlar tüm modlarda (etkinliklerde dahil) telsiz için geçerlidir. Bunlar şunları içerir:
zh_cn: 运行时，“路由器配置实用程序”会将许多配置设置编程到无线电中。这些设置适用于所有模式下的路由器（包括在事件时）。这些包括：

source: Set a static IP of 10.TE.AM.1
es_mx: Establecer una IP estática de 10.TE.AM.1
tr_tr: 10.TE.AM.1 statik IP'si ayarlamak
zh_cn: 将静态 IP 设置为 10.TE.AM.1

source: Set an alternate IP on the wired side of 192.168.1.1 for future programming
es_mx: Establecer una IP alternativa en el lado cableado de 192.168.1.1 para programación futura
tr_tr: Gelecekteki programlama ihtiyaçları için 192.168.1.1 'in kablolu tarafında alternatif bir IP ayarı.
zh_cn: 在 192.168.1.1 的有线侧设置备用 IP 以供将来编程

source: Bridge the wired ports so they may be used interchangeably
es_mx: Conectar los puertos cableados para que puedan ser usados indistintamente
tr_tr: Kablolu bağlantı noktalarını köprüleyin, böylece birbirlerinin yerine kullanılabilirler
zh_cn: 桥接有线端口，以便可以互换使用

source: The LED configuration noted in the graphic above
es_mx: La configuración del LED indicada en el gráfico anterior
tr_tr: Yukarıdaki grafikte belirtilen LED konfigürasyonu
zh_cn: 上图中指出的LED配置

source: 4Mb/s bandwidth limit on the outbound side of the wireless interface
es_mx: Límite de ancho de banda de 4 Mb/s en el lado de salida de la interfaz inalámbrica
tr_tr: Kablosuz arayüzün giden tarafında 4Mb/s bant genişliği sınırı
zh_cn: 无线接口传输的带宽限制为4Mb / s

source: QoS rules for internal packet prioritization (affects internal buffer and which packets to discard if bandwidth limit is reached). These rules are Robot Control and Status (UDP 1110, 1115, 1150) >> Robot TCP & :term:`NetworkTables` (TCP 1735, 1740) >> Bulk (All other traffic).
es_mx: Reglas de QoS para la priorización de paquetes internos (afecta al buffer interno y qué paquetes descartar si se alcanza el límite de ancho de banda). Estas reglas son Robot Control y Status (UDP 1110, 1115, 1150) >> Robot TCP y :term:`NetworkTables` (TCP 1735, 1740) >> Bulk (Todo el resto del tráfico).

source: See the :ref:`Status Light Reference <docs/hardware/hardware-basics/status-lights-ref:OpenMesh Radio>` for details on the behavior of the radio status lights when configured.
es_mx: Consulte la :ref:`Status Light Reference <docs/hardware/hardware-basics/status-lights-ref:OpenMesh Radio>` para obtener detalles sobre el comportamiento de las luces de estado de la radio cuando está configurada
tr_tr: Yapılandırıldığında telsiz durum ışıklarının davranışı hakkında ayrıntılar için bkz: ref: Durum Işığı Referansı <docs/hardware/hardware-basics/status-lights-ref:OpenMesh Radio>.
zh_cn: 有关配置后路由器状态灯的详细信息，请参见“状态灯参考”：34.3.3 OpenMesh Radio

source: When programmed with the team version of the Radio Configuration - Utility, the user accounts will be left at (or set to) the firmware - defaults **for the DAPs only**:
es_mx: Cuando se programa con la versión del equipo de Radio Configuration - Utility, las cuentas de usuario se dejarán en (o se establecerán en) el firmware - predeterminado **for the DAPs only**:
tr_tr: Radio Configuration yardımcı programının takım sürümü ile programlandığında, kullanıcı hesapları **sadece DAP'ler için** farbrika ayarı varsayılanları olarak bırakılır (veya ayarlanır)
zh_cn: 使用“路由器配置-实用程序”的团队版本进行编程时，用户帐户将保留（或设置为）固件-默认“仅适用于 DAP”：

source: Username: root
es_mx: Nombre de Usuario: root
tr_tr: Kullanıcı adı : root
zh_cn: 用户名：root

source: Password: root
es_mx: Contraseña: root
tr_tr: Şifre : root
zh_cn: 密码：root

source: It is not recommended to modify the configuration manually
es_mx: No se recomienda modificar la configuración manualmente.
tr_tr: Yapılandırmayı manuel olarak değiştirmeniz önerilmez
zh_cn: 不建议手动修改配置

source: Download the software
es_mx: Descargar el software
tr_tr: Yazılımı indirin
zh_cn: 下载软件

source: Download the latest FRC Radio Configuration Utility Installer from the `WPILib project File Releases <https://usfirst.collab.net/sf/frs/do/listReleases/projects.wpilib/frs.frc_radio_configuration_utility>`__.
es_mx: Descargue el ultimo instalador del FRC Radio Configuration Utility desde `WPILib project File Releases <https://usfirst.collab.net/sf/frs/do/listReleases/projects.wpilib/frs.frc_radio_configuration_utility>`__.
tr_tr: En son FRC Radio Configuration Utility yükleyicisini `WPILib project File Releases <https://usfirst.collab.net/sf/frs/do/listReleases/projects.wpilib/frs.frc_radio_configuration_utility>`__.
zh_cn: 从 “WPILib 项目发行文件”https://usfirst.collab.net/sf/frs/do/listReleases/projects.wpilib/frs.frc_radio_configuration_utility 下载最新的 “FRC 路由器配置实用程序”的安装包。

source: Install the software
es_mx: Instalar el software
tr_tr: Yazılımı kurun
zh_cn: 安装软件

source: Double click on FRC_Radio_Configuration_MM_DD_YY.exe to launch the installer. Follow the prompts to complete the installation.
es_mx: De doble clic en FRC_Radio_Configuration_MM_DD_YY.exe para abrir el instalador. Siga las indicaciones que aparecen para completar la instalación.
tr_tr: Yükleyiciyi başlatmak için FRC_Radio_Configuration_MM_DD_YY.exe üzerine çift tıklayın. Kurulumu tamamlamak için talimatları izleyin.
zh_cn: 双击 FRC_Radio_Configuration_MM_DD_YY.exe 以启动安装程序。按照提示完成安装。

source: Part of the installation prompts will include installing WinPCap if it is not already present. The WinPCap installer contains a checkbox (checked by default) to start the WinPCap driver on boot. You should leave this box checked.
es_mx: Parte de las indicaciones de instalación pueden incluir instalar WinPCap en caso que no esté instalado. El instalador WinPCap contiene una casilla (palomeada predeterminadamente) para iniciar el WinPCap driver. Usted debe dejar la casilla palomeada.
tr_tr: Kurulum bilgi istemlerinin bir kısmı, zaten mevcut değilse WinPCap'in kurulmasını içerecektir. WinPCap yükleyicisi, WinPCap sürücüsünü önyüklemede başlatmak için bir onay kutusu (varsayılan olarak işaretlidir) içerir. Bu kutuyu işaretli bırakmalısınız.
zh_cn: 如果尚未安装 WinPCap，则一部分的安装提示将包括安装WinPCap。 WinPCap安装程序包含一个勾选框（默认情况下已选中），用于在启动时启动WinPCap驱动程序。您应该选中此框。

source: Launch the software
es_mx: Iniciar el software
tr_tr: Yazılımı başlatın
zh_cn: 启动软件

source: Use the Start menu or desktop shortcut to launch the program.
es_mx: Use el menu de inicio o el atajo del escritorio para iniciar el programa.
tr_tr: Programı başlatmak için Start menüsünü veya masaüstü kısayolunu kullanın.
zh_cn: 使用“开始”菜单或桌面快捷方式启动程序。

source: If you need to locate the program it is installed to ``C:/Program Files (x86)/FRC Radio Configuration Utility``. For 32-bit machines the path is ``C:/Program Files/FRC Radio Configuration Utility/``
es_mx: Si usted necesita localizar el programa, está instalado en ``C:/Program Files (x86)/FRC Radio Configuration Utility``. Para computadoras de 32-bit la ubicación es ``C:/Program Files/FRC Radio Configuration Utility/``
tr_tr: Programı bulmanız gerekirse, ``C:/Program Files (x86)/FRC Radio Configuration Utility`` konumuna kurulur. 32 bit makineler için yol ``C:/Program Files/FRC Radio Configuration Utility``dır.
zh_cn: 如果需要找到该程序，则将其安装到``C：/ Program Files（x86）/ FRC Radio Configuration Utility''。对于32位计算机，路径为``C：/ Program Files / FRC Radio Configuration Utility /''

source: Allow the program to make changes, if prompted
es_mx: Permitir al programa hacer cambios si lo solicita
tr_tr: İstenirse programın değişiklik yapmasına izin verin
zh_cn: 如果出现提示，请允许程序进行更改

source: If the your computer is running Windows Vista or Windows 7, a prompt may appear about allowing the configuration utility to make changes to the computer. Click "Yes" if the prompt appears.
es_mx: Si su computadora funciona con Windows Vista o Windows 7, una solicitud puede aparecer acerca de permitir a la configuration utility hacer cambios en la computadora. De clic en “Yes” si la solicitud aparece.
tr_tr: Bilgisayarınız Windows Vista veya Windows 7 çalıştırıyorsa, yapılandırma yardımcı programının bilgisayarda değişiklik yapmasına izin verilmesi hakkında bir istem görünebilir. İstem görünürse "Yes" i tıklayın.
zh_cn: 如果您的计算机运行的是 Windows Vista 或 Windows 7，则可能会出现提示，提示允许配置实用程序对计算机进行更改。如果出现提示，请单击“是”。

source: Enter FMS-Lite Mode
es_mx: Establecer FMS-Lite Mode
tr_tr: FMS-Lite Mode Seçin
zh_cn: 进入 FMS-Lite 模式

source: Click ``Tools`` -> ``FMS-Lite Mode`` to enter FMS-Lite Mode.
es_mx: De clic en ``Tools`` -> ``FMS-Lite Mode`` para seleccionar FMS-Lite Mode.
tr_tr: FMS-Lite Mode'a girmek için ``Tools`` -> ``FMS-Lite Mode`` tıklayınız.
zh_cn: 单击``工具'' -> “FMS-Lite 模式'' 以进入 FMS-Lite 模式。

source: Enter SSID
es_mx: Ingrese un SSID
tr_tr: SSID girin
zh_cn: 输入 SSID

source: Enter the SSID (name) of your wireless network in the box and click OK.
es_mx: Ingrese el SSID (nombre) de su red inalámbrica en el recuadro y de clic en OK.
tr_tr: Kablosuz ağınızın SSID'sini (adını) kutuya girin ve Tamam'ı tıklayın.
zh_cn: 在框中输入您的无线网络的 SSID（名称），然后单击“确定”。

source: Enter WPA Key
es_mx: Ingrese una clave WPA
tr_tr: WPA Key girin
zh_cn: 输入 WPA 密钥

source: Enter the WPA key for your network in the box and click OK. Leave the box blank if you are using an unsecured network.
es_mx: Ingrese una clave de WPA para su red en el recuadro y de clic en OK. Deje el recuadro en vacío si está usando una red insegura.
tr_tr: Ağınız için WPA anahtarını kutuya girin ve Tamam'ı tıklayın. Güvenli olmayan bir ağ kullanıyorsanız kutuyu boş bırakın.
zh_cn: 在框中输入网络的 WPA 密钥，然后单击“确定”。如果使用的是不安全的网络，请将该框保留为空白。

source: Program Radios
es_mx: Programar Radios
tr_tr: Radyoları Programlama
zh_cn: 路由器程序

source: The Kiosk is now ready to program any number of radios to connect to the network entered. To program each radio, connect the radio to the Kiosk, set the Team Number in the box, and click Configure.
es_mx: El Kiosk está ahora listo para programar cualquier número de radios para conectarse a la red ingresada. Para programar cada radio, conecte la radio a el Kiosk, ingrese su número de equipo en el recuadro, y de clic en Configure.
tr_tr: Kiosk artık girilen ağa bağlanmak için herhangi bir sayıda radyoyu programlamaya hazırdır. Her bir radyoyu programlamak için, radyoyu Kiosk'a bağlayın, kutuda Team Number ayarlayın ve Configure'e tıklayın.
zh_cn: 现在，Kiosk 已准备好对任意数量的路由器进行编程，以连接到所输入的网络。要为每个路由器编程，请将路由器连接到 Kiosk，在框中设置队伍编号，然后单击配置。

source: The kiosk will program OpenMesh, D-Link Rev A or D-Link Rev B radios to work on an offseason FMS network by selecting the appropriate option from the "Radio" dropdown.
es_mx: El Kiosk programará radios OpenMesh, D-Link Rev A or D-Link Rev B para trabajar en una red FMS Offseason al seleccionar la opción adecuada en el menú “Radio”.
tr_tr: Kiosk, OpenMesh, D-Link Rev A veya D-Link Rev B telsizlerini "Radio" açılır menüsünden uygun seçeneği seçerek sezon dışı bir FMS ağında çalışacak şekilde programlayacaktır.
zh_cn: 通过从“路由qi1”下拉列表中选择适当的选项，Kiosk 将对 OpenMesh，D-Link Rev A 或 D-Link Rev B无线电进行编程，使其能够在季后赛场控网络上工作。

source: Bandwidth limitations and QoS will not be configured on the D-Link radios in this mode.
es_mx: Los límites de banda ancha y QoS no se configurarán en los radios D-Link en este modo.
tr_tr: Bu modda D-Link telsizlerinde bant genişliği sınırlamaları ve QoS yapılandırılmayacaktır.
zh_cn: 在此模式下，不会在 D-Link 路由器上配置带宽限制和 QoS。

source: Changing SSID or Key
es_mx: Cambiar el SSID o una clave de WPA
tr_tr: SSID veya Anahtarın Değiştirilmesi
zh_cn: 更改 SSID 或密钥

source: If you enter something incorrectly or need to change the SSID or WPA Key, go to the Tools menu and click FMS-Lite Mode to take the kiosk out of FMS-Lite Mode. When you click again to put the Kiosk back in FMS-Lite Mode, you will be re-prompted for the SSID and Key.
es_mx: Si usted ingresa algo incorrecto o necesita cambiar la SSID o la clave de WPA, vaya al menú Tools y de clic en FMS-Lite Mode para sacar el Kiosk de FMS-Lite Mode. Cuando de clic de nuevo para configurar el Kiosk de nuevo en FMS-Lite Mode, se le solicitará otra vez por el SSID y la clave WPA.
tr_tr: Yanlış bir şey girerseniz veya SSID veya WPA anahtarını değiştirmeniz gerekirse, kiosku FMS-Lite Modundan çıkarmak için Tools menüsüne gidin ve FMS-Lite Moduna tıklayın. Kiosk'u FMS-Lite Moduna geri getirmek için tekrar tıkladığınızda, SSID ve Anahtar için yeniden sorulacaktır.
zh_cn: 如果您输入的内容有误或需要更改 SSID 或 WPA 密钥，请转到“工具”菜单，然后单击“ FMS-Lite模式”以使 Kiosk 退出 FMS-Lite 模式。当您再次单击以使 Kiosk 处于 FMS-Lite 模式时，将再次提示您输入SSID 和密钥。
