Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/support/support-resources.po
Languages: fr_ca, he_il

source: Support Resources
fr_ca: Ressources d'assistance
he_il: משאבי תמיכה

source: In addition to the documentation here, there are a variety of other resources available to FRC\ |reg| teams to help understand the Control System and software.
fr_ca: En plus de la documentation fournie, FRC\ |reg| vous propose plusieurs autres ressources pour vous aider à comprendre le système de contrôle et le logiciel.
he_il: בנוסף לתיעוד כאן, יש מגוון משאבים אחרים הזמינים לקבוצות FRC\ |reg| שעשויים לעזור להבין את מערכת הבקרה והתוכנה.

source: Other Documentation
fr_ca: Les autres documentations
he_il: תיעוד נוסף

source: In addition to this site there are a few other places teams may check for documentation:
fr_ca: En plus de ce site, il existe quelques autres endroits où les équipes peuvent obtenir de la documentation:
he_il: בנוסף לאתר זה ישנם מספר מקומות אחרים שקבוצות עשויים להשתמש עבור תיעוד:

source: `NI FRC Community Documents Section <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=documents>`__
fr_ca: `Section des documents de la communauté NI FRC <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=documents>`__
he_il: `פורום קהילת FRC ב-NI <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=documents>`__

source: Forums
fr_ca: Les forums
he_il: פורומים

source: Stuck? Have a question not answered by the documentation? Official Support is provided on these forums:
fr_ca: Vous avez une question à laquelle la documentation n'a pas répondue? Un support officiel est fourni sur ces forums:
he_il: נתקעתם? יש לכם שאלה שלא נענתה בתיעוד? תמיכה רשמית ניתנת בפורומים הבאים:

source: `NI FRC Community Discussion Section <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=discussions>`__ (roboRIO, LabVIEW and Driver Station software questions)
fr_ca: `Section de discussion de la communauté NI FRC <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=discussions>`__ (Questions sur les logiciels roboRIO, LabVIEW et Driver Station)
he_il: `פורום קהילת FRC ב-NI <https://forums.ni.com/t5/FIRST-Robotics-Competition/bd-p/1014?profile.language=en&view=discussions>`__ (שאלות בנוגע ל-roboRIO, LabVIEW ותוכנת ה-Driver Station)

source: `FIRST Inspires Control System Forum <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/control-system?f=1338>`__ (wiring, hardware and Driver Station questions)
fr_ca: `FIRST Inspires Control System Forum <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/control-system?f=1338>`__ (câblage, questions relatives aux dispositifs électronique et la Driver Station)
he_il: `פורום מערכות הבקרה של FIRST <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/control-system?f=1338>`__ (שאלות בנוגע לחיווט, חומרה ו-Driver Station)

source: `FIRST Inspires Programming Forum <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/programming-aa>`__ (programming questions for C++, Java, or LabVIEW)
fr_ca: `FIRST Inspires Programming Forum <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/programming-aa>`__ (questions de programmation pour C ++, Java, ou LabVIEW)
he_il: `פורום התכנות של FIRST <https://forums.firstinspires.org/forum/general-discussions/first-programs/first-robotics-competition/competition-discussion/programming-aa>`__ (עבור שאלות תכנות ב-C++, Java או LabVIEW)

source: `NI FRC Support Forum <https://forums.ni.com/t5/Support/ct-p/Support>`__
fr_ca: `Forum de soutien NI FRC <https://forums.ni.com/t5/Support/ct-p/Support>`__
he_il: `פורום תמיכת FRC של NI <https://forums.ni.com/t5/Support/ct-p/Support>`__

source: CTRE Support
fr_ca: Assistance CTRE
he_il: תמיכת CTRE

source: Support for Cross The Road Electronics components (Pneumatics Control Module, Power Distribution Panel, Talon SRX, and Voltage Regulator Module) is provided via the email address `support@crosstheroadelectronics.com <mailto:support@crosstheroadelectronics.com>`__
fr_ca: La prise en charge des composants Cross The Road Electronics (module de commande pneumatique, panneau de distribution d'alimentation, Talon SRX et module de régulation de tension) est fournie via l'adresse e-mail `support@crosstheroadelectronics.com <mailto:support@crosstheroadelectronics.com>`__

source: REV Robotics Support
fr_ca: Assistance REV Robotics
he_il: תמיכת REV Robotics

source: Support for REV Robotics components (SPARK MAX, Sensors, upcoming new control system components) is provided via phone at `844-255-2267 <tel:844-255-2267>`__ or via the email address `support@revrobotics.com <support@revrobotics.com>`__
fr_ca: La prise en charge des composants REV Robotics (SPARK MAX, capteurs, nouveaux composants du système de contrôle à venir) est fournie par téléphone au `844-255-2267` __ ou via l'adresse e-mail `support@revrobotics.com <support@revrobotics.com>`__

source: Other Vendors
fr_ca: Autres fournisseurs
he_il: ספקים נוספים

source: Support for vendors outside of the KOP can be found below.
fr_ca: Le support pour les fournisseurs en dehors du KOP peut être trouvé ci-dessous.
he_il: תמיכה עבור ספקים מחוץ ל-KoP ניתן למצוא מטה.

source: Unofficial Support
fr_ca: Soutien non officiel
he_il: תמיכה לא רשמית

source: There are useful forms of support provided by the community through various forums and services. The below links and websites are not endorsed by FIRST\ |reg| and are use at your own risk.
fr_ca: Il existe des formes utiles de soutien fournies par la communauté à travers divers forums et services. Les liens et sites Web ci-dessous ne sont pas approuvés par FIRST\ |reg| et sont utilisés à vos risques et périls.

source: `Chief Delphi <https://chiefdelphi.com>`__
fr_ca: `Chef Delphi <https://chiefdelphi.com>`__

source: Bug Reporting
fr_ca: Rapport de bogue
he_il: דיווח על באגים

source: Found a bug? Let us know by reporting it in the Issues section of the appropriate WPILibSuite project on Github: https://github.com/wpilibsuite
fr_ca: Vous avez trouvé un bogue? Faites-le nous savoir en le signalant dans la section Problèmes du projet WPILibSuite approprié sur Github: https://github.com/wpilibsuite

source: `FIRST Inspires Technical Resources Page <https://www.firstinspires.org/resource-library?flagged=All&combine=&field_content_type_value%5B0%5D=first_robotics_competition&field_resource_library_tags_tid=171&sort_by=created_1>`__
he_il: `עמוד משאבים טכניים באתר FIRST <https://www.firstinspires.org/resource-library?flagged=All&combine=&field_content_type_value%5B0%5D=first_robotics_competition&field_resource_library_tags_tid=171&sort_by=created_1>`__

source: `CTRE Software & Resources Page <https://store.ctr-electronics.com/software/>`__
he_il: `עמוד התוכנות והמשאבים של CTRE <https://store.ctr-electronics.com/software/>`__

source: Support for Cross The Road Electronics components (Pneumatics Control Module, Power Distribution Panel, Talon SRX, and Voltage Regulator Module) is provided via the email address `support@crosstheroadelectronics.com <mailto:support@crosstheroadelectronics.com>`__.
he_il: תמיכה עבור רכיבי Cross The Road Electronics (מודול בקרת פניאומטיקה, PDP, Talon SRX ו-VRM ניתנת באמצעות הדוא״ל `support@crosstheroadelectronics.com <mailto:support@crosstheroadelectronics.com>`__.

source: There are useful forms of support provided by the community through various forums and services. The below links and websites are not endorsed by FIRST\ |reg| and may be used at your own risk.
he_il: ישנן כמה פורומי תמיכה הניתנת על-ידי הקהילה בכלים שונים. הקישורים והאתרים שלהלן אינם מוסמכים על יד FIRST\ |reg| והשימוש בהם על אחריותכם בלבד.

source: Found a bug? Let us know by reporting it in the Issues section of the appropriate WPILibSuite project on GitHub: https://github.com/wpilibsuite
he_il: מצאתם באג? הודיעו לנו באמצעות Issue בפרויקט ה-WPILibSuite המתאים ב-GitHub: https://github.com/wpilibsuite
