Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-2/offline-installation-preparations.po
Languages: es_mx, fr_ca, he_il, zh_cn

source: Offline Installation Preparation
es_mx: Preparación de Instalación Sin Conexión
fr_ca: Préparation de l’installation hors ligne
he_il: הכנת להתקנה Offline
zh_cn: 离线安装准备

source: This article contains instructions/links to components you will want to gather if you need to do offline installation of the FRC\ |reg| Control System software.
es_mx: Este artículo contiene instrucciones y enlaces a los componentes que querrá recopilar si necesita realizar una instalación sin conexión del software FRC\ |reg| Control System.
fr_ca: Cet article contient des instructions/liens vers des composants qu'il serait souhaitable de réunir si vous devez effectuer l’installation hors ligne du logiciel du système de contrôle FRC\ |reg| .
he_il: מאמר זה מכיל הנחיות וקישורים לרכיבים שתרצו לשמור אם תצטרכו לבצע התקנה Offline של תוכנות מערכת הבקרה.
zh_cn: 本文包含有关要脱机安装FRC®控制系统软件时要收集的组件的说明/链接。

source: This document compiles all the download links from the following documents to make it easier to install on offline computers or on multiple computers. If you are you installing on a single computer that is connected to the internet, you can skip this page.
es_mx: Este documento recopila todos los enlaces de descarga de los siguientes documentos para facilitar la instalación en computadoras sin conexión o en múltiples computadoras. Si lo está instalando en un solo ordenador que está conectado a Internet, puede saltarse esta página.
fr_ca: Ce document compile tous les liens de téléchargement à partir des documents suivants pour faciliter l'installation sur des ordinateurs hors ligne ou sur plusieurs ordinateurs. Si vous installez sur un seul ordinateur connecté à Internet, vous pouvez ignorer cette page.
he_il: מסמך זה מכיל את כל קישורי ההורדה כדי להקל את ההתקנה במחשבים לא מקוונים (Offline) או במספר מחשבים. אם אתם מתקינים מחשב בודד שמחובר לאינטרנט, אפשר לדלג על דף זה.
zh_cn: 本文档编译了以下文档中的所有下载链接，以使其更易于在脱机计算机或多台计算机上安装。如果要在连接到互联网的单台计算机上安装，则可以跳过此页面。

source: The order in which these tools are installed does not matter for Java and C++ teams. LabVIEW should be installed before the FRC Game Tools or 3rd Party Libraries.
es_mx: El orden de instalación de estas herramientas no importa para los equipos Java y C++. LabVIEW debe instalarse antes que las Herramientas de Juego FRC u otra librería de 3eros.
fr_ca: L’ordre dans lequel ces outils sont installés n’a pas d’importance pour les équipes Java et C++. LabVIEW doit être installé avant les outils de jeu FRC ou les librairies tierces.
he_il: סדר ההתקנה אינו משנה עבור קבוצות Java ו-C++. יש להתקין את LabVIEW לפני התקנת ה-FRC Game Tools או ספריות צד שלישי.
zh_cn: 对于Java和C ++团队，这些工具的安装顺序无关紧要。LabVIEW应该在FRC游戏工具或第三方库之前安装。

source: This documentation can be downloaded for offline viewing. The link to download the PDF can be found `here <https://buildmedia.readthedocs.org/media/pdf/frc-docs/stable/frc-docs.pdf>`__.
fr_ca: Cette documentation peut être téléchargée pour une lecture hors ligne. Le lien pour télécharger la version PDF est disponible `ici <https://buildmedia.readthedocs.org/media/pdf/frc-docs/stable/frc-docs.pdf>`__.
he_il: ניתן להוריד תיעוד זה לצפייה במצב לא מקוון. את הקישור להורדת ה-PDF ניתן למצוא `כאן <https://buildmedia.readthedocs.org/media/pdf/frc-docs/stable/frc-docs.pdf>`__.

source: Installers
es_mx: Instaladores
fr_ca: Logiciels d'installation
he_il: מתקינים (Installers)
zh_cn: 安装人员

source: All Teams
es_mx: Todos los equipos
fr_ca: Toutes les équipes
he_il: כל הקבוצות
zh_cn: 所有队伍

source: The 2022 FRC Game Tools are not yet available, the link currently points to where they will be posted. They are expected to be available on the afternoon of 1/7/22.
fr_ca: Les outils de Jeu FRC 2022 ne sont pas encore disponibles, le lien pointe actuellement vers l’endroit où il seront publiés. Ils devraient être disponibles au plus tard le 7/1/22 en après-midi .

source: `2022 FRC Game Tools <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__ (Note: Click on link for "Individual Offline Installers")
fr_ca: `Outils de Jeu 2022 <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__ (Remarque: Cliquez sur le lien pour "Individual Offline Installers")

source: `2022 FRC Radio Configuration Utility <https://firstfrc.blob.core.windows.net/frc2022/Radio/FRC_Radio_Configuration_22_0_1.zip>`__ or `2022 FRC Radio Configuration Utility Israel Version <https://firstfrc.blob.core.windows.net/frc2022/Radio/FRC_Radio_Configuration_22_0_1_IL.zip>`__
fr_ca: `Utilitaire de configuration de la radio FRC 2022 <https://firstfrc.blob.core.windows.net/frc2022/Radio/FRC_Radio_Configuration_22_0_1.zip>`__ ou `Utilitaire de configuration de la radio FRC 2022 version Israel <https://firstfrc.blob.core.windows.net/frc2022/Radio/FRC_Radio_Configuration_22_0_1_IL.zip>`__
he_il: `2022 FRC Radio Configuration Utility <https://firstfrc.blob.core.windows.net/frc2022/Radio/FRC_Radio_Configuration_22_0_1.zip>`__ או `2022 FRC Radio Configuration Utility עבור ישראל <https://firstfrc.blob.core.windows.net/frc2022/Radio/FRC_Radio_Configuration_22_0_1_IL.zip>`__

source: (Optional - Veterans Only!) `Classmate/Acer PC Image <https://frc-events.firstinspires.org/services/DSImages/>`__
es_mx: (Opcional - ¡Solo para veteranos!) `Classmate/Acer PC Image <https://frc-events.firstinspires.org/services/DSImages/>`__
fr_ca: (Facultatif - Vétérans seulement!) `Image Classmate/Acer PC <https://frc-events.firstinspires.org/services/DSImages/>`__
he_il: (אופציונלי - לקבוצות ותיקות בלבד) `Classmate/Acer PC Image <https://frc-events.firstinspires.org/services/DSImages/>`__
zh_cn: (可选-仅限于退伍军人！) `Classmate/Acer PC Image <https://frc-events.firstinspires.org/services/DSImages/>`__

source: LabVIEW Teams
es_mx: Equipos de LabVIEW
fr_ca: Équipes LabVIEW
he_il: קבוצות LabVIEW
zh_cn: LabVIEW团队

source: LabVIEW USB (from *FIRST*\ |reg| Choice) or `Download <https://www.ni.com/en-us/support/downloads/drivers/download.labview-software-for-frc.html>`__ (Note: Click on link for "Individual Offline Installers")
es_mx: LabVIEW USB (de *FIRST*\ |reg| Choice) o `Descargar <https://www.ni.com/en-us/support/downloads/drivers/download.labview-software-for-frc.html>`__ (Nota: Haga clic en el enlace para “Instaladores individuales sin conexión”)
fr_ca: LabVIEW USB (à partir de *FIRST*\ |reg| Choice) ou `Télécharger <https://www.ni.com/en-us/support/downloads/drivers/download.labview-software-for-frc.html>`__ (Note: Cliquer sur le lien pour "Individual Offline Installers")
he_il: LabVIEW USB (מ-*FIRST*\ |reg| Choice) או `הורדה <https://www.ni.com/en-us/support/downloads/drivers/download.labview-software-for-frc.html>`__ (הערה: בחרו בלינק עבור "Individual Offline Installers")
zh_cn: · LabVIEW USB（来自FIRST®Choice）或`下载 <https://www.ni.com/en-us/support/downloads/drivers/download.labview-software-for-frc.html>`__ （注意：单击“单个离线安装程序”的链接）

source: Java/C++ Teams
es_mx: Equipos Java/C++
fr_ca: Équipes Java/C++
he_il: קבוצות Java או C++
zh_cn: Java / C ++团队

source: The 2022 Java/C++ installer is not yet available, the link currently points to where it will be posted. It is expected to be available on or before afternoon on 1/7/22.
fr_ca: Le logiciel d’installation Java/C++ 2022 n’est pas encore disponible, le lien pointe actuellement vers l’endroit où il sera publié. Il devrait être disponible au plus tard le 7/1/22 en après-midi .

source: `Java/C++ WPILib Installer <https://github.com/wpilibsuite/allwpilib/releases>`__
fr_ca: `Logiciel d'installation de la librairie Java/C++ WPILib <https://github.com/wpilibsuite/allwpilib/releases>`__
he_il: `תוכנת ההתקנה (installer) של Java/C++ WPILib <https://github.com/wpilibsuite/allwpilib/releases>`__
zh_cn: `Java/C++ WPILib 安装程序 <https://github.com/wpilibsuite/allwpilib/releases>`__

source: After downloading the Java/C++ WPILib installer, run it once while connected to the internet and download VS Code for all platforms and save the downloaded VS Code zip file for future offline installations.
es_mx: Después de descargar el instalador de Java/C++ WPILib, ejecútelo una vez mientras esté conectado a Internet y descargue el VS Code para todas las plataformas y guarde el archivo zip del VS Code para futuras instalaciones fuera de línea.
fr_ca: Après avoir téléchargé le logiciel d'installation de la librairie Java/C++ WPILib, exécutez-le une fois tout en étant connecté à Internet et téléchargez VS Code pour toutes les plates-formes et enregistrez le fichier zip VS Code téléchargé pour les futures installations hors ligne.
zh_cn: 下载Java / C ++ WPILib安装程序后，在连接到互联网的情况下运行一次，并下载所有平台的VS Code，并保存下载的VS Code zip文件以供将来进行脱机安装。

source: 3rd Party Libraries/Software
es_mx: Bibliotecas / Software de 3eros
fr_ca: Bibliothèques/logiciels tiers
he_il: ספריות ותוכנות של צד שלישי
zh_cn: 第三方库/软件

source: A directory of available 3rd party software that plugs in to WPILib can be found on :ref:`docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries`.
es_mx: Puede encontrar el directorio disponible de software de terceros que conecta con WPILib en :ref:`docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries`.
fr_ca: Un répertoire des logiciels de tierce-partie disponibles qui se connectent à WPILib peut être trouvé à la section :ref:`docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries`.
he_il: תיקיה של תוכנות צד שלישי זמינות שמתחברות ל-WPILib נמצאת כאן: :ref:`docs/software/vscode-overview/3rd-party-libraries:3rd Party Libraries`.
zh_cn: 在第三方库中可以找到可插入WPILib的可用第三方软件的目录。

source: Documentation
es_mx: Documentación
he_il: תיעוד
zh_cn: 文档

source: This documentation can be downloaded for offline viewing. The link to download the PDF can be found `here <https://buildmedia.readthedocs.org/media/pdf/frc-docs/latest/frc-docs.pdf>`__.
es_mx: Esta documentación puede descargarse para su visualización sin conexión. El enlace para descargar el PDF se puede encontrar `aquí <https://buildmedia.readthedocs.org/media/pdf/frc-docs/latest/frc-docs.pdf>`__.
zh_cn: 可以下载此文档以供离线查看。下载PDF的链接可以在 `这里 <https://buildmedia.readthedocs.org/media/pdf/frc-docs/latest/frc-docs.pdf>`__找到。

source: `2021 FRC Game Tools <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__ (Note: Click on link for "Individual Offline Installers")
es_mx: `2021 FRC Game Tools <https://www.ni.com/en-us/support/downloads/drivers/download.frc-game-tools.html>`__ (Nota: Haga clic en el link para "Individual Offline Installers")

source: `2020 FRC Radio Configuration Utility <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0.zip>`__ or `2020 FRC Radio Configuration Utility Israel Version <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0_IL.zip>`__
es_mx: `Utilidad de la Configuración de la Radio para FRC 2020 <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0.zip>`__ o `Utilidad de la Configuración de la Radio para FRC 2020 Versión Israel <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0_IL.zip>`__
zh_cn: `2020 FRC Radio Configuration Utility <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0.zip>`__ 或 `2020 FRC Radio Configuration Utility Israel Version <https://firstfrc.blob.core.windows.net/frc2020/Radio/FRC_Radio_Configuration_20_0_0_IL.zip>`__

source: There are no changes to the radio tool for the 2021 season so the 20.0.0 version remains the latest available.
es_mx: No hay cambios en la herramienta de radio para la temporada 2021, por lo que la versión 20.0.0 sigue siendo la última disponible.
zh_cn: 2021年赛季的无线电工具没有任何变化，因此20.0.0版本仍然是最新的可用版本。

source: After downloading the Java/C++ WPILib installer, run it once while connected to the internet and select :guilabel:`Install for this User` then :guilabel:`Create VS Code zip to share with other computers/OSes for offline install` and save the downloaded VS Code zip file for future offline installations.
he_il: לאחר הורדת תוכנת ההתקנה (installer) של Java/C++ WPILib, הפעילו אותו פעם אחת בזמן חיבור לאינטרנט, בחרו :guilabel:`Install for this User`, לאחר מכן :guilabel:`Create VS Code zip to share with other computers/OSes for offline install` ושמרו את קובץ ה-zip של VS Code שירד עבור התקנות לא מקוונות עתידיות.
