Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/zero-to-robot/step-2/wpilib-setup.po
Languages: tr_tr, zh_cn

source: WPILib Installation Guide
tr_tr: WPILib Kurulum Kılavuzu
zh_cn: WPILib安装指南

source: This guide is intended for Java and C++ teams. LabVIEW teams can skip to :doc:`labview-setup`. Additionally, the below tutorial shows Windows 10, but the steps are identical for all operating systems. Notes differentiating operating systems will be shown.
tr_tr: Bu kılavuz Java ve C ++ ekipleri için hazırlanmıştır. LabVIEW ekipleri şuraya atlayabilir :doc:`labview-setup`. Ek olarak, aşağıdaki eğitici Windows 10'u gösterir, ancak adımlar tüm işletim sistemleri için aynıdır. İşletim sistemlerini farklılaştıran notlar gösterilecektir.
zh_cn: 本指南适用于Java和C ++团队。LabVIEW团队可以跳至安装LabVIEW for FRC（仅LabVIEW）。此外，以下教程使用了Windows 10，但所有操作系统的步骤均相同。将显示区分操作系统的注意事项。

source: Prerequisites
tr_tr: Önkoşullar
zh_cn: 先行准备

source: You can download the latest release of the installer from `GitHub <https://github.com/wpilibsuite/allwpilib/releases/latest/>`__. Ensure that you download the correct binary for your OS and architecture.
tr_tr: Yükleyicinin en son sürümünü `GitHub <https://github.com/wpilibsuite/allwpilib/releases/latest/>`__ adresinden indirebilirsiniz. İşletim sisteminiz ve mimariniz için doğru ikiliyi indirdiğinizden emin olun.
zh_cn: 您可以从`GitHub <https://github.com/wpilibsuite/allwpilib/releases/latest/>`__.下载最新版本的安装程序。确保为您的操作系统和体系结构下载正确的二进制文件。

source: Windows 7 users must have an updated system with `this <https://support.microsoft.com/en-us/help/2999226/update-for-universal-c-runtime-in-windows>`__ update installed.
tr_tr: Windows 7 kullanıcılarının `bu <https://support.microsoft.com/en-us/help/2999226/update-for-universal-c-runtime-in-windows>` __ güncellemesinin yüklü olduğu güncellenmiş bir sisteme sahip olması gerekir.
zh_cn: Windows 7用户必须具有已安装 `此 <https://support.microsoft.com/en-us/help/2999226/update-for-universal-c-runtime-in-windows>`__ 更新的系统。

source: The minimum supported macOS version is Mojave (10.14.x).
tr_tr: Desteklenen minimum macOS sürümü Mojave'dir (10.14.x).
zh_cn: 支持的最低macOS版本是Mojave（10.14.x）。

source: Extracting the Installer
tr_tr: Yükleyiciyi Çıkarma
zh_cn: 解压缩安装程序

source: When you download the WPILib installer, it is distributed as a disk image file ``.iso`` for Windows, ``.tar.gz`` for Linux, and distributed as a ``DMG`` for MacOS.
tr_tr: WPILib yükleyicisini indirdiğinizde, Windows için ``iso``, Linux için ``.tar.gz`` disk görüntü dosyası ve MacOS için bir ``DMG`` olarak dağıtılır.
zh_cn: 当您下载WPILib安装程序时，对于Windows，它作为磁盘映像文件.iso分发；对于Linux，它作为.tar.gz分发；对于MacOS，它作为DMG分发。

source: The menu after right clicking on an .iso file to choose "Mount".
zh_cn: 右键单击 .iso 文件以选择“安装”后的菜单。

source: Other installed programs may associate with iso files and the :guilabel:`mount` option may not appear. If that software does not give the option to mount or extract the iso file, then follow the directions in the "Windows 7" tab.
tr_tr: Diğer yüklü programlar iso dosyalarıyla ilişkilendirilebilir ve: guilabel: `mount` seçeneği görünmeyebilir. Bu yazılım iso dosyasını bağlama veya çıkarma seçeneği sunmuyorsa, "Windows 7" sekmesindeki talimatları izleyin.
zh_cn: 其他已安装的程序可能与iso文件关联，并且 :guilabel:`mount` 选项可能不会出现。如果该软件未提供安装或提取iso文件的选项，请按照“ Windows 7”选项卡中的说明进行操作。

source: You can use `7-zip <https://www.7-zip.org/>`__ to extract the disk image by right-clicking, selecting :guilabel:`7-Zip` and selecting :guilabel:`Extract to...`. Then launch ``WPILibInstaller.exe``
tr_tr: `7-zip <https://www.7-zip.org/>`__ 'i, sağ tıklayıp :guilabel:`7-Zip` and selecting :guilabel:`Extract to...`. seçerek disk görüntüsünü çıkarmak için kullanabilirsiniz. Ardından ``WPILibInstaller.exe`` dosyasını başlatın
zh_cn: 您可以使用 `7-zip <https://www.7-zip.org/>`__ 来提取磁盘映像，方法是右键单击，选择:guilabel:`7-Zip`，然后选择:guilabel:`解压缩到...`。然后启动``WPILibInstaller.exe''

source: After right clicking on the .iso file go to "7-Zip" then "Extract to....".
zh_cn: 右键单击 .iso 文件后，转到“7-Zip”，然后“解压至....”。

source: macOS users can double click on the downloaded ``DMG`` and then select ``WPILibInstaller`` to launch the application.
tr_tr: macOS kullanıcıları, indirilen ``DMG`` ye çift tıklayabilir ve ardından uygulamayı başlatmak için ``WPILibInstaller`` öğesini seçebilir.
zh_cn: macOS用户可以双击下载的``DMG''，然后选择``WPILibInstaller''以启动应用程序。

source: Show the macOS screen after double clicking the DMG file.
zh_cn: 双击 DMG 文件后显示 macOS 屏幕。

source: Linux users should extract the downloaded ``.tar.gz`` and then launch ``WPILibInstaller``. Ubuntu treats executables in the file explorer as shared libraries, so double-clicking won't run them. Run the following commands in a terminal instead with ``<version>`` replaced with the version you're installing.
tr_tr: Linux kullanıcıları indirilen ``.tar.gz`` dosyasını çıkartmalı ve ardından ``WPILibInstaller`` uygulamasını başlatmalıdır. Ubuntu, dosya gezginindeki yürütülebilir dosyaları paylaşılan kitaplıklar olarak değerlendirir, bu nedenle çift tıklamak onları çalıştırmaz. Aşağıdaki komutları, ``<version>`` yerine yüklediğiniz sürümle değiştirerek bir terminalde çalıştırın.
zh_cn: Linux用户应解压缩下载的.tar.gz，然后启动WPILibInstaller。 Ubuntu将文件浏览器中的可执行文件视为共享库，因此双击将不会运行它们。在终端中运行以下命令，而不是将“ <version>”替换为要安装的版本。

source: Running the Installer
tr_tr: Yükleyiciyi Çalıştırma
zh_cn: 运行安装程序

source: Upon opening the installer, you'll be presented with the below screen. Go ahead and press :guilabel:`Start`.
tr_tr: Yükleyiciyi açtığınızda, aşağıdaki ekran ile karşılaşacaksınız. Devam edin ve basın :guilabel:`Start`.
zh_cn: 打开安装程序后，将显示以下屏幕。继续并按：Start。

source: Start of Installer
zh_cn: 安装程序启动

source: This next screen involves downloading VS Code. Unfortunately, due to licensing reasons, VS Code can not be bundled with the installer.
tr_tr: Bu sonraki ekran VS Kodunun indirilmesini içerir. Ne yazık ki, lisanslama nedenlerinden dolayı VS Code yükleyiciyle birlikte paketlenemez.
zh_cn: 下一个界面涉及下载VS Code。不幸的是，由于许可原因，VS Code无法与安装程序捆绑在一起。

source: Overview of VS Code download options
zh_cn: VS Code 下载选项概述

source: Download VS Code for Single Install
tr_tr: Tek Kurulum için VS Kodunu İndirin
zh_cn: 下载VS Code进行单一安装

source: This downloads VS Code only for the current platform, which is also the smallest download.
tr_tr: Bu, VS Code'u yalnızca aynı zamanda en küçük indirme olan mevcut platform için indirir.
zh_cn: 这仅下载当前平台的VS Code，这也是最小的下载。

source: Skip installing VS Code
tr_tr: VS Code yüklemeyi atla
zh_cn: 跳过安装VS Code

source: Skips installing VS Code. Useful for advanced installations or configurations. Generally not recommended.
tr_tr: VS Code'u yüklemeyi atlar. Gelişmiş kurulumlar veya konfigürasyonlar için kullanışlıdır. Genellikle tavsiye edilmez.
zh_cn: 跳过安装VS Code。对于高级安装或配置很有用。通常不推荐。

source: Use Downloaded Offline Installer
tr_tr: İndirilen Çevrimdışı Yükleyiciyi Kullan
zh_cn: 使用下载的脱机安装程序

source: Selecting this option will bring up a prompt allowing you to select a pre-existing zip file of VS Code that has been downloaded by the installer previously. This option does **not** let you select an already installed copy of VS Code on your machine.
tr_tr: Bu seçeneğin seçilmesi, daha önce yükleyici tarafından indirilmiş VS Code'un önceden var olan bir zip dosyasını seçmenize olanak tanıyan bir komut istemini açacaktır. Bu seçenek, makinenize VS Code'un önceden yüklenmiş bir kopyasını seçmenize **not-izin vermez**.
zh_cn: 选择此选项将弹出提示，允许您选择安装程序先前已下载的VS Code压缩文件。该选项不是让您在机器上选择一个已安装VS代码的副本。

source: Download VS Code for Offline Install
tr_tr: Çevrimdışı Kurulum için VS Kodunu İndirin
zh_cn: 下载VS Code以进行离线安装

source: This option downloads and saves a copy of VS Code for all platforms, which is useful for sharing the copy of the installer.
tr_tr: Bu seçenek, tüm platformlar için VS Code'un bir kopyasını indirir ve kaydeder; bu, yükleyicinin kopyasını paylaşmak için yararlıdır.
zh_cn: 此选项为所有平台下载并保存VS Code的副本，这对于共享安装程序的副本很有用。

source: Go ahead and select :guilabel:`Download VS Code for Single Install`. This will begin the download process and can take a bit depending on internet connectivity (it's ~60MB). Once the download is done, select :guilabel:`Next`. You should be presented with a screen that looks similar to the one below.
tr_tr: Devam edin ve seçin :guilabel:`Download VS Code for Single Install`. Bu, indirme işlemini başlatır ve internet bağlantısına bağlı olarak biraz zaman alabilir (~ 60MB). İndirme tamamlandığında, seçin :guilabel:`Next`. Aşağıdakine benzer bir ekranla karşılaşacaksınız.
zh_cn: 继续并选择“下载VS代码以进行单次安装”。这将开始下载过程，并且可能需要一点时间，具体取决于Internet连接（大约60MB）。下载完成后，选择“下一步”。您应该会看到一个类似于以下窗口的窗口。

source: An overview of the installer options
zh_cn: 安装程序选项概述

source: This showcases a list of options included with the WPILib installation. It's advised to just leave the default options selected.
tr_tr: Bu, WPILib kurulumuna dahil olan seçeneklerin bir listesini gösterir. Varsayılan seçenekleri seçili bırakmanız önerilir.
zh_cn: 这展示了WPILib安装随附的选项列表。建议仅选择默认选项。

source: You will notice two buttons, :guilabel:`Install for this User` and :guilabel:`Install for all Users`. :guilabel:`Install for this User` only installs it on the current user account, and does not require administrator privileges. However, :guilabel:`Install for all Users` installs the tools for all system accounts and *will* require administrator access. :guilabel:`Install for all Users` is not an option for macOS and Linux.
tr_tr: İki düğme göreceksiniz :guilabel:`Install for this User` ve :guilabel:`Install for all Users`. :guilabel:`Install for this User` yalnızca mevcut kullanıcı hesabına yükler ve yönetici ayrıcalıkları gerektirmez. Ancak, :guilabel:`Install for all Users` , tüm sistem hesapları için araçları yükler ve *will-yönetici erişimi gerektirir *. :guilabel:`Install for all Users` , macOS ve Linux için bir seçenek değildir.
zh_cn: 您会注意到两个按钮，“为此用户安装”和“为所有用户安装”。为此用户安装仅将其安装在当前用户帐户上，并且不需要管理员特权。然而，为所有用户安装安装工具，所有系统帐户和将需要管理员权限。为所有用户安装不是macOS和Linux的选项。

source: Select the option that is appropriate for you, and you'll presented with the following installation screen.
tr_tr: Size uygun seçeneği seçin ve aşağıdaki kurulum ekranını göreceksiniz.
zh_cn: 选择适合您的选项，然后将显示以下安装界面。

source: Installer progress bar
zh_cn: 安装进度条

source: After installation is complete, you will be presented with the finished screen.
tr_tr: Kurulum tamamlandıktan sonra, bitmiş ekran ile karşılaşacaksınız.
zh_cn: 安装完成后，将显示完成的界面。

source: Installer finished screen.
zh_cn: 安装程序完成界面。

source: WPILib installs a separate version of VS Code than into an already existing installation. Each year has it's own copy of the tools appended with the year. IE: ``WPILib VS Code 2021``. Please launch the WPILib VS Code and not a system installed copy!
zh_cn: WPILib将安装单独的VS Code版本，而不是将其安装到现有安装中。每年都有自己的工具副本，并附有年份。 IE：``WPILib VS代码2021''。请启动WPILib VS Code，而不是系统安装的副本！

source: Congratulations, the WPILib development environment and tooling is now installed on your computer! Press Finish to exit the installer.
tr_tr: Tebrikler, WPILib geliştirme ortamı ve araçları artık bilgisayarınızda yüklü! Yükleyiciden çıkmak için Bitir'e basın.
zh_cn: 恭喜，您的计算机上现已安装WPILib开发环境和工具！按完成退出安装程序。

source: Post-Installation
tr_tr: Yükleme sonrası
zh_cn: 安装后

source: Some operating systems require some final action to complete installation.
tr_tr: Bazı işletim sistemleri, kurulumu tamamlamak için bazı son eylemler gerektirir.
zh_cn: 某些操作系统需要某些最终操作才能完成安装。

source: After installation, the installer opens the WPILib VS Code folder. Drag the VS Code application to the dock. Eject WPILibInstaller image from the desktop.
tr_tr: Kurulumdan sonra, yükleyici WPILib VS Code klasörünü açar. VS Code uygulamasını yuvaya sürükleyin. WPILibInstaller görüntüsünü masaüstünden çıkarın.
zh_cn: 安装后，安装程序将打开WPILib VS Code文件夹。将VS Code应用程序拖到扩展坞上。从桌面弹出WPILibInstaller映像。

source: Some versions of Linux (e.g. Ubuntu 20.04) require you to give the desktop shortcut the ability to launch. Right click on the desktop icon and select Allow Launching.
tr_tr: Bazı Linux sürümleri (ör. Ubuntu 20.04) masaüstü kısayoluna başlatma yeteneği vermenizi gerektirir. Masaüstü simgesine sağ tıklayın ve Başlatmaya İzin Ver'i seçin.
zh_cn: 某些版本的Linux（例如Ubuntu 20.04）要求您赋予桌面快捷方式启动功能。右键单击桌面图标，然后选择允许启动。

source: Menu that pops up after right click the desktop icon in Linux.
zh_cn: 在 Linux 中右键单击桌面图标后弹出的菜单。

source: Installing desktop tools and rebooting will create a folder on the desktop called ``YYYY WPILib Tools``, where ``YYYY`` is the current year. Desktop tool shortcuts are not available on Linux and MacOS.
tr_tr: Masaüstü araçlarının yüklenmesi ve yeniden başlatılması, masaüstünde ``YYYY`` nin cari yıl olduğu `` YYYY WPILib Tools`` adlı bir klasör oluşturacaktır. Masaüstü aracı kısayolları Linux ve MacOS'ta kullanılamaz.
zh_cn: 安装桌面工具，并重新启动将会创建一个名为YYYY WPILib Tools的文件夹到桌面，YYYY是当前年份。桌面工具快捷方式在Linux和MacOS上不可用。

source: What is Installed?
tr_tr: Ne Yüklenir?
zh_cn: 安装了什么？

source: The Offline Installer installs the following components:
tr_tr: Çevrimdışı Yükleyici aşağıdaki bileşenleri yükler:
zh_cn: 脱机安装程序将安装以下组件：

source: **Visual Studio Code** - The supported IDE for 2019 and later robot code development. The offline installer sets up a separate copy of VS Code for WPILib development, even if you already have VS Code on your machine. This is done because some of the settings that make the WPILib setup work may break existing workflows if you use VS Code for other projects.
tr_tr: **Visual Studio Code** - 2019 ve sonraki robot kodu geliştirme için desteklenen IDE. Çevrimdışı yükleyici, makinenizde zaten VS Kodunuz olsa bile, WPILib geliştirme için VS Code'un ayrı bir kopyasını ayarlar. Bu, WPILib kurulumunun çalışmasını sağlayan bazı ayarların, diğer projeler için VS Code kullanırsanız mevcut iş akışlarını bozabileceği için yapılır.
zh_cn: ** Visual Studio代码**-受支持的IDE，适用于2019及更高版本的机器人代码开发。即使您的计算机上已经安装了VS Code，脱机安装程序也会为WPILib开发设置单独的VS Code副本。这样做是因为，如果您将VS Code用于其他项目，则使WPILib安装程序起作用的某些设置可能会破坏现有的工作流程。

source: **C++ Compiler** - The toolchains for building C++ code for the roboRIO
tr_tr: **C ++ Derleyici ** - roboRIO için C ++ kodu oluşturmaya yönelik araç zincirleri
zh_cn: ** C ++编译器**-用于为roboRIO构建C ++代码的工具链

source: **Gradle** - The specific version of Gradle used for building/deploying C++ or Java robot code
tr_tr: **Gradle ** - C ++ veya Java robot kodu oluşturmak/dağıtmak için kullanılan belirli Gradle sürümü
zh_cn: ** Gradle **-用于构建/部署C ++或Java机器人代码的Gradle的特定版本

source: **Java JDK/JRE** - A specific version of the Java JDK/JRE that is used to build Java robot code and to run any of the Java based Tools (Dashboards, etc.). This exists side by side with any existing JDK installs and does not overwrite the JAVA_HOME variable
tr_tr: **Java JDK / JRE ** - Java robot kodu oluşturmak ve Java tabanlı Araçlardan herhangi birini (Gösterge Tabloları, vb.) Çalıştırmak için kullanılan Java JDK / JRE'nin belirli bir sürümü. Bu, mevcut herhangi bir JDK kurulumuyla yan yana bulunur ve JAVA_HOME değişkeninin üzerine yazmaz
zh_cn: ** Java JDK / JRE **-Java JDK / JRE的特定版本，用于构建Java机器人代码并运行任何基于Java的工具（Dashboards等）。它与任何现有的JDK安装并存，并且不会覆盖JAVA_HOME变量

source: **WPILib Tools** - SmartDashboard, Shuffleboard, RobotBuilder, Outline Viewer, Pathweaver, Glass
tr_tr: ** WPILib Araçları ** - SmartDashboard, Shuffleboard, RobotBuilder, Outline Viewer, Pathweaver, Glass
zh_cn: ** WPILib工具**-SmartDashboard，Shuffleboard，RobotBuilder，Outline Viewer，Pathweaver，Glass

source: **WPILib Dependencies** - OpenCV, etc.
tr_tr: **WPILib Bağımlılıkları** - OpenCV vb.
zh_cn: ** WPILib依赖项**-OpenCV等

source: **VS Code Extensions** - WPILib extensions for robot code development in VS Code
tr_tr: **VS Code Uzantıları** - VS Code'da robot kodu geliştirme için WPILib uzantıları
zh_cn: ** VS Code Extensions **-用于VS Code中的机器人代码开发的WPILib扩展

source: Uninstalling
tr_tr: Kaldırma
zh_cn: 卸载

source: WPILib is designed to install to different folders for different years, so that it is not necessary to uninstall a previous version before installing this year's WPILib. However, the following instructions can be used to uninstall WPILib if desired.
tr_tr: WPILib, bu yılki WPILib'i kurmadan önce önceki bir sürümü kaldırmaya gerek kalmaması için farklı yıllar boyunca farklı klasörlere yüklenecek şekilde tasarlanmıştır. Ancak, istenirse aşağıdaki talimatlar WPILib'i kaldırmak için kullanılabilir.
zh_cn: WPILib旨在在不同的年份安装到不同的文件夹，因此在安装今年的WPILib之前不必卸载以前的版本。但是，如果需要，可以使用以下说明卸载WPILib。

source: Windows
zh_cn: Windows 系统

source: Delete the appropriate wpilib folder (2019: ``c:\Users\Public\frc2019``, 2020 and later: ``c:\Users\Public\wpilib\YYYY`` where ``YYYY`` is the year to uninstall)
tr_tr: Uygun wpilib klasörünü silin (2019: ``c:\Users\Public\frc2019``, 2020 ve sonrası: ``c:\Users\Public\wpilib\YYYY`` burada ``YYYY`` kaldırılacak yıldır)
zh_cn: 删除适当的wpilib文件夹（2019：``c：\ Users \ Public \ frc2019``，2020及更高版本：``c：\ Users \ Public \ wpilib \ YYYY``其中``YYYY''是要卸载的年份）

source: Delete the desktop icons at ``C:\Users\Public\Public Desktop``
tr_tr: ``C:\Users\Public\Public Desktop`` konumundaki masaüstü simgelerini silin.
zh_cn: 删除``C：\ Users \ Public \ Public Desktop''中的桌面图标

source: Delete the path environment variables.
tr_tr: Yol ortam değişkenlerini silin.
zh_cn: 删除路径环境变量。

source: In the start menu, type environment and select "edit the system environment variables"
tr_tr: Başlangıç menüsünde ortam yazın ve "edit the system environment variables-sistem ortamı değişkenlerini düzenle" yi seçin
zh_cn: 在开始菜单中，输入环境，然后选择“编辑系统环境变量”

source: Click on the environment variables button (1).
tr_tr: Ortam değişkenleri düğmesine (1) tıklayın.
zh_cn: 单击环境变量按钮（1）。

source: In the user variables, select path (2) and then click on edit (3).
tr_tr: Kullanıcı değişkenlerinde, yolu (2) seçin ve ardından düzenle (3) üzerine tıklayın.
zh_cn: 在用户变量中，选择路径（2），然后单击编辑（3）。

source: Select the path with ``roborio\bin`` (4) and click on delete (5).
tr_tr: Yolu ``roborio\bin`` (4) ile seçin ve sil'e (5) tıklayın.
zh_cn: 用``roborio \ bin``选择路径（4），然后单击Delete（5）。

source: Select the path with ``frccode`` and click on delete (5).
tr_tr: ``frccode`` ile yolu seçin ve sil'e tıklayın (5).
zh_cn: 用``frccode''选择路径，然后单击Delete（5）。

source: Repeat steps 3-6 in the Systems Variable pane.
tr_tr: Sistem Değişkeni bölmesinde 3-6 adımlarını tekrarlayın.
zh_cn: 在“系统变量”窗格中重复步骤3-6。

source: The "System Properties", "Environment Variables", and "Edit Environment Variables" screens.
zh_cn: “系统属性”、“环境变量”和“编辑环境变量”界面。

source: Delete the appropriate wpilib folder (2019: ``~/frc2019``, 2020 and later: ``~/wpilib/YYYY`` where ``YYYY`` is the year to uninstall)
tr_tr: Uygun wpilib klasörünü silin (2019: `` ~/ frc2019``, 2020 ve sonrası: `` ~/wpilib/YYYY`` burada ``YYYY`` kaldırılacak yıldır)
zh_cn: 删除适当的wpilib文件夹（2019：``〜/ frc2019``，2020及更高版本：``〜/ wpilib / YYYY``其中``YYYY``是要卸载的年份）

source: Delete the appropriate wpilib folder (2019: ``~/frc2019``, 2020 and later: ``~/wpilib/YYYY`` where ``YYYY`` is the year to uninstall). eg ``rm -rf ~/wpilib/YYYY``
tr_tr: Uygun wpilib klasörünü silin (2019: ``~ /frc2019``, 2020 ve sonrası: `` ~ / wpilib / YYYY`` burada ``YYYY`` kaldırılacak yıldır). örneğin ``rm -rf ~ / wpilib / YYYY``
zh_cn: 删除适当的wpilib文件夹（2019：``〜/ frc2019``，2020及更高版本：``〜/ wpilib / YYYY``，其中``YYYY''是要卸载的年份）。例如``rm -rf〜/ wpilib / YYYY''

source: Troubleshooting
tr_tr: Sorun giderme
zh_cn: 故障排除

source: In case the installer fails, please open an issue on the installer repository. A link is available `here <https://github.com/wpilibsuite/wpilibinstaller-avalonia>`__. The installer should give a message on the cause of the error, please include this in the description of your issue.
tr_tr: Yükleyicinin başarısız olması durumunda, lütfen yükleyici havuzunda bir sorun açın. Burada bir bağlantı mevcuttur <https://github.com/wpilibsuite/wpilibinstaller-avalonia> `__. Yükleyici, hatanın nedeni hakkında bir mesaj vermelidir, lütfen bunu sorununuzun açıklamasına ekleyin.
zh_cn: 如果安装程序失败，请在安装程序库中打开反馈问题。`此处 <https://github.com/wpilibsuite/wpilibinstaller-avalonia>`__提供链接。安装程序在错误时应会报错，请在您的问题说明中提供有关错误原因的报错信息。
