Repository: GrahamSH-LLK/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/trajectories/transforming-trajectories.po
Languages: tr_tr

source: Transforming Trajectories
tr_tr: Yörüngeleri Dönüştürmek

source: Trajectories can be transformed from one coordinate system to another and moved within a coordinate system using the ``relativeTo`` and the ``transformBy`` methods. These methods are useful for moving trajectories within space, or redefining an already existing trajectory in another frame of reference.
tr_tr: Yörüngeler bir koordinat sisteminden diğerine dönüştürülebilir ve bir koordinat sistemi içinde "relativeTo'' ve "transformBy'' yöntemleri kullanılarak taşınabilir. Bu yöntemler, uzayda yörüngeleri hareket ettirmek veya başka bir referans çerçevesinde zaten var olan bir yörüngeyi yeniden tanımlamak için kullanışlıdır.

source: Neither of these methods changes the shape of the original trajectory.
tr_tr: Bu yöntemlerin hiçbiri orijinal yörüngenin şeklini değiştirmez.

source: The ``relativeTo`` Method
tr_tr: "relativeTo'' Metodu

source: The ``relativeTo`` method is used to redefine an already existing trajectory in another frame of reference. This method takes one argument: a pose, (via a ``Pose2d`` object) that is defined with respect to the current coordinate system, that represents the origin of the new coordinate system.
tr_tr: "relativeTo'' metodu, başka bir referans çerçevesinde zaten mevcut bir yörüngeyi yeniden tanımlamak için kullanılır. Bu yöntem bir argüman alır: yeni koordinat sisteminin başlangıcını temsil eden mevcut koordinat sistemine göre tanımlanan bir poz (bir " Pose2d'' nesnesi aracılığıyla).

source: For example, a trajectory defined in coordinate system A can be redefined in coordinate system B, whose origin is at (3, 3, 30 degrees) in coordinate system A, using the ``relativeTo`` method.
tr_tr: Örneğin, A koordinat sisteminde tanımlanan bir yörünge, orijini A koordinat sisteminde (3, 3, 30 derece) olan B koordinat sisteminde ``relativeTo`` yöntemi kullanılarak yeniden tanımlanabilir.

source: The ``transformBy`` Method
tr_tr: ``transformBy`` Metodu

source: The ``transformBy`` method can be used to move (i.e. translate and rotate) a trajectory within a coordinate system. This method takes one argument: a transform (via a ``Transform2d`` object) that maps the current initial position of the trajectory to a desired initial position of the same trajectory.
tr_tr: ``transformBy`` metodu, bir koordinat sistemi içindeki bir yörüngeyi hareket ettirmek (yani çevirmek ve döndürmek) için kullanılabilir. Bu yöntem bir argüman alır: yörüngenin mevcut başlangıç konumunu aynı yörüngenin istenen bir başlangıç konumuna eşleyen bir dönüşüm (bir ``Transform2d`` nesnesi aracılığıyla).

source: For example, one may want to transform a trajectory that begins at (2, 2, 30 degrees) to make it begin at (4, 4, 50 degrees) using the ``transformBy`` method.
tr_tr: Örneğin, ``transformBy`` yöntemini kullanarak (2, 2, 30 derece) 'de başlayan bir yörüngeyi (4, 4, 50 derece) başlaması için dönüştürmek isteyebilirsiniz.

source: In the diagram above, the original trajectory, which starts at (2, 2) and at 30° is visible in blue. After applying the transform above, the resultant trajectory's starting location is changed to (4, 4) at 50°. The resultant trajectory is visible in orange.
tr_tr: Yukarıdaki diyagramda, (2, 2) 'de ve 30 ° 'de başlayan orijinal yörünge mavi olarak görülebilir. Yukarıdaki dönüşümü uyguladıktan sonra, ortaya çıkan yörüngenin başlangıç konumu 50 ° 'de (4, 4) olarak değiştirilir. Ortaya çıkan yörünge turuncu renkte görünür.
